// Created by MetaMS
// Quest ID:16059
// [楓之谷聯盟]介紹楓之谷聯盟


npc.id(9010106).next().say("你好，#b勇士#k！很高興見到你～\r\n你超過60級啦？");
npc.me().next().say("你是哪位？");
npc.id(9010106).next().say("我是#b#e會計小姐#n#k。\r\n\r\n為了幫助超過#r60級#k的楓之谷世界勇士們成長，我們正在推進#r新的項目#k。");
npc.id(9010106).next().say("通過該項目，勇士們可以獲得#e#r非常好的獎勵#k#n。\r\n你想聽我介紹一下嗎？");
npc.id(9010106).next().say("經過漫長的旅行，我發現了一座#b島#k。\r\n那裡有很多#r可怕的龍#k。\r\n我小心翼翼地躲開那些#b龍#k，想要從島上離開……\r\n\r\n啊，但是！有一頭#r像房子一樣大的龍#k擋在了我的面前！");
npc.id(9010106).next().say("大吃一驚的我當場就呆住了……\r\n這時候！不知從哪裡突然冒出了許多的勇士，大家齊心協力，一瞬間就將#r巨龍#k給打敗了！");
npc.id(9010106).next().say("然後大家將龍掉落的#b大量的戰利品#k也一併分走了，這些勇士之中，既有看上去異常強大的人，也有一些並非如此。");
npc.id(9010106).next().say("看到它的瞬間，我突然明白了。\r\n為什麼我們無法繼續成長！");
npc.id(9010106).next().say("#e那便是因為！#n\r\n我們是獨自一人。不管如何強大，孤身一人的勇士也難以擊退那麼強壯和龐大的龍，而正因為他們#b齊心協力#k，才能輕易將龍拿下。");
npc.id(9010106).next().say("我認為楓之谷世界勇士#r要想變得更強#k，#b合作精神#k是必不可少的。\r\n因此我決定果斷放下過去的工作，開始推進#b新的項目#k。");
npc.id(9010106).next().say("那個項目的名字就是#b#e<楓之谷聯盟>#n#k！\r\n\r\n我想讓在#r獨自成長#k過程中遇到瓶頸的勇士們明白#b協作的力量#k，幫助他們更快地成長。");
npc.id(9010106).next().say("勇士！\r\n你想和我一起打造一個強大的#b#e<楓之谷聯盟>#k#n嗎？");
npc.id(9010106).next().say("請稍等一下。\r\n我馬上做好創建<楓之谷聯盟>的準備！");
npc.completeQuest();