// Created by MetaMS
// Quest ID:16880
// [教學]來了解回家卷軸吧


npc.id(9010000).next().say("您好，#b#e#h0##n#k！\r\n我想為來到#e#b楓之谷#k#n的勇士略盡微薄之力！");
npc.id(9010000).next().say("您知道#i2030059##e#b[回家卷軸]#k#n嗎？");
npc.id(9010000).next().say("#e#b[回家卷軸]#k#n可讓\r\n勇士移動到距離當前位置 #r#e最近的村莊#k#n。\r\n如果在狩獵途中想返回村莊，使用此卷軸便可節省步行時間，是非常實用的道具。");
npc.id(9010000).next().say("但請別忘記，#e#r使用時#k#n將會移動到村莊，並且消耗#e#r一個#k#n回家卷軸。\r\n另外請記住，在部分#e#r不能瞬間移動的地區#k#n無法使用回家卷軸。");
npc.id(9010000).next().say("最後，#b[回家卷軸]#k#n可透過鄰近村莊的#b#e雜貨商人#n#k購買。");
if (npc.id(9010000).askYesNo("現在我想給勇士#b[回家卷軸]#k。\r\n是否立即領取#i2030059##e#b[回家卷軸]10個#k#n？")) {
        if (stage.gainItem(2030059, 10)) {
                npc.completeQuest();
                npc.id(9010000).say("已給您#i2030059##e#b[回家卷軸]10個#k#n。\r\n\r\n希望對#e#b#h0##k#n的冒險有幫助！");
        } else {
                npc.id(9010000).ui(1).say("#face1# 背包空間不足，請清理後在跟我對話吧!");
        }
} else {
        /* Response is No */
        npc.id(9010000).say("如果想取得#i2030059##e#b[回家卷軸]#k#n，請再次點擊頭上的燈泡。");
}