// Created by MetaMS
// Quest ID:17523
// [培羅德]墮落的培羅德的身體上發生龜裂


npc.next().say("你是誰。");
npc.next().say("很多人經過這裡，但很多人都失敗。 可是你的強勢跟其它人完全不同。");
npc.next().say("我是幻影森林變更前，守護那裡的主人世界樹的存在。 ");
npc.next().say("但，幻影森林因為憤怒的關係失去方向，過去崇拜克拉奇亞的世界樹， 光魔法師對付娜里凱仁後封印了他，受到這樣的影響克拉奇亞沉到海上後，克拉奇亞文明就這樣消失 。之後那個力量的關係， 世界樹的心臟也一起汙染後一起墮落了。 ");
npc.next().say("之後世界樹變成黑暗的君主。這是很久之前的事情。");
npc.next().say("記住高貴的他的名字的人們現在都不在。現在把這位君主叫培羅德。");
if (npc.noEsc().askAccept("我幫你開路。打破培羅德的身體，讓他的心臟回到溫暖的那個時候。")) {
        /* Response is Yes */
        npc.next().say("好～那進到那個人的身體裡吧。");
        npc.startQuest();
} else {
        /* Response is No */
        npc.say("需要變更強呢。");
}