// Created by MetaMS
// Quest ID:17524
// [培羅德]淨化


npc.next().say("這裡是在培羅德還是愛心樹的時候，用他的心所創造的地方。");
npc.next().say("我以我的力量，憑藉著對愛心樹的思念，以及堅信他總有一天可以恢復原來樣子的想法來守護這裡。但是經過這麼長久的墮落，不知道是否還有機會恢復原來的樣子。");
npc.next().say("培羅德是獨一無二的存在。攻擊他的頭部就有可能擊敗他，但是這並不容易。因為他的手和腳是不會讓你這樣做的。");
npc.next().say("先制服培羅德的手腳也是個不錯的方法。解決培羅德的四肢，接下來可能就會容易些。當然也有可以直接攻擊頭部的方法，但不管是哪一種都不容易。");
if (npc.askYesNo("願意幫助我嗎？")) {
        /* Response is Yes */
        npc.startQuest();
        npc.next().say("謝謝你，那就萬事拜託了。");
} else {
        /* Response is No */
        npc.say("真可惜，當然只憑你的力量是不夠的。");
}