// Created by MetaMS
// Quest ID:25968
// 裝備強化助言

let selection = npc.askMenu("有什麼我可以幫忙的嗎？\r\n\r\n#b#L0# 卷軸強化#l\r\n#b#L1# 星力強化#l\r\n#b#L2# 裝備繼承 #l\r\n#b#L3# 結束說明#l");
if (selection == 0) {
        npc.next().say("現在讓我來為你說明消耗裝備可升級的次數以及強化裝備的#卷軸強化#k相關資訊。");
        npc.next().say("卷軸強化需要#b咒文的痕跡#k，可透過狩獵或分解卷軸取得。卷軸分解可使用其他玩家的卷軸分解機，或是經由35級以上可習得的專業技術- 煉金術分解。");
        npc.next().say("只要放入裝備即會標示出可使用的卷軸，從中選擇想要使用的強化卷軸後，點選開始強化就可開始挑戰強化。簡單吧？但是，需要足夠的#咒文的痕跡#k做為材料喔。");
        npc.next().say("根據選擇的卷軸也有可能會升級失敗，請注意！如果失敗的話，除了裝備沒有升級之外，還會扣除可升級的次數。");
        npc.next().say("卷軸中擁有特殊功能的回真卷軸和純白的卷軸，即使失敗了也不會抵銷可升級的次數。");
        npc.next().say("另外，針對防具，無論任何強化方式，當第四次嘗試使用咒文的痕跡強化成功時，攻擊力及魔力額外增加1。防具一定要使用咒文的痕跡強化，對吧？");
        npc.say("假如透過卷軸強化消耗全部的升級次數後，即可進行星力強化。也有無法星力強化的裝備，請記住。");
} else if (selection == 1) {
        npc.next().say("那麼現在讓我來為你說明消耗完裝備強化次數後的下一步#b星力強化#k吧！");
        npc.next().say("需要透過卷軸強化消耗所有升級次數的裝備，根據裝備配戴的等級使用楓幣就能嘗試星力強化，依照裝備目前強化的階段而成功率也有所不同。");
        npc.next().say("開始強化時，就會開始吸收賦予在裝備的星星力量。 時間內，讓星星進入中央區塊，使星星停止，吸收星星就會成功，強化成功的機率也會提升。就算失敗成功機率也不會減少。");
        npc.next().say("連續進行星力強化時，星星捕捉會越來越難。");
        npc.next().say("若不想捕捉星星想快點強化的話，請解除星星捕捉。但，若星星捕捉成功時，所得到的強化成功機率增加效果會無法獲得。");
        npc.next().say("因強化失敗而導致星力階段連續下降2次時，將發動強化成功率100%的機會。進行強化裝備替換、頻道移動、用戶端停止回應、移動至角色選擇畫面、使用伺服器統合內容等的行為時，將中止發動機會。");
        npc.next().say("15星以上強化失敗時，裝備很可能就會毀損。但獲得裝備的痕跡就能繼承裝備。詳細內容請參考裝備繼承助語。");
        npc.next().say("如果不希望裝備毀損，額外使用楓幣就能讓毀損機率變成0%。不過，只有強化15星、16星裝備時能使用。");
        npc.say("最後請記住，裝備可強化的極限值是依據裝備配戴的等級所訂定。");
} else if (selection == 2) {
        npc.next().say("那麼，現在讓我來為你說明，裝備毀損後所獲得的裝備的痕跡如何進行#b裝備繼承#k吧！");
        npc.next().say("15星以上的裝備強化失敗時，裝備很可能就會毀損。裝備若是毀損，就能獲得該#b裝備的痕跡#k。");
        npc.next().say("裝備的痕跡有不同於#b最大 12星為止的星力強化#k的其他所有的能力。就算進行過15星以上的星力強化，裝備的痕跡中只會留下12星為止。");
        npc.next().say("經由#b裝備繼承#k可將裝備的痕跡所擁有的能力#b轉移至與之前裝備相同的裝備#k上。");
        npc.next().say("舉例來說：如果獲得'夫尼爾長青劍'的痕跡，可將除了星力強化以外，被破壞的裝備原有的能力轉移至'夫尼爾長青劍'上。");
        npc.next().say("不可轉移至擁有不同名稱與樣貌的裝備上。另外，獲得繼承的裝備其所有能力將替換為痕跡所擁有的能力。");
        npc.next().say("舉例來說，將沒有潛在能力的裝備變成裝備的痕跡之後，繼承至擁有潛在能力的裝備上，則獲得繼承的裝備其潛在能力將消失。");
        npc.say("獲得繼承的裝備最好是沒有高級能力的裝備！請記住這點。");
}
