// Created by MetaMS
// Quest ID:25972
// [星星力量]裝備蘊含的星星力量

npc.noEsc().next().say("#h0#? 嗯嗯. 聽說你在尋找流星的痕跡. 你又試過在流星掉落的地區，狩獵怪物嗎? 那麼應該已經知道狀況了. #b就是怪物不會正常受到傷害#k 的事實. \r\n\r\n 喔, 若沒有任何問題的話，你已經正確使用 #r#e星際之力#k#n的關係. 蛤? 你說不知道我在講什麼? 好吧，我在詳細跟你說明.");
npc.noEsc().next().say("在那裡掉落的流星有特別之力量. 是會讓怪物們變為更殘暴，也會否定一些外在能量的力量. 所以流星掉落地區的怪物不會受到一般性攻擊的傷害. 那麼要如何去無效流星之力? 那解答就是 #r#e星際之力#k#n. ");
npc.noEsc().next().say("強化星際之力的裝備上也有凝聚星之力，你也應該知道了吧? 透過那力量可以抵消怪物的星之力. 簡單來說, 你透過 #r#e星際之力強化#k#n而充分擁有星際之力時, 可以讓怪物受到正常的傷害. \r\n\r\n換個角度來看， #b缺少星際之力時，給的傷害也相對的會減少#k.");
npc.noEsc().next().say("以地區別掉落的流星大小而需要的星際之力數量也會不同. 進入地圖時，會顯示需要的星際之力的數量，再參考進行即可. 這些內容是我們到目前所研究出來的所有內容. 若再研究出其他結果時，我再跟你聯絡吧.");
npc.me().noEsc().next().say("(跟文博士聽到對於星際之力的說明. 把這內容傳給 #p2041026#吧.)");
npc.startQuest();
npc.completeQuest();