// Created by MetaMS
// Quest ID:504622
// [星夜馬戲團] 道公的道術傳授
let flag = true;
while (flag) {
        let selection = npc.id(9401989).askMenu("我會說明#b<道公的祕密道術>#k，好好想想有沒有想傳授的想法，如果有的話就告訴我吧。\r\n#L0##b <道公的祕密道術> 介紹#k#l\r\n#L1##b 聽取<道公的祕密道術>詳細說明#k#l\r\n#L2##b <道公的祕密道術>傳授期間#k\r\n\r\n#L3##e#r <道公的祕密道術> 傳授#k#l\r\n#L999#之後再接收傳授。#l");
        switch (selection) {
                case 0:
                        npc.id(9401989).next().say("看來你很好奇祕密道術。\r\n我會告訴你在武陵流傳的#b祕密秘笈#k！");
                        npc.id(9401989).next().say("#b#e<道公的祕密道術>#n#k是楓之谷帳號內相同世界的#b角色一對#k，分別指定為#r修煉角色#k與#r培訓角色#k，並進行角色養成的秘笈。");
                        npc.id(9401989).next().say("簡單來說，\r\n這個道術是當修練角色消滅#b等級範圍怪物#k時，#b獲得的經驗值一定比例會自動分配給集中目標角色#k的道術。");
                        npc.id(9401989).next().say("換句話說，#r修煉角色#k專心修煉的話，#b培訓角色會獲得#r經驗值並可以升級的道術#k。");
                        npc.id(9401989).next().say("不覺得很驚人嗎！？\r\n修煉的核心是#b忍耐#k和#b集中#k，請好好記住。");
                        npc.id(9401989).next().say("對了，這不是你隨時都能使用的道術。#b在武陵桃園夜晚降臨的期間#k，這是道公會稍微施術讓你可以修煉的道術。");
                        npc.id(9401989).next().say("雖然時間會感覺很短…但這是相對的吧？\r\n修煉#r祕密秘笈#k的話，會感覺到#b兩個角色之間的界限被突破，彼此共享經驗值的瞬間#k。");
                        npc.id(9401989).next().say("如果能持續地#b忍耐#k和#b集中#k，就能更有效地#r成長#k你的#b培訓角色#k。如果對詳細的內容感興趣，就聽詳細的說明吧。呵呵");
                        break;
                case 1:
                        npc.id(9401989).next().say("因為對#b<道公的祕密道術>#k感到很好奇，所以才來找你～？\r\n如果對#b詳細規則#k或#b獎勵#k有興趣，就好好聽清楚了。");
                        npc.id(9401989).next().say("#b#e<道公的祕密道術> 傳授及修煉規則#n#k\r\n\r\n#e[第二]#n\r\n#b指定修煉角色和培訓角色#r每個伺服器只能進行1次#k。\r\n一旦指定完成，#r無論如何都無法取消或變更#k，因此指定時請#b慎重#k。\r\n\r\n#e[第二]#n\r\n#b#e等級高於修煉角色的角色#n#k無法指定為培訓角色，#r無法指定#k。另外，即使指定培訓角色後，培訓角色的等級如果比修煉角色的等級#r更高時，經驗值分配就會中斷#k，一定要記住。\r\n\r\n#e[第三]#n\r\n只有#r200級以上，260級以下#k的角色才能指定為培訓角色。然後指定培訓角色後，#r達到260級時，經驗值分配就會中斷#k，所以最好指定低等級的角色為培訓角色。\r\n\r\n#e[第四]#n\r\n我會告訴你透過#b<祕密道術>#k可獲得的#r#e經驗值#n#k。\r\n指定修煉角色和培訓角色後，傳授#b<祕密道術>#k的話，#b修煉角色#k的畫面上會顯示特殊的#b#e<道公的祕密道術>UI#k#n。\r\n透過該介面可得知#b培訓角色#k的#r#e養成等級#n#k。\r\n\r\n不過有一件事你一定要記住。\r\n如果想讓UI顯示的#r經驗值實際上分配，必須一定要登入培訓角色#k。\r\n另外，在有剩餘未分配的經驗值的狀態下，如果未登入培訓角色，#r活動期間結束後，剩餘的經驗值就會消失#k，請多加注意。\r\n\r\n另外，#b培訓角色#k登入時，<祕密道術> #r正在計算經驗值#k時，將無法#r獲得經驗值或升級#k，地圖移動或任務開始等#r部分遊戲內容使用受到限制#k，最好在經驗值分配完全結束後再移動。另外，在#e跨伺服器頻道#n中，也請注意<祕密道術>的經驗值是不會被發放。\r\n\r\n#e※ #r培訓角色#k的等級與#r經驗值分配率#k#n\r\n - 200級～210級：150%\r\n - 211級～220級：300%\r\n - 221級～230級：600%\r\n - 231級～240級：900%\r\n - 241級～250級：1200%\r\n - 250級～259級：1500%\r\n\r\n#e分配的經驗值#n排除因各種BUFF及特殊效果等部分，#r僅計算於基本經驗值#k。\r\n\r\n#r#e對了，正在參與<道公的祕密道術>的角色無法進行世界移民和角色更名！！\r\n\r\n#n#k#e這樣說明，足夠了嗎？");
                        break;
                case 2:
                        npc.id(9401989).next().say("\r\n#e#b※ <道公的祕密道術>傳授期間#k\r\n\r\n- 開始：2024年 10月 30日 09點 00分\r\n- 結束：2024年 11月 26日 23點 59分");
                        break;
                case 3:
                        if (npc.askYesNo("你已經充分理解<祕密道術>了嗎？\r\n如果已經理解了，可以指定#r#e集中目標角色#n#k嗎？\r\n\r\n※ #b修練角色#k目前指定為目前登入中的#e#r" + stage.getCharacterName() + "#n#k角色。")) {
                                /* Response is Yes */
                                flag = false;
                                stage.selectPTSystemList(1000);
                        } else {
                                /* Response is No */
                                npc.next().say("好啦好啦~\r\n這種事要慎重決定。");
                                npc.next().say("請用想進行祕密道術修練的#r修練角色#k登入後，再跟我說話。");
                                npc.say("\r\n#e#b※ 祕密道術傳授時間#k\r\n\r\n- 開始：2024年 10月 30日 09點 00分\r\n- 結束：2024年 11月 26日 23點 59分");
                        }
                        break;
                case 999:
                        flag = false;
                        break;
        }
}