// Created by MetaMS
// Quest ID:65851
// 紋櫻公主的呼喚：攔下毛利森蘭丸！


npc.id(9130021).ui(1).next().say("#face0#您好，#h0#大人。我是#b#m807000000##k聯盟的一員，叫#b#p9130021##k。");
npc.id(9130021).ui(1).next().say("#face0#您有聽過我們的敵人，同時也是楓之谷世界裡的新威脅勢力，織田軍裡最強的陰陽師#b#p9130090##k嗎？");
npc.id(9130021).ui(1).next().say("#face0##b#p9130090##k是危險的人物。那麼年輕，竟然有著如此強大的力量和知識，並且對擁有力量的野心也非常強大。那走錯了方向的想法是個大問題。");
npc.id(9130021).ui(1).next().say("#face0#主導著異變原因，魔王降臨儀式者的關係，織田軍和我們聯盟會來到楓之谷世界可以說跟這個原因有關。");
if (npc.id(9130021).ui(1).askAccept("#face0#聽說#b#p9130090##k在冰原雪域山脈廢礦深處裡，製作祭壇後，準備著不明儀式。很擔心是不是在準備新的魔王降臨儀式呢。#h0#大人可以幫忙阻擋那傢伙嗎？")) {
        /* Response is Yes */
        npc.id(9130021).ui(1).next().say("#face0#感謝您。請前往冰原雪域山脈的#b#m211041700##k，與#b#p9130087##k大人見面吧。詳細情況請跟那位大人打聽吧。");
        npc.startQuest();
} else {
        /* Response is No */
        npc.id(9130021).ui(1).next().say("#face0##b#p9130090##k是危險的人物。請再考慮一下吧。");
}