// Created by MetaMS
// Quest ID:67012
// [星夜馬戲團] 夜晚的武陵道場導覽


npc.id(9402005).next().say("歡迎，#h0#！\r\n說到#b武陵#k就會想到的！不就是#b武陵道場#k嗎？");
npc.id(9402005).next().say("你明明在享受慶典，卻專程來到這裡，看來你對#b修煉#k相當有興趣。");
npc.id(9402005).next().say("為了像你這樣對修練感興趣的人，預計在天亮前開放#b星夜武陵道場#k。");
npc.id(9402005).next().say("在#b星夜武陵道場#k，將根據在#r限制時間#k內對道場出現的怪物造成的傷害，來發放#b幻想硬幣#k和#r經驗值#k。");
npc.id(9402005).next().say("很有趣吧？不要猶豫，挑戰#b星夜武陵道場#k吧！\r\n準備好再來找我吧。");
npc.id(9402005).next().say("對了，還有一件事。\r\n如果你和我對練，征服#b<星夜武陵道場>100層#k！\r\n我會給你#b特別的禮物#k，努力挑戰吧。");
npc.completeQuest();