// Created by MetaMS
// Quest ID:67000
// [星夜馬戲團] 馬戲團的100倍享受

let flag = true;
while (flag) {
        let selection = npc.id(9401982).askMenu("你好，#h0#～？真是美好的夜晚。呵呵。\r\n有什麼好奇的嗎？\r\n#L0##b#e 1. <星夜馬戲團>#n是什麼？#l\r\n#L1##b#e 2. 請告訴我<裝飾慶典>。#l\r\n#L2##b#e 3. 請為我說明 <幻想硬幣和設計慶典>。#l\r\n#L3##b#e 4. 我想知道<主要活動>。#n#k#l\r\n#L4##b#e 5. 我想知道<支線活動>。#n#k#l\r\n\r\n#L100#現在沒問題～#l");
        switch (selection) {
                case 0:
                        npc.id(9401982).next().say("對反覆的冒險感到厭倦的人將獲得#b新鮮的日常生活#k，對成長感到渴望的人將獲得#b滿滿的成就感#k！我們正是在楓之谷世界各地出現，並舉辦奇蹟般的夜晚慶典的馬戲團。星夜馬戲團並不會定居在特定村莊，而是每年會突然出現在不同的村莊。");
                        npc.id(9401982).next().say("如你所見，這次的慶典地是仙人的村莊，武陵桃園。\r\n聽說居民們為了#h0#準備了很多東西？真的很令人期待吧？呵呵。");
                        npc.id(9401982).next().say("紫色的天空和飄著的天燈，還有清爽的微風～不覺得就像做夢嗎？");
                        npc.id(9401982).next().say("啊，沉浸在感嘆之中，說了很多多餘的話呢。通過#b神仙體驗券#k，盡情享受成為神仙的感覺，嘗試各種體驗吧。呵呵。\r\n\r\n#b活動期間：2024年 11月 26日 23點 59分為止！");
                        break;
                case 1:
                        npc.id(9401982).next().say("果然是熱心的勇士！很好~我來說明一下設計慶典和幻想硬幣吧！");
                        npc.id(9401982).next().say("星夜馬戲團是為了讓所有參加慶典的人以自己想要的方式實現慶典的夢想而存在的。");
                        npc.id(9401982).next().say("還有為了實現這個夢想，我的哥哥#b休菲凱曼#k考慮了幾個方法。考慮之後想到的第一個答案就是#b幻想硬幣#k和#b幻想點數#k。");
                        npc.id(9401982).next().say("首先，#b幻想硬幣#k，是指在活動期間享受慶典並累積幻想點數時，可以獲得的硬幣。可以說是星夜馬戲團的貨幣！\r\n\r\n#r幻想點數每100分#k\r\n#e#b#i4310331:##t4310331:#1個#n#k的價值。");
                        npc.id(9401982).next().say("再來，第二個答案就是#e#b慶典設計#n#k！\r\n慶典設計是指，使用#b#h0##k獲得的#b幻想硬幣#k，在馬戲團提供的圖紙上裝飾各種慶典裝飾！");
                        npc.id(9401982).next().say("親自裝飾慶典，依照自己的喜好設計出的專屬慶典！光想就覺得很興奮吧？");
                        npc.id(9401982).next().say("對了，#b幻想硬幣#k一天最多只能獲得#r300個#k，如果想在慶典期間成為高階設計者，就要勤奮地行動！\r\n\r\n#b活動期間：2024年 11月 26日 23點 59分為止！");
                        break;
                case 2:
                        npc.id(9401982).next().say("#b設計者等級#k，是指可以和馬戲團一起裝飾慶典的資格。等級分為見習者、進階者、老手、大師#r總共四個#k，設計者等級越高，慶典的夜晚就會變得更酷炫！更華麗！一直持續裝飾！");
                        npc.id(9401982).next().say("從現在開始，我會說明各設計者等級和獎勵，請仔細確認~\r\n\r\n#e#b<見習者等級>#n#k\r\n#e[獎勵]#n 提供活動技能強化等級#b1#k\r\n#e[特別優惠]#n#e 提供極限燃燒加速器#n\r\n\r\n#e#b<進階者等級>#n#k\r\n#e[獎勵]#n 提供活動技能強化等級#b2#k\r\n#e[特別優惠]#n#e 裝備傳授#n : 根據收到的角色，變換種類和能力值傳授裝備\r\n\r\n#e#b<老手等級>#n#k\r\n#e[獎勵]#n 提供活動技能強化等級#b3#k\r\n#e[特別優惠]#n#e 髮型移動#n : 輸出角色髮型後，配發可在帳號內移動的<特別髮型移動券>\r\n\r\n#e#b<大師等級>#n#k\r\n#e[獎勵]#n 提供活動技能強化等級#b4#k\r\n#e[特別優惠]#n 現金道具 移動#k#n : 可向帳號內其他角色 現金道具 移動");
                        npc.id(9401982).next().say("#r主要活動#k強化效果可透過#b活動票券UI提示#k確認，#r慶典設計者技能強化優惠#k如下。\r\n\r\n#e[按設計者分類的技能]#n\r\n見習者設計者 #b1等級#k，進階者設計者 #b2等級#k\r\n老手設計師> #b3等級#k，大師設計者 #b4等級#k\r\n\r\n#e[強化效果]#n\r\n#e全屬性：#n #b10/20/30/40#k 增加\r\n#e攻擊力/魔力：#n #b5/10/15/25#k 增加\r\n#e無視怪物防禦率：#n #b6/12/18/30%#k 增加\r\n#e爆擊機率：#n #b5/10/15/20%#k 增加\r\n#e爆擊傷害：#n #b5/10/15/20%#k 增加\r\n\r\n#r※上述項目的增加量分別按設計者技能1、2、3、4等級順序排列。#k");
                        break;
                case 3:
                        let tFlag = true;
                        while (tFlag) {
                                let sel = npc.id(9401982).askMenu("想知道主要活動嗎？該從什麼開始說明呢？\r\n#L0# #b#e<主要活動>#n是什麼？#k#l\r\n#L1# 請告訴我#b#e<成為神仙的方法>#n。#k#l\r\n#L2##b#e請告訴我<一二！蕭公的內功修煉>#n。#k#l\r\n\r\n#L100# #n我想回到主選單。#l");
                                switch (sel) {
                                        case 0:
                                                npc.id(9401981).next().say("原來你好奇主要活動啊！那我就來說明一下吧！");
                                                npc.id(9401981).next().say("<主要活動>啊。可以說是慶典的核心。共準備了2個主要活動，每個活動都可以獲得#b特別的獎勵#k和#b幻想點數#k。尤其是每次你作為設計者的能力上升時，主要活動的效果也會上升，所以認真享受慶典也是很重要的吧？");
                                                npc.id(9401981).next().say("這次的活動，聽說武陵居民為你準備了可以#b體驗神仙#k的票券！\r\n如果想獲得#r一定量的經驗值和經驗值BUFF#k，就去找#b太常#k，如果想獲得#r有助於成長的道具#k，就去找#b蕭公#k吧！");
                                                npc.id(9401981).next().say("每週開始都會提供選擇時間旅行票券的機會，所以別擔心，盡情享受吧。 呵呵呵！\r\n\r\n#r※經驗值Buff和獎勵的詳細資訊可以通過活動票券UI條醒或說明任務的主活動說明選單進行確認。#k\r\n\r\n#b活動期間：2024年 11月 26日 23點 59分為止！");
                                                break;
                                        case 1:
                                                npc.id(9401984).next().say("想知道成為神仙的捷徑嗎？告訴你並不難。");
                                                npc.id(9401984).next().say("#b[成為神仙的方法]#k說明\r\n\r\n 1) 消滅#r等級範圍怪物#k，讓太常把#b熊貓水瓶量條#k填滿。\r\n 2) 當熊貓水瓶裝滿的時候，神仙的名藥就完成了！ #b名藥的效果#k技能發動！\r\n 3) 設計者等級越高，名藥的效果越強！\r\n 4) 提供經驗值Buff每日僅發動#e#r共20次#n#k\r\n 5) 經驗值Buff的持續時間每次 #e#r 60秒#k#n！\r\n 6) 每消滅1隻怪物即可獲得#b30 幻想點數#k\r\n\r\n#b#e※ 能量條發動次數與世界內所有角色共享。#n#k.");
                                                npc.id(9401984).next().say("#b[名藥的效果] 各等級經驗值Buff倍率說明#k\r\n\r\n1. #e<見習者慶典設計者>#n : #e#r350%#k#n\r\n2. #e<進階者慶典設計者>#n : #e#r400%#k#n\r\n3. #e<老手慶典設計者>#n : #e#r450%#k#n\r\n4. #e<大師慶典設計者>#n : #e#r550%#k#n");
                                                npc.id(9401984).next().say("怎麼樣？武陵最好的藥材商我，太常做的神仙名藥#b只喝一口#k的話，你也能盡情享受成為神仙的感覺吧！\r\n想當神仙，隨時來找我。");
                                                npc.id(9401984).next().say("\r\n\r\n#b活動期間：2024年 11月 26日 23點 59分為止！");
                                                break;
                                        case 2:
                                                npc.id(9401985).next().say("好奇#b<一二！蕭公的內功修煉>#k嗎？如果是的話，我親自告訴你吧！");
                                                npc.id(9401985).next().say("#b[一二！蕭公的內功修煉]#k說明\r\n\r\n 1) 消滅#b等級範圍怪物#k，填滿內功修煉量條\r\n 2) 每當修煉條滿格，地圖上就會出現#r強大的敵人#k！\r\n 3) 擊敗堅強的敵人時，獲得有助於成長的道具\r\n 4) 設計者等級越高，可獲得更多道具！\r\n 5) 內功修煉量條，只會發動每日#e#r總5次#n#k\r\n 6) 同時，每次消滅怪物的時候獲得#b30 幻想點數#k\r\n\r\n#b#e※ 能量條發動次數與世界內所有角色共享。#n#k.\r\n\r\n#fs15##r#e※ 強大的敵人會在換地圖或登出時消失。此時，發動次數還是會正常減少，請注意。");
                                                npc.id(9401985).next().say("#b[一二！蕭公的內功修煉]#k獎勵公告\r\n\r\n#e - 未進行6轉的角色時#n\r\n#e#r1. <見習者慶典設計者>#n#k\r\n#i2436324:# #t2436324:##b#e 20#k#n個\r\n#i2630402:# #t2630402:##b#e 0#k#n個\r\n\r\n#e#r2. <進階者慶典設計者>#n#k\r\n#i2436324:# #t2436324:##b#e 25#k#n個\r\n#i2630402:# #t2630402:##b#e 0#k#n個\r\n\r\n#e#r3. <老手慶典設計者>#n#k\r\n#i2436324:# #t2436324:##b#e 30#k#n個\r\n#i2630402:# #t2630402:##b#e 5#k#n個\r\n\r\n#e#r4. <大師慶典設計者>#n#k\r\n#i2436324:# #t2436324:##b#e 35#k#n個\r\n#i2630402:# #t2630402:##b#e 5#k#n個");
                                                npc.id(9401985).next().say("#b[一二！蕭公的內功修煉]#k獎勵公告\r\n\r\n#e - 進行6轉的角色時#n\r\n#e#r1. <見習者慶典設計者>#n#k\r\n#i4009548:# #t4009548:##b#e 10#k#n個\r\n#i2636420:# #t2636420:##b#e 300#k#n個\r\n\r\n#e#r2. <進階者慶典設計者>#n#k\r\n#i4009548:# #t4009548:##b#e 15#k#n個\r\n#i2636420:# #t2636420:##b#e 400#k#n個\r\n\r\n#e#r3. <老手慶典設計者>#n#k\r\n#i4009548:# #t4009548:##b#e 20#k#n個\r\n#i2636420:# #t2636420:##b#e 500#k#n個\r\n\r\n#e#r4. <大師慶典設計者>#n#k\r\n#i4009548:# #t4009548:##b#e 25#k#n個\r\n#i2636420:# #t2636420:##b#e 600#k#n個");
                                                npc.id(9401985).next().say("怎麼樣，想要更加強大的渴望，只要和這位蕭公一起練就沒什麼困難的了。 和我在一起的充實內涵修煉，只會在武陵桃園夜幕降臨的慶典期間進行。\r\n不要傻傻地不管這次機會，希望你不要錯過機會呢。");
                                                npc.id(9401985).next().say("\r\n\r\n#b活動期間：2024年 11月 26日 23點 59分為止！");
                                                break;
                                        case 100:
                                                tFlag = false;
                                                break;
                                }
                        }
                        break;
                case 4:
                        let cFlag = true;
                        while (cFlag) {
                                let cSel = npc.id(9401982).askMenu("看來您對支線活動很好奇啊！想了解什麼活動？\r\n#L0# #b#e<支線活動>#n是什麼？#k#l\r\n#L1# 請告訴我#b#e<載滿願望的天燈>#n。#k#l\r\n#L2# 請告訴我#b#e<煮出神祕靈藥>#n。#k#l\r\n#L3# 請告訴我#b#e<道公的道術傳授>#n。#k#l\r\n#L4# 請告訴我#b#e<星夜武陵道場開幕！>#n。#k#l\r\n#L5# 請告訴我#b#e<歡樂的靈藥幻境海上派對>#n。#k#l\r\n#L6# 請告訴我#b#e<盧公的動態視力修煉場>#n。#k#l\r\n#L7# 請告訴我#b#e<神祕運勢抽籤>#n。#k#l\r\n\r\n#L100# #n我想回到主選單。#l");
                                switch (cSel) {
                                        case 0:
                                                npc.id(9401982).next().say("所謂支線活動，是為了讓大家更享受慶典，由武陵居民們準備的各種有趣的活動！");
                                                npc.id(9401982).next().say("每經過活動週次，居民準備的支線活動就會一個一個開放。當然，也會有#b#h0#的等級上升時才能進行的活動，所以要努力收集幻想硬幣~\r\n\r\n#b活動期間：2024年 11月 26日 23點 59分為止！");
                                                break;
                                        case 1:
                                                npc.id(9401986).next().say("你好？看來你很好奇天燈慶典！我來告訴你吧。");
                                                npc.id(9401986).next().say("首先天燈總共有三種，\r\n\r\n如果放出了#fc0xFFff6bb3#<仙桃天燈>#k的話，可以獲得#fc0xFFff6bb3##i2024239:# #t2024239:##k，有經驗值增加和一般怪物傷害增加的效果，如果放出了#fc0xFFaf38ff#<熊熊天燈>#k的話，可以獲得#fc0xFFaf38ff##i2024240:# #t2024240:##k，它提供了增加攻擊力/魔力、BOSS怪物傷害、無視怪物防禦率的效果。\r\n\r\n#r※放出仙桃天燈、熊熊天燈每個伺服器每天只能參加一次。#k");
                                                npc.id(9401986).next().say("另外，贊助#r100#k楓葉點數後，可放出#fc0xFFf0a400##e<黃色天燈>#n#k，在這之後，將會獲得至今為止缺少的幻想硬幣(每一次可獲得300個幻想硬幣)，#r每個世界每天可參與3次。#k");
                                                npc.id(9401986).next().say("最後，所有天燈都能寫上願望。這個願望和遊戲無關，請自由地寫下願望吧～說不定願望會實現！");
                                                npc.id(9401986).next().say("\r\n\r\n#b活動期間：2024年 10月 30日 09點 00分~2024年 11月 26日 23點 59分 為止！");
                                                break;
                                        case 2:
                                                npc.id(9401988).next().say("什麼啊… 好奇#b<煮出神祕靈藥>#k嗎？\r\n嗯。我來告訴你吧。");
                                                npc.id(9401988).next().say("狩獵時獲得#b#i2638099:# #t2638099:##k和#b#i2638100:# #t2638100:##k後雙擊，\r\n就能獲得各種藥材。");
                                                npc.id(9401988).next().say("一般藥材在組合台的每個欄位可放入#b5#k個，高級藥材在組合台的每個欄位可放入#b1#k個，而且一種藥材最多只能放到#r2#k個欄位中。");
                                                npc.id(9401988).next().say("放入這些藥材熬煮，\r\n就能製作#fc0xFF662500##i2024236:# #t2024236:##k加持技能，\r\n有效期限為#r7天#k。");
                                                npc.id(9401988).next().say("在有效期限未到期的狀態下，可以重新製作新的靈藥，此時可以比較目前套用中的靈藥和新製作的靈藥後進行調整。\r\n靈藥從製作出來的瞬間開始，有效期限只有7天，請注意。");
                                                npc.id(9401988).next().say("那麼，祝你一天健康。");
                                                npc.id(9401988).next().say("\r\n\r\n#b活動期間：2024年 10月 30日 09點 00分~2024年 11月 26日 23點 59分 為止！");
                                                break;
                                        case 3:
                                                npc.id(9401989).next().say("你好像對祕密道術很好奇。\r\n我來親自告訴你，關於武陵#r傳說#k般的#b祕密道術#k！");
                                                npc.id(9401989).next().say("#b#e<道公的祕密道術>#n#k是以帳號內相同伺服器的#b一對角色#k為對象，分別指定為#r修煉角色#k與#r培訓角色#k，並進行角色養成的秘笈。");
                                                npc.id(9401989).next().say("簡單來說，\r\n這個道術是當修練角色消滅#b等級範圍怪物#k時，#b獲得的經驗值一定比例會自動分配給集中目標角色#k的道術。");
                                                npc.id(9401989).next().say("換句話說，#r修煉角色#k專心修煉的話，#b培訓角色會獲得#r經驗值並可以升級的道術#k。");
                                                npc.id(9401989).next().say("不覺得很驚人嗎！？\r\n修煉的核心是#b忍耐#k和#b集中#k，請好好記住。");
                                                npc.id(9401989).next().say("對了，這不是你隨時都能使用的道術。是在#b武陵桃園夜晚降臨的期間#k，道公稍微施術後，才可以修煉的道術喔。");
                                                npc.id(9401989).next().say("雖然時間會感覺很短…但這是相對的吧？\r\n修煉#r祕密道術#k的話，會感覺到#b兩個角色之間的界限被突破，彼此共享經驗值的瞬間#k。");
                                                npc.id(9401989).next().say("如果能持續地#b忍耐#k和#b集中#k，就能更有效地#r成長#k你的#b培訓角色#k。如果想知道詳細內容，就來找我吧。嘿嘿。");
                                                npc.id(9401989).next().say("\r\n\r\n#b活動期間：2024年 10月 30日 09點 00分~2024年 11月 26日 23點 59分 為止！");
                                                break;
                                        case 4:
                                                npc.id(9402005).next().say("很高興見到你！\r\n#b<星夜武陵道場>#k是為像你這樣對修煉感興趣的人，在太陽升起之前的特別道場。");
                                                npc.id(9402005).next().say("#b<星夜武陵道場>#k不會因為是特別的道場，就變得很難理解。別擔心，跟出現在武陵的武陵道場一樣，只要擊敗#b層層出現的對手#k就可以了。");
                                                npc.id(9402005).next().say("限制時間為2分鐘。\r\n和對練對象對練後獲勝的話，每#r10層#k往上一層。\r\n獲得的分數最多累積到#r1000分#k，根據獲得的分數可獲得最多#b幻想硬幣 1000個#k和#r相當的經驗值#k。\r\n\r\n對了，如果你的實力很不錯，在限制時間結束前獲得1000分的話，挑戰將自動結束，請參考。");
                                                npc.id(9402005).next().say("根據你的修煉狀態，有可能會遇到#r100樓的我#k，不要偷懶，努力修煉吧。");
                                                npc.id(9402005).next().say("但是，隨著高度上升，出現的對練對象的#r體力#k和#b防禦力#k也會上升，所以要見到武公並不容易！");
                                                npc.id(9402005).next().say("還有，不要偷懶，如果在本週內更新#b<星夜武陵道場>#k的#r最高分數#k，就會根據差異額外發送#b幻想硬幣#k和經驗值！\r\n舉例來說，如果最初挑戰獲得#e100分#n，然後通過再次挑戰獲得#e200分#n，就會根據更新的分數額外發送#b幻想硬幣#k和經驗值。");
                                                npc.id(9402005).next().say("啊！還有經驗值獎勵，每週只能用一個角色領取。\r\n另外，武陵道場紀錄會在#r每週三晚上00點重置#k，請參考。");
                                                npc.id(9402005).next().say("\r\n#e[獲得經驗值]#n\r\n -每1分獲得#e#r1,055,602,020#k#n經驗值\r\n\r\n#e[幻想硬幣發送]#n\r\n與每日獲得量無關獲得\r\n\r\n -參與時基本#b100硬幣#k\r\n - 完成關卡1時#b150硬幣#k\r\n - 完成關卡2時#b200硬幣#k\r\n - 完成關卡3時#b300硬幣#k\r\n - 完成關卡4時#b400硬幣#k\r\n - 完成關卡5時#b500硬幣#k\r\n - 完成關卡6時#b600硬幣#k\r\n - 完成關卡7時#b700硬幣#k\r\n - 完成關卡8時#b800硬幣#k\r\n - 完成關卡9時#b900硬幣#k\r\n - 完成關卡10時#b1000硬幣#k");
                                                npc.id(9402005).next().say("對了，如果你挑戰#b<星夜武陵道場>#k，並且擊敗我，我會認可你，送上你特別的禮物#b#i2638385# #t2638385##k。\r\n\r\n#r(成功突破最終關卡獲得最大分數時，可獲得。)#k");
                                                npc.id(9402005).next().say("說明到此為止，應該也足夠了。\r\n如果還有其他疑問就來找我吧。");
                                                npc.id(9402005).next().say("\r\n\r\n#b活動期間：2024年 11月 6日 09點 00分~2024年 11月 26日 23點 59分 為止！");
                                                break;
                                        case 5:
                                                npc.id(9401992).next().say("為了在靈藥幻境一起慶祝慶典，我準備了#b海上派對#k！\r\n現在在遊船上的#b歡樂的靈藥幻境海上派對#k正在進行！\r\n只要參加#b<歡樂的靈藥幻境海上派對>#k，就能獲得對#b設計慶典#k很有用的#b幻想硬幣#k和#r經驗值#k！！");
                                                npc.id(9401992).next().say("在#b<靈藥幻境海上派對>#k裏，#r每10秒可以獲得15個幻想硬幣#k。另外，透過#i2024246:# #t2024246:#技能可以變身成深山人蔘，在你變身成深山人蔘的期間，#r每5秒可獲得經驗值#k！");
                                                npc.id(9401992).next().say("\r\n\r\n#b活動期間：2024年 11月 6日 09點 00分~2024年 11月 26日 23點 59分 為止！");
                                                break;
                                        case 6:
                                                npc.id(9401993).next().say("我來告訴你#b動態視力修煉場#k的修煉方法。\r\n方法很簡單。只要從正面出現的目標中找到#r蟠猴#k，然後瞄準#b仙桃#k就可以了。\r\n我藏了很多#b和蟠猴類似的其他目標#k，你要好好觀察並瞄準！");
                                                npc.id(9401993).next().say("還有，\r\n努力修煉成長後，一定會遇到#b武陵桃園#k的#r蟠猴#k們，把仙桃偷走了！一定要好好教訓他們！");
                                                npc.id(9401993).next().say("另外，如果參加的話，作為#r基本獎勵#k會給你#i2637776:##t2637776:#。\r\n\r\n另外，根據你的#r實力#k作為#b追加獎勵#k會準備#i2638170:##t2638170:#，所以努力修煉吧！");
                                                npc.id(9401993).next().say("如果成為盧公的#r弟子#k鍛鍊動態視力！\r\n你的角色將能建立#r變強的基礎#k，請認真修煉。");
                                                npc.id(9401993).next().say("對了，\r\n動態視力修煉場只有收集完#r每日幻想硬幣#k的修煉生才能使用，而且#b一天只能修煉一次#k，請參考。");
                                                npc.id(9401993).next().say("\r\n\r\n#b活動期間：2024年 11月 13日 09點 00分~2024年 11月 26日 23點 59分 為止！");
                                                break;
                                        case 7:
                                                npc.id(9401983).next().say("這是為了認真享受慶典的人準備的#b特別禮物！#k 究竟我的運勢如何，幸運會持續到什麼程度～\r\n向尤莉亞試試#r運氣的機會#k吧？\r\n不是給任何人，而是#b星夜馬戲團慶典期間#k才特別免費喔。");
                                                npc.id(9401983).next().say("參加活動的方法很簡單！\r\n\r\n#e#b[神祕運勢抽籤]#k參加方法#n\r\n1.按下#r抽獎#k鍵，將棒子攪拌。\r\n2.從#r五支棒子#k中選擇最吸引人的一支。#k\r\n#r※ 每伺服器一天只能參加一次抽籤！#k\r\n\r\n怎麼樣？很簡單吧？");
                                                npc.id(9401983).next().say("還準備了特別的獎勵！\r\n根據你的運勢，可根據#r隨機機率#k領取。很有趣吧？\r\n\r\n#b<神祕運勢抽籤> 活動獎勵#k\r\n#fc0xFFcb32cd##e<大吉>#n\r\n#i2644302:# #t2644302:# 1個 (0.002%)\r\n#i2644075:# #t2644075:# 1個 (0.004%)\r\n#i2644103:# #t2644103:# 1個 (0.494%)\r\n#i2636222:# #t2636222:# 10個 (1.5%)\r\n#i2048766:# #t2048766:# 30個 (3%)\r\n#i2711021:# #t2711021:# 30個 (5%)\r\n#i2634437:# #t2634437:# 100個 (5%)\r\n\r\n#fc0xFF2d5be6##e<中吉>#n\r\n#i2048766:# #t2048766:# 5個 (3%)\r\n#i2711021:# #t2711021:# 20個 (3%)\r\n#i2049793:# #t2049793:# 1個 (3%)\r\n#i2711023:# #t2711023:# 30個 (3%)\r\n#i2711023:# #t2711023:# 20個 (3%)\r\n#i2632290:# #t2632290:# 3個 (3.5%)\r\n#i2632290:# #t2632290:# 2個 (4%)\r\n#i2048759:# #t2048759:# 30個 (4%)\r\n#i2048758:# #t2048758:# 10個 (4%)\r\n#i2730004:# #t2730004:# 30個 (5%)\r\n#i2634437:# #t2634437:# 50個 (5%)\r\n#i2439869:# #t2439869:# 20個 (5.5%)\r\n\r\n#fc0xFF00b83d##e<小吉>#n\r\n#i2711023:# #t2711023:# 15個 (3.5%)\r\n#i2048759:# #t2048759:# 10個 (4.5%)\r\n#i2730004:# #t2730004:# 10個 (5%)\r\n#i2439869:# #t2439869:# 10個 (7%)\r\n#i2636880:# #t2636880:# 10個 (9%)\r\n#i2634437:# #t2634437:# 20個 (10%)");
                                                npc.id(9401983).next().say("盡情享受慶典，無聊的話就來一趟吧！說不定會發生好事？");
                                                npc.id(9401983).next().say("\r\n\r\n#b活動期間：2024年 11月 20日 09點 00分~2024年 11月 26日 23點 59分 為止！");
                                                break;
                                        case 100:
                                                cFlag = false;
                                                break;
                                }
                        }
                        break;
                case 100:
                        flag = false;
                        npc.id(9401982).next().say("如果有任何疑問，請隨時來找我，呵呵。\r\n也可去找負責各攤位的武陵居民。");
                        npc.id(9401982).say("\r\n\r\n#b活動期間：2024年 11月 26日 23點 59分為止！");
                        break;
        }
}