/*
 * Copyright (c) 2025. Lorem ipsum dolor sit amet, consectetur adipiscing elit. 
 */

var head = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n";
var icon = "#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0#";

var text;
var inventoryType = 1;
var deleteSlot;
var deleteQuantity;
var typed = 0;
var beDeletedArr = new Array();
var listq = Array(
    2, 5, 20
);
var itemq = 0;


const list = [
    [1152174, 30],	//埃苏莱布斯骑士护肩
    [1152176, 30],	//埃苏莱布斯法师护肩
    [1152177, 30],	//埃苏莱布斯弓箭手护肩
    [1152178, 30],	//埃苏莱布斯飞侠护肩
    [1152179, 30],	//埃苏莱布斯海盗护肩
    [1004422, 30],	//埃苏莱布斯骑士头盔
    [1004423, 30],	//埃苏莱布斯法师帽
    [1004424, 30],	//埃苏莱布斯弓箭手帽
    [1004425, 30],	//埃苏莱布斯飞侠帽
    [1004426, 30],	//埃苏莱布斯海盗帽
    [1102775, 30],	//埃苏莱布斯骑士披风
    [1102794, 30],	//埃苏莱布斯魔法师披风
    [1102795, 30],	//埃苏莱布斯弓箭手披风
    [1102796, 30],	//埃苏莱布斯飞侠披风
    [1102797, 30],	//埃苏莱布斯海盗披风
    [1082636, 30],	//埃苏莱布斯骑士手套
    [1082637, 30],	//埃苏莱布斯法师手套
    [1082638, 30],	//埃苏莱布斯弓箭手手套
    [1082639, 30],	//埃苏莱布斯飞侠手套
    [1082640, 30],	//埃苏莱布斯海盗手套
    [1052882, 30],	//埃苏莱布斯骑士套装
    [1052887, 30],	//埃苏莱布斯魔法师套装
    [1052888, 30],	//埃苏莱布斯弓箭手套装
    [1052889, 30],	//埃苏莱布斯飞侠套装
    [1052890, 30],	//埃苏莱布斯海盗套装
    [1073030, 30],	//埃苏莱布斯骑士鞋
    [1073032, 30],	//埃苏莱布斯法师鞋
    [1073033, 30],	//埃苏莱布斯弓箭手鞋
    [1073034, 30],	//埃苏莱布斯飞侠鞋
    [1073035, 30],	//埃苏莱布斯海盗鞋
    [1213017, 50],	//AS调谐器
    [1292017, 50],	//埃苏莱布斯怪扇
    [1592019, 50],	//埃苏莱布斯远古弓
    [1412177, 50],	//埃苏莱布斯大斧
    [1312199, 50],	//埃苏莱布斯战斧
    [1302333, 50],	//埃苏莱布斯军刀
    [1542108, 50],	//埃苏莱布斯武士刀
    [1442268, 50],	//埃苏莱布斯巨灵开山斧
    [1322250, 50],	//埃苏莱布斯战锤
    [1422184, 50],	//埃苏莱布斯大锤
    [1432214, 50],	//埃苏莱布斯穿透矛
    [1232109, 50],	//埃苏莱布斯亡命剑
    [1402251, 50],	//埃苏莱布斯宽大刀
    [1582017, 50],	//埃苏莱布斯雷神
    [1262017, 50],	//埃苏莱布斯ESP限制器
    [1212115, 50],	//埃苏莱布斯双头杖
    [1552110, 50],	//埃苏莱布斯扇子
    [1252093, 50],	//埃苏莱布斯魔法棒
    [1382259, 50],	//埃苏莱布斯长杖
    [1372222, 50],	//埃苏莱布斯短杖
    [1522138, 50],	//埃苏莱布斯双弩枪
    [1214017, 50],	//埃苏莱布斯龙息臂箭
    [1452252, 50],	//埃苏莱布斯弓
    [1462239, 50],	//埃苏莱布斯弩
    [1242116, 50],	//埃苏莱布斯能量剑
    [1242120, 50],	//埃苏莱布斯能量剑
    [1362135, 50],	//埃苏莱布斯折叠手杖
    [1472261, 50],	//埃苏莱布斯复仇斗拳
    [1332274, 50],	//埃苏莱布斯屠龙斩
    [1342101, 50],	//埃苏莱布斯之刃
    [1482216, 50],	//埃苏莱布斯拳甲
    [1492231, 50],	//埃苏莱布斯枪
    [1222114, 50],	//埃苏莱布斯灵魂手铳
    [1532144, 50],	//埃苏莱布斯大炮
    [1272016, 50],	//埃苏莱布斯锁链
    [1282016, 50],	//埃苏莱布斯魔力手套
    [1213017, 50],	//埃苏莱布斯调谐器
    [1404017, 50],	//埃苏莱布斯环
    [4310217, 50],	//埃苏莱布斯调谐器
    [1004812, 4500], //神秘之影海盗帽
    [1004811, 4500], //神秘之影飞侠帽
    [1004810, 4500], //神秘之影弓箭手帽
    [1004809, 4500], //神秘之影法师帽
    [1004808, 4500], //神秘之影战士帽
    [1053067, 4500], //神秘之影海盗套装
    [1053066, 4500], //神秘之影飞侠套装
    [1053065, 4500], //神秘之影弓箭手套装
    [1053064, 4500], //神秘之影法师套装
    [1053063, 4500], //神秘之影战士套装
    [1152200, 4500], //神秘之影海盗护肩
    [1152199, 4500], //神秘之影飞侠护肩
    [1152198, 4500], //神秘之影弓箭手护肩
    [1152197, 4500], //神秘之影法师护肩
    [1152196, 4500], //神秘之影战士护肩
    [1082699, 4500], //神秘之影海盗手套
    [1082698, 4500], //神秘之影飞侠手套
    [1082697, 4500], //神秘之影弓箭手手套
    [1082696, 4500], //神秘之影法师手套
    [1082695, 4500], //神秘之影战士手套
    [1102944, 4500], //神秘之影海盗披风
    [1102943, 4500], //神秘之影飞侠披风
    [1102942, 4500], //神秘之影弓箭手披风
    [1102941, 4500], //神秘之影法师披风
    [1102940, 4500], //神秘之影战士披风
    [1073162, 4500], //神秘之影海盗鞋
    [1073161, 4500], //神秘之影飞侠鞋
    [1073160, 4500], //神秘之影弓箭手鞋
    [1073159, 4500], //神秘之影法师鞋
    [1073158, 4500], //神秘之影战士鞋
    [1214018, 9000],
    [1213018, 9000],
    [1292018, 9000],
    [1592020, 9000],  //- 神秘之影双头杖 等级要求：200
    [1212120, 9000],  //- 神秘之影双头杖 等级要求：200
    [1222113, 9000],  //- 神秘之影灵魂手铳 等级要求：200
    [1232113, 9000],  //- 神秘之影亡命剑 等级要求：200
    [1242121, 9000],  //- 神秘之影能量剑 等级要求：200
    [1242122, 9000],  //- 神秘之影能量剑 等级要求：200
    [1252098, 9000],  //- 神秘之影魔法槌 等级要求：200
    [1262039, 9000],  //- 神秘之影ESP限制器 等级要求：20
    [1302343, 9000],  //- 神秘之影单手剑 等级要求：200
    [1312203, 9000],  //- 神秘之影斧 等级要求：200
    [1322255, 9000],  //- 神秘之影锤 等级要求：200
    [1332279, 9000],  //- 神秘之影匕首 等级要求：200
    [1342104, 9000],  //- 神秘之影刃 等级要求：200
    [1362140, 9000],  //- 神秘之影手杖 等级要求：200
    [1372228, 9000],  //- 神秘之影短杖 等级要求：200
    [1382265, 9000],  //- 神秘之影长杖 等级要求：200
    [1402259, 9000],  //- 神秘之影双手剑 等级要求：200
    [1412181, 9000],  //- 神秘之影双手战斧 等级要求：200
    [1422189, 9000],  //- 神秘之影双手锤 等级要求：200
    [1432218, 9000],  //- 神秘之影长枪 等级要求：200
    [1442274, 9000],  //- 神秘之影矛 等级要求：200
    [1452257, 9000],  //- 神秘之影弓 等级要求：200
    [1462243, 9000],  //- 神秘之影弩 等级要求：200
    [1472265, 9000],  //- 神秘之影拳套 等级要求：200
    [1482221, 9000],  //- 神秘之影指节 等级要求：200
    [1492235, 9000],  //- 神秘之影短枪 等级要求：200
    [1522143, 9000],  //- 神秘之影双弩枪 等级要求：200
    [1532150, 9000],  //- 神秘之影攻城炮 等级要求：200
    [1542117, 9000],  //- 神秘之影武士刀 等级要求：200
    [1552119, 9000],  //-  神秘之影折扇  等级要求：200
    [1582023, 9000],  //- 神秘之影机甲枪 等级要求：200
    [1272017, 9000],  //- 神秘之影锁链 等级要求：200
    [1282017, 9000],  //- 神秘之影魔力手套 等级要求：200
    [1404018, 9000]  //- 神秘之影环刃
];
const itemList = [
    1152174,	//埃苏莱布斯骑士护肩
    1152176,	//埃苏莱布斯法师护肩
    1152177,	//埃苏莱布斯弓箭手护肩
    1152178,	//埃苏莱布斯飞侠护肩
    1152179,	//埃苏莱布斯海盗护肩
    1004422,	//埃苏莱布斯骑士头盔
    1004423,	//埃苏莱布斯法师帽
    1004424,	//埃苏莱布斯弓箭手帽
    1004425,	//埃苏莱布斯飞侠帽
    1004426,	//埃苏莱布斯海盗帽
    1102775,	//埃苏莱布斯骑士披风
    1102794,	//埃苏莱布斯魔法师披风
    1102795,	//埃苏莱布斯弓箭手披风
    1102796,	//埃苏莱布斯飞侠披风
    1102797,	//埃苏莱布斯海盗披风
    1082636,	//埃苏莱布斯骑士手套
    1082637,	//埃苏莱布斯法师手套
    1082638,	//埃苏莱布斯弓箭手手套
    1082639,	//埃苏莱布斯飞侠手套
    1082640,	//埃苏莱布斯海盗手套
    1052882,	//埃苏莱布斯骑士套装
    1052887,	//埃苏莱布斯魔法师套装
    1052888,	//埃苏莱布斯弓箭手套装
    1052889,	//埃苏莱布斯飞侠套装
    1052890,	//埃苏莱布斯海盗套装
    1073030,	//埃苏莱布斯骑士鞋
    1073032,	//埃苏莱布斯法师鞋
    1073033,	//埃苏莱布斯弓箭手鞋
    1073034,	//埃苏莱布斯飞侠鞋
    1073035,	//埃苏莱布斯海盗鞋
    1213017, 	//AS调谐器
    1292017,	//埃苏莱布斯怪扇
    1592019,	//埃苏莱布斯远古弓
    1412177,	//埃苏莱布斯大斧
    1312199,	//埃苏莱布斯战斧
    1302333,	//埃苏莱布斯军刀
    1542108,	//埃苏莱布斯武士刀
    1442268,	//埃苏莱布斯巨灵开山斧
    1322250,	//埃苏莱布斯战锤
    1422184,	//埃苏莱布斯大锤
    1432214,	//埃苏莱布斯穿透矛
    1232109,	//埃苏莱布斯亡命剑
    1402251,	//埃苏莱布斯宽大刀
    1582017,	//埃苏莱布斯雷神
    1262017,	//埃苏莱布斯ESP限制器
    1212115,	//埃苏莱布斯双头杖
    1552110,	//埃苏莱布斯扇子
    1252093,	//埃苏莱布斯魔法棒
    1382259,	//埃苏莱布斯长杖
    1372222,	//埃苏莱布斯短杖
    1522138,	//埃苏莱布斯双弩枪
    1214017,	//埃苏莱布斯龙息臂箭
    1452252,	//埃苏莱布斯弓
    1462239,	//埃苏莱布斯弩
    1242116,	//埃苏莱布斯能量剑
    1242120,	//埃苏莱布斯能量剑
    1362135,	//埃苏莱布斯折叠手杖
    1472261,	//埃苏莱布斯复仇斗拳
    1332274,	//埃苏莱布斯屠龙斩
    1342101,	//埃苏莱布斯之刃
    1482216,	//埃苏莱布斯拳甲
    1492231,	//埃苏莱布斯枪
    1222114,	//埃苏莱布斯灵魂手铳
    1532144,	//埃苏莱布斯大炮
    1272016,	//埃苏莱布斯锁链
    1282016,	//埃苏莱布斯魔力手套
    1213017,	// 埃苏莱布斯调节器
    1404017, 	//埃苏莱布斯环

    4310217, //神秘精華
    1004812, //神秘之影飞侠帽
    1004811, //神秘之影弓箭手帽
    1004810, //神秘之影法师帽
    1004809, //神秘之影战士帽
    1004808, //神秘之影海盗套装
    1053067, //神秘之影飞侠套装
    1053066, //神秘之影弓箭手套装
    1053065, //神秘之影法师套装
    1053064, //神秘之影战士套装
    1053063, //神秘之影海盗护肩
    1152200, //神秘之影飞侠护肩
    1152199, //神秘之影弓箭手护肩
    1152198, //神秘之影法师护肩
    1152197, //神秘之影战士护肩
    1152196, //神秘之影海盗手套
    1082699, //神秘之影飞侠手套
    1082698, //神秘之影弓箭手手套
    1082697, //神秘之影法师手套
    1082696, //神秘之影战士手套
    1082695, //神秘之影海盗披风
    1102944, //神秘之影飞侠披风
    1102943, //神秘之影弓箭手披风
    1102942, //神秘之影法师披风
    1102941, //神秘之影战士披风
    1102940, //神秘之影海盗鞋
    1073162, //神秘之影飞侠鞋
    1073161, //神秘之影弓箭手鞋
    1073160, //神秘之影法师鞋
    1073159, //神秘之影战士鞋
    1073158,
    1214018,  //- 神秘之影双头杖 等级要求：200
    1213018,
    1292018,
    1592020,  //- 神秘之影双头杖 等级要求：200
    1212120,  //- 神秘之影灵魂手铳 等级要求：200
    1222113,  //- 神秘之影亡命剑 等级要求：200
    1232113,  //- 神秘之影能量剑 等级要求：200
    1242121,  //- 神秘之影能量剑 等级要求：200
    1242122,  //- 神秘之影魔法槌 等级要求：200
    1252098,  //- 神秘之影ESP限制器 等级要求：20
    1262039,  //- 神秘之影单手剑 等级要求：200
    1302343,  //- 神秘之影斧 等级要求：200
    1312203,  //- 神秘之影锤 等级要求：200
    1322255,  //- 神秘之影匕首 等级要求：200
    1332279,  //- 神秘之影刃 等级要求：200
    1342104,  //- 神秘之影手杖 等级要求：200
    1362140,  //- 神秘之影短杖 等级要求：200
    1372228,  //- 神秘之影长杖 等级要求：200
    1382265,  //- 神秘之影双手剑 等级要求：200
    1402259,  //- 神秘之影双手战斧 等级要求：200
    1412181,  //- 神秘之影双手锤 等级要求：200
    1422189,  //- 神秘之影长枪 等级要求：200
    1432218,  //- 神秘之影矛 等级要求：200
    1442274,  //- 神秘之影弓 等级要求：200
    1452257,  //- 神秘之影弩 等级要求：200
    1462243,  //- 神秘之影拳套 等级要求：200
    1472265,  //- 神秘之影指节 等级要求：200
    1482221,  //- 神秘之影短枪 等级要求：200
    1492235,  //- 神秘之影双弩枪 等级要求：200
    1522143,  //- 神秘之影攻城炮 等级要求：200
    1532150,  //- 神秘之影武士刀 等级要求：200
    1542117,  //-  神秘之影折扇  等级要求：200
    1552119,  //- 神秘之影机甲枪 等级要求：200
    1582023,  //- 神秘之影锁链 等级要求：200
    1272017,  //- 神秘之影魔力手套 等级要求：200
    1282017,  //- 神秘之影魔力手套 等级要求：200
    1404018,  //- 神秘之影魔力手套 等级要求：200
];

function start() {
    const toDoList = [];
    let prize = 0;
    let price = 0;
    for (let i = 1; i <= 64; i++) {
        let item = stage.getItemBySlot(1, i);
        if (item == null || item.getAttribute() == 41) {
            continue;
        } else {
            let index = itemList.indexOf(item.getItemId());
            if (index != -1) {
                toDoList.push([list[index][0], list[index][1], i]);
            }
        }
    }

    // 询问是否分解，分解后不可恢复
    let text = "#e#r#h0##k#n\r\n#k您好，歡迎來到綁定楓幣回收中心\r\n#r#e分解后不可恢复!\r\n";
    text += `本次可分解物品如下如下\r\n`;
    if (toDoList.length == 0) {
        text += `當前無可分解裝備#d#n\r\n`;
    } else {
        for (let i in toDoList) {
            text += `#L${i}##v${toDoList[i][0]}:i# 位置: ${toDoList[i][2]} #v4001714:i# x ${toDoList[i][1]}#l\r\n `;
        }
    }

    text += `\r\n\r\n#k#n回收價格表:\r\n`;
    for (let i in list) {
        text += "#v" + list[i][0] + ":i# #t" + list[i][0] + "# #r#e" + `[#v4001714:i# * ${list[i][1]}]` + `#n#k\r\n`;
    }
    let sel = npc.askMenu(text);
    let toSellItem = stage.getItemBySlot(1, toDoList[sel][2]);
    stage.showSystemMessage(toDoList[sel][2]);
    if (toSellItem.getItemId() != toDoList[sel][0]) {
        npc.say("請重新選擇，物品信息有誤");
        return;
    } else {
        if (stage.getFreeSlot(2) < 3) {
            npc.say("請清理背包");
        } else if (npc.askYesNo(`是否分解該物品\r\n#v${toDoList[sel][0]}:i##z${toDoList[sel][0]}:i#位置: ${toDoList[sel][2]}\r\n回收價: #v4001714:i# * ${toDoList[sel][1]}`) == 1) {
            stage.removeItemBySlot(1, toDoList[sel][2]);
            stage.gainItem(4001714, toDoList[sel][1]);
            npc.say('分解成功');
        }
    }
    start();
}


start();