const 小軍團 = 2439137;
const 大軍團 = 2439138;
const 一星卷 = 2644008;
const 黑魔法師碎片 = 2434006;
const 格蘭蒂斯碎片 = 2439139;
const 卡爾洛斯的意志 = 2634472;
const 威爾核心 = "水滴石核心寶石";
const 塞倫核心 = "水滴石核心碎片";
const 心願之火 = 4001893;
const 石板火 = 2048779;

const 埃蘇幣 = 4310156
const 埃蘇隨機 = 2437534; // TODO 要改WZ
const 埃蘇防具自選 = 2630569;
const 埃蘇武器自選 = 2630568;

const 路西德幣 = 4310218;
const 威爾幣 = 4310249;

const 神秘隨機武器 = 2633923;
const 神秘隨機防具 = 2633924;
const 神秘自選武器 = 2633914;
const 神秘自選防具 = 2633915;


const 失控機械標記 = 1012632;
const 蘊藏魔力的眼罩 = 1022278;
const 船長姿態耳環 = 1032316;
const 巨大恐懼 = 1113306;
const 夢幻腰帶 = 1132308;
const 痛苦根源 = 1122430;
const 魔導書 = 2633926;
const 米特拉的憤怒 = 2436836;
const 漆黑自選 = 2435443;
const 隊長戒指 = 1113302; // 非漆黑


const 首領怪幣 = 4009495;
const 銀河自選箱 = 2635854;
const 巫女球 = 4033159;
const vip幣 = 4310209;

module.exports = { 首領怪幣, 銀河自選箱, 巫女球, vip幣 }

