// Created by MetaMS
// ID:[951000000]
// MapName:怪物公園
// 怪物公園


while (true) {
        let selection = npc.id(9071000).askMenu("歡迎來到#r#e終極怪物公園#n#k！\r\n\r\n#L1# #b#e我想暸解<終極怪物公園>#n#k#l\r\n#L2# #b#e<入場條件>#n#k是什麼？#l\r\n#L3# #b#e<使用方法>#n#k是什麼？#l\r\n\r\n#L99# 沒有其他疑問了。#l");
        if (selection == 1) {
                npc.id(9071000).next().say("你也知道，終極怪物公園\r\n已經關閉很久了。但是在關閉的這段時間，終極怪物公園大門的另一邊變成#b可怕的地方#k了。");
                npc.id(9071000).next().say("為了重新開放終極怪物公園，我親自進去看過。\r\n公園裡自成一個#b獨立的生態系#k，而且滿是沒看過的怪物。我在調查的時候出現一個看似#r生態系之王#k的怪物。");
                npc.id(9071000).next().say("#r生態系之王#k太強悍，如果那傢伙出現，我只能先逃再說。在那之後我也嘗試調查幾次，\r\n但只要牠出現，調查就會被迫中斷。");
                npc.id(9071000).next().say("因為這區是#b#e未知區域#n#k，\r\n所以我稱未知區域的王為#r#e終極大腳怪#n#k。\r\n另外，我在調查未知區域時發現一件事。");
                npc.id(9071000).next().say("打倒未知區域怪物一定數量以上即可點燃中央的小祭壇，在4個小祭壇全部點燃的狀態下碰觸中央大祭壇，#r終極大腳怪#k就會出現。");
                npc.id(9071000).next().say("現在的終極怪物公園很危險，但值得調查。\r\n所以我才開放終極怪物公園，讓有能力打倒王的強大來客進入。");
                npc.id(9071000).next().say("當然也提供獎勵。打倒#r終極大腳怪#k時\r\n可獲得#b#e龐大經驗值獎勵#n#k和怪物公園箱子。");
        } else if (selection == 2) {
                npc.id(9071000).next().say("\r\n#b#e<終極怪物公園>#n#k只供#b260級以上#k的角色進入，#r最多可由4人#k組隊入場。\r\n獎勵與隊員數量無關，盡量合得來的隊員一起進入。\r\n如果很難找到隊員，可以利用#r#e<自動配對>#n#k系統來尋找隊員，不用擔心。");
                npc.id(9071000).next().say("\r\n對了，#b#e<終極怪物公園>#n#k#r#e每個世界一天只能完成一次#n#k，一定要記住喔。");
                npc.id(9071000).next().say("\r\n使用楓葉點數或\r\n#i4001864:# 怪物公園REBORN免費使用券\r\n追加進入終極怪物公園是#r#e不可能#n#k的。一天僅限一次！別忘囉。");
        } else if (selection == 3) {
                npc.id(9071000).next().say("\r\n#b#e<終極怪物公園>#n#k的目標是由4名隊員打倒\r\n終極怪物公園另一邊#b未知區域#k的#r王#k，\r\n通稱#r終極大腳怪#k。");
                npc.id(9071000).next().say("\r\n#b未知區域#k範圍非常廣大。\r\n以中央的祭壇為中心，共有八個區域。\r\n各區域只會出現一種怪物，每當進入未知區域時，各區域所出現的怪物種類都會改變。進入未知區域時，請先確認各區域有什麼怪物！");
                npc.id(9071000).next().say("\r\n進入#b未知區域#k時會看到地圖中央的祭壇。\r\n當#r小祭壇#k全部點燃就會啟動#r大祭壇#k，\r\n當大祭壇啟動#r終極大腳怪#k就會出現。\r\n所以第一個目標就是#r點燃小祭壇#k。");
                npc.id(9071000).next().say("\r\n我親自為你說明啟動小祭壇時該打倒的\r\n怪物種類和數量。打倒我所說的怪物即可點燃地圖中央的小祭壇。");
                npc.id(9071000).next().say("\r\n當小祭壇全部點燃時，到中央的大祭壇按下採集鍵\r\n即可啟動大祭壇。當中央的大祭壇點燃，\r\n#r終極大腳怪#k就會出現在地圖的某處，經過一段時間終極大腳怪就會逃跑，所以必須趕緊打倒。");
                npc.id(9071000).next().say("\r\n假如沒打倒#r終極大腳怪#k被牠逃掉，\r\n再次點燃祭壇即可再見到牠。另外，即使終極大腳怪逃走後下次再出現，之前對牠造成的傷害依然會維持，所以請別擔心。\r\n終極大腳怪確實很強，但當牠逃跑一定次數以上就無法再逃跑了。應該是體力都用完了吧。等終極大腳怪無法再逃跑時我會告訴你。");
                npc.id(9071000).next().say("\r\n差點忘了，#b未知區域#k中有時候會出現稀有怪物。雖然體力比其他怪物高，但打倒牠時可大幅提升啟動小祭壇所需的數值。");
        } else if (selection == 4) {
                npc.id(9071000).say("\r\n今天已經進行過終極怪物公園。\r\n明天再來吧！");
                break;
        } else if (selection == 99) {
                break;
        }
}
