/*
 * Copyright (c) 2025. Lorem ipsum dolor sit amet, consectetur adipiscing elit.
 */

let log = require('check_log');
var itemlistall = {
    '1級箱子': [
        // [1113329, 30, '持續之戒'],
        [1113098, 100, '剋制之戒'],
        [1113108, 100, '集成之戒'],
        [1113109, 100, '等級增益S'],
        [1113110, 100, '等級增益D'],
        [1113111, 100, '等級增益I'],
        [1113112, 100, '等級增益L'],
        [1113113, 100, '武器增益S'],
        [1113114, 100, '武器增益D'],
        [1113115, 100, '武器增益I'],
        [1113116, 100, '武器增益L'],
        [1113122, 100, '風險之戒'],
        [1113104, 100, '爆擊傷害戒指	'],
        [1113125, 100, '水晶HM'],
        [1113099, 100, '末日之戒'],
        [1113100, 100, '極限之戒'],
        [1113101, 100, '嗜血之戒'],
        [1113102, 100, '嗜魂之戒'],
        [1113103, 100, '持久之戒'],
        [1113105, 100, '暴擊破甲之戒'],
        [1113106, 100, '暴擊輪換之戒'],
        [1113107, 100, '穩如泰山輪換之戒'],
        [1113117, 100, '迅捷之戒'],
        [1113118, 100, '穿越之戒'],
        [1113119, 100, '護盾消長之戒'],
        [1113120, 100, '反射之戒'],
        [1113121, 100, '消解之戒'],
        [1113123, 100, '水晶H'],
        [1113124, 100, '水晶M'],
        [1113126, 100, '康復穩如泰山之戒'],
        [1113127, 100, '康復防禦之戒'],
        [1113128, 100, '起源之塔增強之戒'],
        [1113243, 100, '龜龜戒指'],
    ],
    '4級箱子': [
        [1113329, 30, '持續之戒'],
        [1113098, 50, '剋制之戒'],
        [1113108, 100, '集成之戒'],
        [1113109, 100, '等級增益S'],
        [1113110, 100, '等級增益D'],
        [1113111, 100, '等級增益I'],
        [1113112, 100, '等級增益L'],
        [1113113, 100, '武器增益S'],
        [1113114, 100, '武器增益D'],
        [1113115, 100, '武器增益I'],
        [1113116, 100, '武器增益L'],
        [1113122, 100, '風險之戒'],
        [1113104, 100, '爆擊傷害戒指	'],
        [1113125, 100, '水晶HM'],
    ],
    '4級箱子GM': [
        [1113329, 30, '持續之戒'],
    ],
    '4級箱子2': [
        [1113108, 100, '集成之戒'],
        [1113109, 100, '等級增益S'],
        [1113110, 100, '等級增益D'],
        [1113111, 100, '等級增益I'],
        [1113112, 100, '等級增益L'],
        [1113113, 100, '武器增益S'],
        [1113114, 100, '武器增益D'],
        [1113115, 100, '武器增益I'],
        [1113116, 100, '武器增益L'],
        [1113122, 100, '風險之戒'],
        [1113104, 100, '爆擊傷害戒指	'],
        [1113125, 100, '水晶HM'],
    ]
}


const item = 2028272;

function start() {
    let list = itemlistall['1級箱子']
    let str = `是否開啟，當前擁有#v${item}:i# x ${stage.getItemQuantity(item)}\r\n`;
    str += `獎池如下(1級戒指):\r\n`;
    for (let i in list) {
        str += `#v${list[i][0]}:i#`;
    }
    let txt = npc.defText("是").minLen(0).maxLen(2).askText(str);
    if (txt == "是") {
        if (stage.getItemQuantity(item) < 1) {
            npc.say(`#v${item}:i# 不足`);
        } else {
            let prize = roll(list);
            if (!stage.canHold(prize[0], 1)) {
                npc.say("請清理揹包");
                return;
            }
            log.addEventValue(stage, db, "開啟1級塔戒");
            stage.gainItem(prize[0], 1);
            stage.loseItem(item, 1);
            npc.say(`恭喜你獲得#v${prize[0]}:i# x 1`);
            start();
        }
    }
}

function roll(list) {
    if (!Array.isArray(list) || list.length === 0) {
        return null;
    }
    const totalWeight = list.reduce((acc, item) => acc + item[1], 0);
    const randomNum = Math.random() * totalWeight;
    let cumulativeWeight = 0;
    for (let item of list) {
        cumulativeWeight += item[1];
        if (randomNum < cumulativeWeight) {
            return item;
        }
    }
    return null;
}

start();