/**
 * 賬號級自定義questid記錄代碼
 */
let questIdUtil = exports;
questIdUtil.getZDYQuestId = function (index) {
    return questIdList[index];
    
}
let questIdList=[//8位長度
	10000000,//(0)拍賣授權
	10000001,//(1)新手裝備箱2431092
	10000002,//(2)ZDY_新手禮包
	10000003,//(3)ZDY_七天簽到-長期
	10000004,//(4)ZDY_七天簽到-日
	10000005,//(5)ZDY_輪回共享
	20000000,//(6)ZDY_金幣商店-根據月份動態
	30000000,//(7)ZDY_戰令系統
	30001000,//(8)ZDY_戰令系統_等級
	30002000,//(9)ZDY_戰令系統_經驗
	30010000,//(10)ZDY_戰令系統_獎勵
	30020001,//(11)ZDY_戰令系統_每日1
	30020002,//(12)ZDY_戰令系統_每日2
	30020003,//(13)ZDY_戰令系統_每日3
	30020004,//(14)ZDY_戰令系統_每日4
	30020005,//(15)ZDY_戰令系統_每日5
	10010000,//(16)ZDY_兌換中心CDK
	10000006,//(17)ZDY_每日活躍_兌換樂豆
	10000007,//(18)ZDY_冒險暖暖_髮型
	10000008,//(19)ZDY_冒險暖暖_臉型
	10000009,//(20)ZDY_冒險暖暖_時裝
	10000010,//(21)ZDY_冒險暖暖_機器人
	10000011,//(22)ZDY_冒險暖暖_角色定制
	10000012,//(23)ZDY_冒險暖暖_安卓定制
	10020000,//(24)ZDY_在線獎勵_每日刷新
	10000013,//(25)ZDY_每晚簽到_每日刷新
	10000014,//(26)ZDY_每日活躍值_每日刷新
	10030000,//(27)ZDY_每日活躍_獎勵
	10030200,//(28)ZDY_每日活躍_空-未使用
	10030001,//(29)ZDY_每日活躍_組隊任務
	10030002,//(30)ZDY_每日活躍_擊殺2000
	10030003,//(31)ZDY_每日活躍_擊殺5000
	10030004,//(32)ZDY_每日活躍_擊殺10000
	10030005,//(33)ZDY_每日活躍_娛樂游戲
	10040000,//(34)ZDY_等級獎勵_聯盟獎勵公用
	10050000,//(35)ZDY_會員贊助_mvp月卡
	10060000,//(36)ZDY_會員贊助_mvp月卡領取獎勵次數
	10000015,//(37)ZDY_會員贊助_mvp1級月卡
	10000016,//(38)ZDY_會員贊助_mvp2級月卡
	10000017,//(39)ZDY_會員贊助_mvp3級月卡
	10070000,//(40)ZDY_禮包_春節
	10000018,//(41)ZDY_金幣副本
	10000019,//(42)ZDY_金幣副本每日時間
	10000020,//(43)ZDY_超值禮物箱_pq
	10000021,//(44)ZDY_超值禮物箱_pq完成
	10070001,//(45)ZDY_禮包_2月
	40000000,//(46)ZDY_巨大橘子碎片
	10000022,//(47)倉庫擴充
	10000023,//(48)傷害皮膚擴充
	10030006,//(49)ZDY_每日活躍_怪物公園
	10000024,//(50)聯盟幣每日
	10000025,//(51)聯盟幣戰場
	10000026,//(52)道場每日層數-點數
	10000027,//(53)組隊-第一次同行
	10000028,//(54)組隊-玩具
	10000029,//(55)組隊-海盜船
	10000030,//(56)組隊-御龍魔
	10000031,//(57)組隊-逃脫
	10000032,//(58)每日跳跳入場
	10000033,//(59)每日跳跳獎勵
	10000034,//(60)每日復古副本獎勵
	10070002,//(61)ZDY_禮包_3月
	10000035,//(62)道場獎勵職業
	10000036,//(63)道場獎勵全服
	10000037,//(64)創世任務打8次黑魔法師
	10000038,//(65)創世任務單挑通關
	10000039,//(66)創世解封繼承
	10055000,//(67)ZDY_會員中心_成長月卡
	10056000,//(68)ZDY_會員中心_魔方月卡
	10057000,//(69)ZDY_會員中心_幸運月卡
	10058000,//(70)ZDY_會員中心_投資30月卡
	10059000,//(71)ZDY_會員中心_投資998月卡
	10000040,//(72)組隊-女神塔
	10000041,//(73)炬燃游戲獎勵領取記錄
	10000042,//(74)公會支援祝福
	10000043,//(75)師徒商店幣同步
	10000044,//(76)師徒商店幣記錄
	10000045,//(77)師徒關係-師傅
	10000046,//(78)師徒關係-徒弟
	10000047,//(79)補全新手技能
	10070003,//(80)ZDY_禮包_愚人節禮包
	10080000,//(81)控制之神活動獎勵
	10000048,//(82)收集活動提報
	10000049,//(83)聯盟禮包
	10070004,//(84)ZDY_禮包_5月禮包
	10000050,//(85)ZDY_活動_五一 VIP
	10000051,//(86)ZDY_活動_五一 入場
	10000052,//(87)ZDY_活動_五一 積分
	10000053,//(88)ZDY_活動_五一 每日購買
	10100000,//(89)ZDY_活動_五一 獎勵
	40010000,//(90)ZDY_碎片_星星碎片
	50000000,//(91)技能吞噬記錄2634333
	10000054,//(92)ZDY_活動_五一 每日購買
	10000055,//(93)ZDY_追擊火焰狼
	10070005,//(94)ZDY_禮包_6月禮包
	10000056,//(95)足球游戲獎勵
	10000057,//(96)清理&補全新手技能
	10000058,//(97)卡丁船游戲獎勵
	40020000,//(98)ZDY_碎片_星星碎片
	10000059,//(99)萬聯盟禮包
	19999999//待定
]