/* marin 50009219 腳本訂製 技術顧問 */
let player = require("check_log")
let acStage, maps, date, pro;
let marin = [];
let com_maps = {
    450001113: [[500, 502], [2400, 1800, 1600], 100, "奧數之河"],
    450014300: [[506, 508], [2400, 1800, 1600], 100, "奧數之河"],
    450002010: [[512, 514], [2400, 1800, 1600], 100, "奧數之河"],
    450015290: [[528, 520], [2400, 1800, 1600], 100, "奧數之河"],
    450003440: [[534, 536], [2400, 1800, 1600], 100, "奧數之河"],
    450003350: [[530, 532], [2400, 1800, 1600], 100, "奧數之河"],
    450005241: [[540, 542], [2400, 1800, 1600], 100, "奧數之河"],
    450005242: [[540, 542], [2400, 1800, 1600], 100, "奧數之河"],
    450005430: [[544, 546], [2400, 1800, 1600], 100, "奧數之河"],
    450006430: [[556, 558], [2400, 1800, 1600], 100, "奧數之河"],
    450007110: [[562, 564], [2400, 1800, 1600], 100, "奧數之河"],
    450007120: [[562, 564], [2400, 1800, 1600], 100, "奧數之河"],
    450007130: [[562, 564], [2400, 1800, 1600], 100, "奧數之河"],
    450007140: [[564, 566], [2400, 1800, 1600], 100, "奧數之河"],
    450007150: [[564, 566], [2400, 1800, 1600], 100, "奧數之河"],
    450007160: [[564, 566], [2400, 1800, 1600], 100, "奧數之河"],
    450016110: [[578, 580], [2400, 1800, 1600], 100, "奧數之河"],
    450016120: [[578, 580], [2400, 1800, 1600], 100, "奧數之河"],
    450016130: [[578, 580], [2400, 1800, 1600], 100, "奧數之河"],
    450016140: [[578, 580], [2400, 1800, 1600], 100, "奧數之河"],
    450016150: [[578, 580], [2400, 1800, 1600], 100, "奧數之河"],
    450016160: [[578, 580], [2400, 1800, 1600], 100, "奧數之河"],
    450016210: [[582, 584], [2400, 1800, 1600], 100, "奧數之河"],
    450009360: [[594, 596], [2400, 1800, 1600], 100, "奧數之河"],
    450011640: [[610, 614], [2400, 1800, 1600], 100, "奧數之河"],
    450012310: [[616, 618], [2400, 1800, 1600], 100, "奧數之河"],
    450012320: [[616, 618], [2400, 1800, 1600], 100, "奧數之河"],
    450012330: [[616, 618], [2400, 1800, 1600], 100, "奧數之河"],
    450012340: [[616, 618], [2400, 1800, 1600], 100, "奧數之河"],
    450012350: [[616, 618], [2400, 1800, 1600], 100, "奧數之河"],
    450012400: [[620, 624], [2400, 1800, 1600], 100, "奧數之河"],
    450012410: [[620, 624], [2400, 1800, 1600], 100, "奧數之河"],
    450012420: [[620, 624], [2400, 1800, 1600], 100, "奧數之河"],
    450012430: [[620, 624], [2400, 1800, 1600], 100, "奧數之河"],
    450012440: [[620, 624], [2400, 1800, 1600], 100, "奧數之河"],
    410000520: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000530: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000540: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000550: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000590: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000600: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000610: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000640: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000650: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000660: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000700: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000710: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000720: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000730: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000740: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000750: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000920: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000930: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000940: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000950: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000980: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000990: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410001000: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410001010: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410001020: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410001030: [[5600, 5601], [300, 220, 200], 100, "格蘭蒂斯"],
    410000840: [[5650, 5651], [300, 220, 200], 100, "格蘭蒂斯"],
    410000850: [[5650, 5651], [300, 220, 200], 100, "格蘭蒂斯"],
    410000860: [[5650, 5651], [300, 220, 200], 100, "格蘭蒂斯"],
    410000870: [[5650, 5651], [300, 220, 200], 100, "格蘭蒂斯"],
    410000880: [[5650, 5651], [300, 220, 200], 100, "格蘭蒂斯"],
    410000890: [[5650, 5651], [300, 220, 200], 100, "格蘭蒂斯"],
    410003040: [[5700, 5701], [300, 220, 200], 100, "格蘭蒂斯"],
    410003050: [[5700, 5701], [300, 220, 200], 100, "格蘭蒂斯"],
    410003060: [[5700, 5701], [300, 220, 200], 100, "格蘭蒂斯"],
    410003070: [[5700, 5701], [300, 220, 200], 100, "格蘭蒂斯"],
    410003090: [[5700, 5701], [300, 220, 200], 100, "格蘭蒂斯"],
    410003100: [[5700, 5701], [300, 220, 200], 100, "格蘭蒂斯"],
    410003110: [[5700, 5701], [300, 220, 200], 100, "格蘭蒂斯"],
    410003120: [[5700, 5701], [300, 220, 200], 100, "格蘭蒂斯"],
    410003130: [[5700, 5701], [300, 220, 200], 100, "格蘭蒂斯"],
    410003140: [[5700, 5701], [300, 220, 200], 100, "格蘭蒂斯"],
    410003150: [[5700, 5701], [300, 220, 200], 100, "格蘭蒂斯"],
    410003160: [[5700, 5701], [300, 220, 200], 100, "格蘭蒂斯"],
    410003170: [[5700, 5701], [300, 220, 200], 100, "格蘭蒂斯"],
    410003180: [[5700, 5701], [300, 220, 200], 100, "格蘭蒂斯"],
    410003190: [[5700, 5701], [300, 220, 200], 100, "格蘭蒂斯"],
    410003200: [[5700, 5701], [300, 220, 200], 100, "格蘭蒂斯"],
    410007002: [[5800, 5801], [300, 220, 200], 100, "格蘭蒂斯"],
    410007003: [[5800, 5801], [300, 220, 200], 100, "格蘭蒂斯"],
    410007004: [[5800, 5801], [300, 220, 200], 100, "格蘭蒂斯"],
    410007005: [[5800, 5801], [300, 220, 200], 100, "格蘭蒂斯"],
    410007006: [[5800, 5801], [300, 220, 200], 100, "格蘭蒂斯"],
    410007007: [[5800, 5801], [300, 220, 200], 100, "格蘭蒂斯"],
    410007008: [[5800, 5801], [300, 220, 200], 100, "格蘭蒂斯"],
    410007009: [[5800, 5801], [300, 220, 200], 100, "格蘭蒂斯"],
    410007012: [[5800, 5801], [300, 220, 200], 100, "格蘭蒂斯"],
    410007013: [[5800, 5801], [300, 220, 200], 100, "格蘭蒂斯"],
    410007014: [[5800, 5801], [300, 220, 200], 100, "格蘭蒂斯"],
    410007015: [[5800, 5801], [300, 220, 200], 100, "格蘭蒂斯"],
    410007016: [[5800, 5801], [300, 220, 200], 100, "格蘭蒂斯"],
    410007017: [[5800, 5801], [300, 220, 200], 100, "格蘭蒂斯"],
    410007026: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007027: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007038: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007039: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007028: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007029: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007030: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007040: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007041: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007031: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007032: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007033: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007042: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007043: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007034: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007035: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007036: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007044: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007045: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007037: [[5900, 5901], [300, 220, 200], 100, "格蘭蒂斯"],
    410007522: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007523: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007524: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007525: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007546: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007547: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007527: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007528: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007529: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007548: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007549: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007530: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007537: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007538: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007539: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007550: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007551: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007552: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007553: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007540: [[6000, 6001], [300, 220, 200], 100, "格蘭蒂斯"],
    410007620: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007621: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007622: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007623: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007624: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007625: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007640: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007641: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007642: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007643: [[6000, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007644: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007645: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007660: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007661: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007662: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007663: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007664: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007665: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007666: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"],
    410007667: [[6100, 6101], [300, 220, 200], 100, "格蘭蒂斯"]
}
let income = [-1, -5, -28, -9, -8, -7, -11];
let proportion = 0;
let addition = {
    3700661: 20,
    3700662: 15,
    3700663: 12
}

function init(attachment) {
    [acStage, maps, pro] = attachment;
    marin = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0];
    marin[0] = pro;
    let map = event.getMap(maps);
    event.setVariable("maps", maps);
    event.setVariable("rune", 0);
    event.startTimer("kick", 60 * 60 * 1000);
    event.startTimer("BUFF", 30 * 60 * 1000);
    event.startTimer("marinrune", 60 * 1000);
    acStage.showTimer(60 * 60);
    date = new Date().getTime() + 60 * 60 * 1000;
    acStage.setEvent(event);
    for (let i in income) {
        if (income[i] === -11) {
            let Equip = acStage.getItemBySlot(-1, income[i]);
            if (Equip == null) {
                proportion += 10;
            } else {
                if (util.getItemReqLevel(Equip['itemId']) < 161) {
                    proportion += 10;
                }
            }
        } else {
            let Equip = acStage.getItemBySlot(-1, income[i]);
            if (Equip == null) {
                proportion += 5;
            } else {
                if (util.getItemReqLevel(Equip['itemId']) < 161) {
                    proportion += 5;
                }
            }
        }
    }
    for (let i in addition) {
        if (acStage.hasItem(parseInt(i), 1)) {
            marin[3] = addition[i];
            break;
        }
    }
    acStage.changeMap(maps, 0);
    acStage.applyItemBuff(2450054);
    marin[1] = parseInt(acStage.getQuestRecordExShare(100000, "totalmoney") || 0);
    marin[2] = parseInt(player.getQuestLog(acStage, 100001, 1));
}

function mobDied(mob) {
    const map = event.getMap(event.getVariable("maps"));
    if (map.hasRuneStone()) {
        return;
    }
    const mesoRange = com_maps[mob.getMapId()];
    marin[4] = parseInt(marinrandom(mesoRange[0][0], mesoRange[0][1]));
    marin[5] = mesoRange[2];
    marin[6] = (marin[5] + marin[3]) / 100;
    marin[7] = marin[4] + parseInt(marin[4] * marin[6].toFixed(2));
    marin[8] = mesoRange[1][2];
    if (isWeekend()) {
        marin[8] = mesoRange[1][0];
    } else {
        marin[8] = (mesoRange[1][(marin[0] <= 30 ? 1 : 2)])
    }
    marin[9] = parseInt(marin[4] + marin[4] * parseFloat(marin[8] / 100).toFixed(2));
    marin[10] = Math.ceil(marin[7] + marin[9]);
    marin[10] += parseInt(marin[10] * 0.1);
    if (mesoRange[3] === "格蘭蒂斯" && proportion > 0) {
        marin[10] = Math.ceil(marin[10] - (marin[10] * (proportion / 100)));
    }
    marin[14] += 1;
    if (marin[2] < 2000000000) {
        marin[11] += marin[10];
        marin[12] = Math.floor(marin[10] / 2);
        marin[1] += marin[12];//總金幣
        marin[2] += marin[10];//每日上限
        marin[13] += marin[12];//臨時金幣結算
    }
    if (acStage.isGm()) {
        acStage.dropMessage(0x15, "擊殺數量 = " + marin[14]);
        acStage.dropMessage(0x15, "地圖倍率 = " + marin[8]);
        acStage.dropMessage(0x15, "楓幣加成 = " + marin[5]);
        acStage.dropMessage(0x15, "物品加成 = " + marin[3]);
        acStage.dropMessage(0x15, "匯總楓幣 = " + marin[10]);
        acStage.dropMessage(0x15, "綁金楓幣 = " + marin[12]);
        acStage.dropMessage(0x16, "每日上限 = " + marin[2]);
        acStage.dropMessage(0x16, "綁金統計 = " + marin[1]);
        acStage.dropMessage(0x16, "楓幣統計 = " + marin[13]);
    }
    const message = "您擊殺了 " + marin[14] + " 只怪物 獲得了" + (marin[11] / 10000).toFixed(2) + " 萬楓幣  " + mesoRange[3] + " 倍率 " + marin[8] + "%  楓幣加成 " + (marin[5] + marin[3]) + " %　" + (marin[3] > 0 ? "( 女神加成 " + marin[3] + " % )" : "");
    map.blowWeather(5120146, message, 5);

}

function isWeekend() {
    const today = new Date();
    const dayOfWeek = today.getDay();
    return dayOfWeek === 0 || dayOfWeek === 6;
}

function playerDisconnected(stage) {
    stage.setEvent(null);
    stage.changeMap(100000000, 0);
    event.destroyEvent();
}

function marinrune() {
    let map = event.getMap(event.getVariable("maps"));
    let rune = parseInt(event.getVariable("rune"));
    if (map.hasRuneStone()) {
        rune += 1;
        event.setVariable("rune", String(rune));
        acStage.showBalloonMsg("#b請注意!!尚未解輪!!!#r" + rune + "#b / #r5", 200, 10);
    } else {
        event.setVariable("rune", String(0));
    }
    if (rune >= 5) {
        let currentYearMonth = getCurrentYearMonth();
        let Jrune = acStage.getIntQuestRecordExShare(100000, String(currentYearMonth));
        Jrune += 1;
        acStage.updateQuestRecordExShare(100000, String(currentYearMonth), String(Jrune))
        acStage.dropAlertNotice("抱歉..你沒有解輪");
        event.stopTimer("marinrune");
        acStage.cancelBuffStat(-2450054)
        kick();
        return;
    }
    event.startTimer("marinrune", 60 * 1000);
}

function playerChangedMap(stage, destination) {
    if (stage.getMapId() !== maps) {
        event.stopTimers();
        stage.setEvent(null);
        event.destroyEvent();
    } else {
        stage.showTimer((date - new Date().getTime()) / 1000);
    }
}

function clearance(stage) {
    let txt = "";
    txt += "楓幣 : " + ((Math.floor(marin[11] / 10000) / 2).toFixed(2)) + " 萬";
    txt += "綁金 : " + ((Math.floor(marin[11] / 10000) / 2).toFixed(2)) + " 萬";
    txt += "總計 : " + ((Math.floor(marin[11] / 10000)).toFixed(2)) + " 萬";
    util.broadcastWorldChatMsg(23, "恭喜玩家 " + stage.getCharacterName() + " 獲得 " + txt);
    stage.gainMesos(marin[13]);
    player.addQuestLog(stage, 100001, marin[11]);
    stage.updateQuestRecordExShare(100000, "totalmoney", String(marin[1]));
    stage.cancelBuffStat(-2450054)
}

function timerExpired(key) {
    switch (key) {
        case "kick":
            kick();
            break;
        case "marinrune":
            marinrune();
            break;
        case "BUFF":
            acStage.applyItemBuff(2450054);
            break;
    }
}

function kick() {
    acStage.setEvent(null);
    acStage.changeMap(100000000, 0);
    event.destroyEvent();
}

function deinit() {
    clearance(acStage);
    acStage.setEvent(null);
}

function marinrandom(min, max) {
    return Math.floor(Math.random() * (max - min + 1)) + min;
}

function getCurrentDate() {
    const today = new Date();
    const year = today.getFullYear();
    const month = (today.getMonth() + 1).toString().padStart(2, '0');
    const day = today.getDate().toString().padStart(2, '0');
    return year + month + day;
}

function getCurrentYearMonth() {
    const currentDate = new Date();
    const year = currentDate.getFullYear();
    const month = String(currentDate.getMonth() + 1).padStart(2, '0');
    const yearMonth = `${year}${month}`;
    return yearMonth;
}