// Created by MetaMS
// [潘奈迪特]  |  [9401592]
// MapName:大廳

let loop = true;
while (loop) {
        let selection = npc.id(9401592).askMenu("對研究有興趣的話再跟我說吧。\r\n\r\n#b#L0#關於共同研究#l#k\r\n#b#L1#關於個人研究#l#k\r\n#b#L2#關於能量之石等級對研究速度的影響#l#k\r\n#b#L3#關於城擴建研究#l#k\r\n#b#L4#關於房間獲得研究#l#k\r\n\r\n#r#L999#沒有其他好奇的事情。#l#k");
        switch (selection) {
                case 999:
                        loop = false;
                        break;
                case 0:
                        npc.id(9401592).next().say("原來你對共同研究有興趣呀。跟你說明一些共同研究需要注意的事項。");
                        npc.id(9401592).next().say("首先，共同研究僅限#r公會長#k可以進行，一般公會成員無法進行研究。");
                        npc.id(9401592).next().say("且所有研究不得同時進行2種，換言之#b一次研究當中僅限進行1種共同研究#k。");
                        npc.id(9401592).next().say("#r公會長#k可同時進行共同研究1種以及個人研究1種。");
                        npc.id(9401592).next().say("共同研究種類繁多，最具代表性的有\r\n\r\n#b擴充城房間的研究、城擴建研究、獲取房間的研究、強化各房間功能的研究、裝飾各房間的研究等，#k\r\n\r\n備有各式研究類別。");
                        npc.id(9401592).next().say("努力就能量之石的力量，應該就可以自然創造出更帥氣的城，我也會一同進行。\r\n你可別太勉強，#h0#。");
                        break;
                case 1:
                        npc.id(9401592).next().say("原來你對個人研究有興趣呀，跟你說明一些共同研究需要注意的事項。");
                        npc.id(9401592).next().say("首先，個人研究是所有公會成員#b個別進行的研究#k，各自套用的效果可能會有所不同。");
                        npc.id(9401592).next().say("因此，即便退出公會個人研究也不會受到影響。換言之#b完成的研究效果，在前往其他公會也仍可持續維持#k。");
                        npc.id(9401592).next().say("不過，未加入公會將無法確認研究列表，唯獨位於#b公會城內才可確認#k。");
                        npc.id(9401592).next().say("個人研究的種類繁多，最具代表性的有\r\n\r\n#b每週任務可擊殺怪物最大數量增加以及經驗值配發量增加、新增每週獎勵種類以及提升配發量、可從公會城內立即入場房間的傳送功能等#k\r\n\r\n各式研究。");
                        npc.id(9401592).next().say("持之以恆進行研究，一定能成為其他公會成員的表率，\r\n我相信你可以的，#h0#。");
                        break;
                case 2:
                        npc.id(9401592).next().say("想了解能量之石等級對研究速度的影響。");
                        npc.id(9401592).next().say("公會城進行的共同研究會受到能量等級影響，因此若能維持越高的能量等級將能夠更快速進行研究。");
                        npc.id(9401592).next().say("#b能量等級#k會根據前一週#b每週任務參與次數所決定#k，會根據該等級所訂定的倍率來縮減剩餘時間。");
                        npc.id(9401592).next().say("開始共同研究時，會根據該時間點#b能量等級#k的倍率，縮減至下週三午夜以前的剩餘時間。");
                        npc.id(9401592).next().say("之後在研究進行中到了星期三午夜，就會根據該時間點刷新的#b能量等級#k倍率來扣減下週三午夜前的剩餘時間。");
                        //npc.id(9401592).next().say("目前公會城#b能量等級與研究速度倍率資訊#k如下。\r\n\r\n - 本週能量等級： #b2#k\r\n - 每週任務完成次數： #b12#k\r\n - 下週預期能量等級： #r2#k");
                        npc.id(9401592).next().say("#b想了解各能量等級達成條件與研究速度倍率#k請參考下方。\r\n\r\n#b[能量等級倍率 / 能量等級達成條件]#k\r\n - 1等級： 0% (無) / 無每週任務完成次數\r\n - 2等級： 40% / 每週任務完成次數 5次以上\r\n - 3等級： 50% / 每週任務完成次數 15次以上\r\n - 4等級： 55% / 每週任務完成次數 50次以上\r\n - 5等級： 60% / 每週任務完成次數 100次以上\r\n#r※ 研究進行將扣除下週三午夜前的剩餘時間乘以倍率的時間。");
                        break;
                case 3:
                        npc.id(9401592).next().say("你想了解擴建城的研究呀。");
                        npc.id(9401592).next().say("蛻變成全新的城需要非常多的準備，因此在開始研究以前必須慎重選擇。");
                        npc.id(9401592).next().say("基本上#b城擴建研究#k在完成時，為了要準備迎接城轉變後的樣貌，#r所有公會成員將暫時退出#k。");
                        npc.id(9401592).next().say("且需要特別注意配置的房間位置與獎牌位置將初始化。");
                        npc.id(9401592).next().say("要特別留心在房間擴充以及城擴建研究完成之後，將無法#b讓城再回到前一階段#k。");
                        npc.id(9401592).next().say("在房間擴建所選擇的方向。");
                        break;
                case 4:
                        npc.id(9401592).next().say("你想知道關於獲得房間的研究呀。");
                        npc.id(9401592).next().say("首先，房間可說是公會城核心的空間，公會成員可一同訓練或享有各式優惠，也是一個休息以及創造回憶的地方。");
                        npc.id(9401592).next().say("房間大致上分成#b一般房間#k與#b特殊房間#k 2種，若對於各房間感到好奇，感覺親自進入房間一探究竟會比較好。");
                        npc.id(9401592).next().say("完成#b最初取得房間的研究#k，會立即獲得該房間，可透過房間管理UI進行確認。");
                        npc.id(9401592).next().say("還有無法透過研究取得，唯有面對強敵才能入手的特殊房間。\r\n顧慮周全應該可以發展出充滿特色的城呢，我會替你應援的。");
                        break;

        }
}