/*
 * Copyright (c) 2025. Lorem ipsum dolor sit amet, consectetur adipiscing elit.
 */

/*
 * 累沖禮包
 */
let log = require('check_log');
const tt = "#fUI/UIWindow2/AdditionalOptionTooltip/unique#"; //餅乾兔子
const a1 = "#fUI/RunnerGame/RunnerGameUI/Effect/ItemEffect_Protect1/3#";
// 每個階段禮包所需的充值數
const condition = [500, 1000, 2000, 3500, 5000, 7000, 9000, 11000, 13000, 18000, 23000, 28000, 32000, 40000, 50000, 60000];
// 能看到上述禮包的金額數
const conditionDD = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0];
// 禮包內容
const reward = [

    //500檔
    [
        [1, 4001785, 200, ""],//定居金500萬金幣
        [1, 4310218, 48, ""],//幻影幣
    ],

    //1000檔
    [
        [2, 4001785, 300, ""],//定居金500萬金幣
        [2, 4310249, 32, ""],//幻影幣
        [2, 2435824, 10, ""],//V卷
		[2, 5060048, 10, ""],//蘋果
		[2, 5062512, 5, ""],//絕對
		[2, 5062005, 5, ""],//驚奇
		[2, 5062013, 5, ""],//太陽

    ],

    //2000檔
    [
        [3, 4001785, 300, ""],//定居金500萬金幣
        [3, 4310249, 16, ""],//火花
        [3, 2048761, 10, ""],//火花
        [3, 2430376, 5, ""],//黑卷
		[3, 5060025, 10, ""],//抒情
		[3, 5062512, 5, ""],//絕對
		[3, 5062005, 5, ""],//驚奇
		[3, 5062013, 5, ""],//太陽
    ],

    //3500檔
    [
        [4, 4001785, 300, ""],//定居金500萬金幣
        [4, 5062020, 30, ""],//6角
        [4, 1113211, 1, ""],//定居金500萬金幣
        [4, 2048761, 10, ""],//火花
        [4, 2430376, 15, ""],//黑卷
		[4, 5060086, 30, ""],//畫框
		[4, 5062512, 5, ""],//絕對
		[4, 5062005, 5, ""],//驚奇
		[4, 5062013, 5, ""],//太陽
    ],

    //5000檔
    [
        [5, 4001785, 300, ""],//定居金500萬金幣
        [5, 2430376, 15, ""],//黑卷
        [5, 2048761, 10, ""],//火花
		[5, 5060087, 100, ""],//jinnan
        [5, 5062512, 5, ""],//絕對
		[5, 5062005, 5, ""],//驚奇
		[5, 5062013, 5, ""],//太陽		
    ],

    //7000檔
    [
        [6, 2434321, 5, ""],//拼圖
        [6, 2472000, 20, ""],//白金鎚子
        [6, 4001785, 300, ""],//定居金500萬金幣
        [6, 2049389, 2, ""],//星力20X
		[6, 5060087, 20, ""],//jinnan
        [6, 5062512, 10, ""],//絕對
		[6, 5062005, 10, ""],//驚奇
		[6, 5062013, 10, ""],//太陽	
    ],

    //9000檔
    [
        [7, 1142789, 1, ""],//人類祖強
        [7, 2633195, 3, ""],//火花器
        [7, 2434321, 5, ""],//拼圖
        [7, 4001785, 300, ""],//定居金500萬金幣
        [7, 2049389, 3, ""],//定居金500萬金幣
		[7, 5060087, 20, ""],//jinnan
        [7, 5062512, 10, ""],//絕對
		[7, 5062005, 10, ""],//驚奇
		[7, 5062013, 10, ""],//太陽	
    ],

    //11000檔
    [
        [8, 1114403, 1, ""],//截止
        [8, 2633195, 3, ""],//火花器
        [8, 2644008, 1, ""],//追加1星
        [8, 4001785, 300, ""],//定居金500萬金幣
		[8, 5060087, 100, ""],//jinnan
        [8, 5062512, 15, ""],//絕對
		[8, 5062005, 15, ""],//驚奇
		[8, 5062013, 15, ""],//太陽	
    ],

    //13000檔
    [
        [9, 5062026, 50, ""],//唯一
        [9, 4001785, 300, ""],//定居金500萬金幣
        [9, 2644008, 2, ""],//追加11113211
        [9, 2472000, 30, ""],//定居金500萬金幣
     //   [9, 1113211, 1, ""],//定居金500萬金幣
		[9, 5060087, 30, ""],//jinnan
        [9, 5062512, 15, ""],//絕對
		[9, 5062005, 15, ""],//驚奇
		[9, 5062013, 15, ""],//太陽	
    ],

    //18000檔
    [
        [10, 4001785, 300, ""],//定居金500萬金幣
        [10, 5062021, 50, ""],//平等魔方
        [10, 2644008, 3, ""],//追加1星
        [10, 1114403, 1, ""],//戒指
		[10, 5060087, 130, ""],//畫框
        [10, 5062512, 15, ""],//絕對
		[10, 5062005, 15, ""],//驚奇
		[10, 5062013, 15, ""],//太陽	
    ],

    //23000檔
    [
        [11, 2048761, 100, ""],//火花
        [11, 4001785, 300, ""],//定居金500萬金幣
        [11, 2644008, 3, ""],//追加
        [11, 2430377, 10, ""],//命運
		[11, 5060025, 50, ""],//畫框
        [11, 5062512, 25, ""],//絕對
		[11, 5062005, 25, ""],//驚奇
		[11, 5062013, 25, ""],//太陽	
    ],

    //28000檔
    [
        [12, 2633195, 5, ""],//火花器
        [12, 2430377, 20, ""],//命運
        [12, 4001785, 300, ""],//定居金500萬金幣
        [12, 2472000, 30, ""],//白金鎚子
		[12, 5060087, 150, ""],//畫框
        [12, 5062512, 25, ""],//絕對
		[12, 5062005, 25, ""],//驚奇
		[12, 5062013, 25, ""],//太陽	
    ],

    //32000檔
    [
        [13, 2633195, 5, ""],//火花器
        [13, 4001785, 300, ""],//定居金500萬金幣
        [13, 2430378, 10, ""],//周年命運
        [13, 2434321, 10, ""],//拼圖
		[13, 5060025, 50, ""],//畫框
		[13, 5060087, 50, ""],//畫框
		[13, 5060048, 50, ""],//畫框
		[13, 5060086, 50, ""],//畫框
        [13, 5062512, 100, ""],//絕對
		[13, 5062005, 100, ""],//驚奇
		[13, 5062013, 100, ""],//太陽	
		
    ],

    //40000檔
    [
        [14, 4001785, 1000, ""],//定居金500萬金幣
        [14, 2430378, 30, ""],//周年命運
        [14, 1113332, 1, ""],//頓凱爾悲傷戒指
        [14, 2048761, 100, ""],//火花
		[14, 5060025, 150, ""],//畫框
		[14, 5060087, 150, ""],//畫框
		[14, 5060048, 150, ""],//畫框
		[14, 5060086, 150, ""],//畫框
        [14, 5062512, 100, ""],//絕對
		[14, 5062005, 100, ""],//驚奇
		[14, 5062013, 100, ""],//太陽
    ],

    //50000檔
    [
        [15, 4001785, 1000, ""],//定居金500萬金幣
        [15, 2638443, 1, "滿級3終傲天怪怪"],//傲天怪怪
        [15, 1114403, 1, ""],//戒指
        [15, 2048761, 150, ""],//火花
		[15, 2430379, 20, ""],//救世主
		[15, 5060025, 200, ""],//畫框
		[15, 5060087, 200, ""],//畫框
		[15, 5060048, 200, ""],//畫框
		[15, 5060086, 200, ""],//畫框
        [15, 5062512, 100, ""],//絕對
		[15, 5062005, 100, ""],//驚奇
		[15, 5062013, 100, ""],//太陽


    ],
	
	//60000
	[
        [16, 4001785, 2000, ""],//定居金500萬金幣
        [16, 1143424, 1, "老子最強"],//傲天怪
        [16, 2048761, 200, ""],//火花
		[16, 2430379, 30, ""],//救世主
		[16, 5060025, 300, ""],//畫框
		[16, 5060087, 300, ""],//畫框
		[16, 5060048, 300, ""],//畫框
		[16, 5060086, 300, ""],//畫框
        [16, 5062512, 100, ""],//絕對
		[16, 5062005, 100, ""],//驚奇
		[16, 5062013, 100, ""],//太陽


    ]
]

let hyPay = getHyPay(2);
let sel = "當前總贊助金額 #r" + hyPay + "\r\n#r滿了可以聯繫群主重置刷新,開啟新的一輪循環,每5000檔可以找GM領取專屬屬性100%BOSS傷害定制~\r\n";
for (let i = 0; i < condition.length; i++) {
    if (hyPay >= conditionDD[i]) {
        if (log.getEventValue(stage, db, "累充禮包" + i) > 0) {
            sel += "#d#L" + (i) + "#" + tt + " [#r已完成#d]循環充值禮包福利 #r\t\t\t" + condition[i] + "#l\r\n";
        } else {
            sel += "#d#L" + (i) + "#" + tt + " [未完成]循環充值禮包福利 #r\t\t\t" + condition[i] + "#l\r\n";
        }
    }
}


let selected = npc.askMenu(sel);
if (selected == 1088) {
    player.runScript("秘書商城");
} else {
    sel = "			#r#e - 循環禮包 #r" + condition[selected] + " #r元福利 -\r\n#d#n"
    for (let rr of reward) {
        for (let r of rr) {
            if (r[0] == selected + 1) {
                sel += "  #i" + r[1] + "# #z" + r[1] + "#[" + r[2] + "個] " + r[3] + "\r\n";
            }
        }
    }
    sel += "#r#e\r\n是否現在就領取該禮包？\r\n";
    let YN = npc.askYesNo(sel)
    if (YN) {
        //判斷是否已經領取
        if (log.getEventValue(stage, db, "累充禮包" + selected) > 0) {
            npc.say("您的賬號已經領取過該禮包，無法再次領取");
        } else if (getHyPay(2) < condition[selected]) {
            npc.say("金額未達標，無法領取");
        } else {
            var rewardlist = [];
            for (let rr of reward) {
                for (let r of rr) {
                    if (r[0] == (selected + 1)) {
                        if (r[3] == null) {
                            r[3] = -1;
                        }
                        rewardlist.push([r[1], r[2], r[3]]);
                    }
                }
            }
            if (stage.getFreeSlot(1) < rewardlist.length || stage.getFreeSlot(2) < rewardlist.length || stage.getFreeSlot(3) < rewardlist.length || stage.getFreeSlot(4) < rewardlist.length || stage.getFreeSlot(5) < rewardlist.length) {
                npc.say("包裹空間不足，請確保包裹每個欄位有至少 " + rewardlist.length + " 格空間");
            } else {
                log.addEventValue(stage, db, "累充禮包" + selected, 1, -1);
                for (let r of rewardlist) {
                    stage.gainItem(r[0], r[1]);
                }
                util.broadcastWeatherEffectNotice("☆累充禮包☆  玩家 " + stage.getCharacterName() + " 領取了累充 " + condition[selected] + " 點大禮包！！！", 24, 10000, true);
			   //util.broadcastChatMsg(10,"☆累充禮包☆  玩家 " + player.getName() + " 領取了累充 " + condition[selected] + " 點大禮包！！！", 24, 10000, true);
                npc.say("領取成功");
            }
        }
    }
}

function getHyPay(type) {
    const push = db.select("SELECT * FROM hypay WHERE accname = '" + getAccountName() + "';");
    if (push.length > 0) {
        switch (type) {
            case 1:
                return push[0].get('pay')
            case 2:
                return push[0].get('payReward')
            case 3:
                return push[0].get('leiji')
            default:
                return false;
        }
    } else {
        db.insert("INSERT INTO `hypay` (`accname`, `name`) VALUES (" + getAccountName() + ", " + stage.getCharacterName() + ")");
        return getHyPay(2);
    }
}

function getAccountName() {
    const ret = db.select(`SELECT *
                           FROM account
                           WHERE id = '${stage.getAccountId()}'
                           LIMIT 0,1;`);
    return ret[0].get("name");
}