// Created by MetaMS
// [瓦蕾莉]  |  [9270314]
// MapName:主體育場

npc.id(9270314).next().say("\r\n#b#e<維多利亞船艇競賽>#n#k是8人一起競爭的遊戲！");
npc.id(9270314).next().say("\r\n#e[操作方法] #n\r\n\r\n我先為你說明操作鍵！\r\n\r\n#fUI/UIMiniGame.img/mapleRacing/tuto/0#");
npc.id(9270314).next().say("\r\n#e[移動]#n\r\n\r\n按下鍵盤的#r#e上、下、左、右#k#n箭頭按鍵就能移動船艇！\r\n\r\n");
npc.id(9270314).next().say("\r\n#e[甩尾]#n\r\n\r\n同時按下左、右方向鍵和鍵盤#r#eSHIFT#k#n鍵時，可往選擇的方向開始甩尾！\r\n\r\n在開始入彎前預先開始甩尾即可輕鬆過彎！\r\n\r\n");
npc.id(9270314).next().say("\r\n#e[起步推進器]-使用起步推進器#n\r\n\r\n抓準起跑信號3、2、1，GO\r\n\r\n快速按下鍵盤的#r#e上箭頭#k#n按鈕，即可在規定時間內發動起步推進器，用更快的速度起跑！\r\n\r\n");
npc.id(9270314).next().say("\r\n#e[噴射推進器]-使用噴射推進器#n\r\n\r\n抓準甩尾結束的時間點\r\n\r\n再次快速按下鍵盤的#r#e上箭頭#k#n按鍵，即可在規定時間內發動噴射推進器更快地加速！\r\n\r\n");
npc.id(9270314).next().say("\r\n#e[推進器道具]-補充推進器量條#n\r\n\r\n使用甩尾即可聚集推進器量條！\r\n\r\n甩尾量條的橘色部分代表預計補充的量條，沒有碰撞時會變成黃色並且固定量條！\r\n但是，如果在甩尾中發生碰撞，預計補充的量條就會初始化，必須留意！\r\n\r\n");
npc.id(9270314).next().say("\r\n#e[推進器道具]-使用推進器#n\r\n\r\n使用推進器時可用更快的速度奔馳！\r\n\r\n在持有推進器道具的狀況下按壓鍵盤#r#eCTRL#k#n鍵，即可在規定時間內發動推進器，用更快的速度奔馳！\r\n\r\n");
npc.id(9270314).next().say("\r\n#e[點數]#n\r\n\r\n遊戲結束後可根據排名分別獲得#b競速點數#k#n和#b收藏點數#k#n作為獎勵！\r\n\r\n");
npc.id(9270314).next().say("\r\n#e[點數]-競速點數#n\r\n\r\n競速點數可累積下來，根據分數獲得收藏簿的獎勵！\r\n對了！別忘了，也可在成就中獲得憤怒的疾走飾品喔！\r\n\r\n#r(第1名：7點，第2名：5點，第3名：4點，第4名：3點，第5～6名：2點，第7～8名1點)#k\r\n\r\n");
npc.id(9270314).next().say("\r\n#e[點數]-收藏點數#n\r\n\r\n收藏點數可用來在收藏簿中貼上貼紙，貼得越多就能獲得豐厚的獎勵，請努力貼上貼紙吧！\r\n\r\n#r(第1～2名：300點，第3～4名：200點，第5～8名：100點)#k\r\n\r\n");
npc.id(9270314).say("那麼！有關維多利亞船艇競賽的說明到此為止！\r\n盡情狂飆吧！");