// Created by MetaMS
// [Unknown]  |  [93]
// MapName:賽爾尼溫廣場
let flag = true;
while (flag) {
        let selection = npc.id(3006700).askMenu("你想知道關於#e#r史詩副本：高山#n#k的事嗎？\r\n請問什麼就儘管問吧！\r\n#L1##b何為史詩副本：高山？#k#l\r\n#L2##b副本挑戰方法#k#l\r\n#L3##b專用技能使用方法#k#l\r\n#L4##b副本完成獎勵#k#l\r\n#L5##b注意事項說明#k#l\r\n\r\n#L10#完成交談#l");
        switch (selection) {
                case 1:
                        npc.id(3006700).next().say("\r\n\r\n#b#e史詩副本：高山#k#n是以從長眠中甦醒的\r\n#r#e太陽神米特拉#k#n，返回高山時的故事為主題\r\n的副本。\r\n\r\n在副本中，你會化身為太陽神米特拉，\r\n甚至還能夠借用#r#e祂的特殊力量#k#n。\r\n\r\n只要使用太陽神的力量，將副本內的敵人通通剷除，\r\n你就能獲得#r#e超級值得的獎勵#k#n！");
                        break;
                case 2:
                        npc.id(3006700).next().say("#e<前置條件>#n\r\n\r\n只要向我塞拉札爾領取\r\n#b「[史詩副本]高山」#k任務，即可進行\r\n高山劇情模式。\r\n\r\n#r完成高山劇情模式#k後，\r\n即可正式進入高山副本。");
                        npc.id(3006700).next().say("#e<挑戰限制和每週初始化>#n\r\n\r\n高山副本#r每個楓之谷帳號每週僅限一個角色#k\r\n進入及完成。\r\n\r\n但#r完成紀錄將於每週四上午0點初始化#k，\r\n因此請你務必記得在那之前完成所有關卡。");
                        npc.id(3006700).next().say("#e#n<關卡入場及退場>\r\n\r\n高山副本內\r\n#r共有10個關卡#k可遊玩.\r\n\r\n你可以從#b數字最低的關卡開始依序#k\r\n進入並完成所有關卡。");
                        npc.id(3006700).next().say("\r\n\r\n即使未完成所有關卡，\r\n你也可以在#r中途離開#k高山副本。\r\n\r\n另外，在#r星期四上午0點前再次入場#k時，\r\n你可從先前正在進行的關卡開始#b接續挑戰#k，因此你可以在任意的時間進入副本遊玩。");
                        break;
                case 3:
                        npc.id(3006700).next().say("#e<何為專用技能>#n\r\n\r\n專用技能指的是#r#e高山副本專用戰鬥技能#k#n，\r\n該技能可以讓你#r藉助太陽神米特拉的力量#k，並消滅大多數的敵人。\r\n\r\n但因為這種力量相當強大，因此你必須#b變身為太陽神米特拉#k才能使用。");
                        npc.id(3006700).next().say("#e<高山專用戰鬥技能及權能>#n\r\n\r\n高山專用戰鬥技能#r#e共有5種#k#n。\r\n\r\n - 火拳#b(故事模式專用)#k\r\n - 炎陽突擊\r\n - 炎陽利刃\r\n - 閃焰\r\n - 權能解放");
                        npc.id(3006700).next().say("\r\n除了火拳外，使用其他四種戰鬥技能時，\r\n皆須消耗#r#e權能#k#n。\r\n\r\n在高山副本戰鬥途中，只要#r消滅怪物#k，\r\n即可獲得權能。");
                        npc.id(3006700).next().say("#e<設定快捷鍵>#n\r\n\r\n你可以使用#r#e快捷鍵設定介面#k#n，\r\n變更變身/解除、雙重跳躍、專用戰鬥技能的快捷鍵。\r\n\r\n點擊#b史詩副本入場介面左下方的\r\n#i3801881#快捷鍵設定鍵#k，即可開啟快捷鍵設定介面。\r\n\r\n另外，即使在挑戰關卡途中，你依舊可以透過\r\n#b畫面下方的專用技能介面#k立即變更快捷鍵。");
                        npc.id(3006700).next().say("#e<米特拉變身/解除及雙重跳躍>#n\r\n\r\n使用#b#e#i3801882#\r\n米特拉變身/解除#k#n\r\n，即可變身成米特拉或解除變身。\r\n\r\n點擊#b#e#i3801883#\r\n跳躍快捷鍵#k#n即可執行跳躍，\r\n連續點擊兩次時，可快速移動至更遠的地方。");
                        npc.id(3006700).next().say("#e<火拳>#n\r\n\r\n#i3801888#\r\n#r#e火拳#k#n為米特拉的#b基本攻擊技能#k，\r\n該攻擊能以肉眼看不見的快速拳頭，\r\n對多數的敵人造成傷害。\r\n\r\n但該技能僅限在#r高山劇情模式#k中使用。");
                        npc.id(3006700).next().say("#e<炎陽突擊>#n\r\n\r\n#i3801884#\r\n#r#e炎陽突擊#k#n能以如同火光般的速度#b急衝#k，\r\n並對路徑上的敵人們造成傷害。");
                        npc.id(3006700).next().say("#e<炎陽利刃>#n\r\n\r\n#i3801885#\r\n#r#e炎陽利刃#k#n可將太陽的炙熱溫度化為實體，\r\n並將其轉為#b威力強大的劍氣#k射向敵人。");
                        npc.id(3006700).next().say("#e<閃焰>#n\r\n\r\n#i3801886#\r\n#r#e閃焰#k#n可引爆太陽滾燙的熱氣，\r\n並將#b周圍廣範圍#k內的一切事物化為灰燼。");
                        npc.id(3006700).next().say("#e<權能解放>#n\r\n\r\n#i3801887#\r\n使用#r#e全能解放#k#n時將#r#e消耗所有權能#k#n，\r\n但可在一定時間內釋放太陽神的所有力量。\r\n\r\n在權能解放狀態下使用其他戰鬥技能時，\r\n太陽的氣息將向外擴散，並攻擊周圍敵人。");
                        break;
                case 4:
                        npc.id(3006700).next().say("#e基本獎勵#n\r\n\r\n#i4036314#  #i4009547#  #i4310345#\r\n\r\n完成高山副本時，可獲得#b經驗值#k、#b30個靈魂艾爾達碎片#k,\r\n#b2個楓葉銅硬幣#k。");
                        npc.id(3006700).next().say("#e<額外獎勵>#n\r\n\r\n完成高山副本後，使用楓葉點數即可獲得\r\n#b額外獎勵#k或#b特殊額外獎勵#k。\r\n\r\n#b額外獎勵#k即為#r除了楓葉銅硬幣之外，可追加獲得基本獎勵的2倍獎勵#k。\r\n(所需楓葉點數：200)\r\n\r\n#b特殊額外獎勵#k即為 #r除了楓葉銅硬幣之外，可追加獲得基本獎勵的4倍獎勵#k。\r\n(所需楓葉點數：360)");
                        break;
                case 5:
                        npc.id(3006700).next().say("\r\n\r\n史詩副本每個楓之谷帳號每週\r\n僅限一個角色進入。\r\n\r\n但若#r#e進入地城的角色已進行伺服器轉移，\r\n則該角色將無法進入副本或獲得獎勵，#k#n\r\n\r\n因此在進行世界轉移前，\r\n請務必完成副本並領取獎勵。#k");
                        break;
                default:
                        flag = false;
                        break;
        }
}