// Created by MetaMS

let loop = true;
while (loop) {
        let selection = npc.id(9401981).askMenu("你似乎需要#b#e[裝備傳授]#n#k功能的細部說明？\r\n\r\n#b#L0#什麼是裝備傳授呢？#l#k\r\n#b#L1#可以裝備傳授的裝備有？#l#k\r\n#b#L2#裝備傳授功能使用方法#l#k\r\n#b#L3#裝備傳授使用注意事項#l#k");
        switch (selection) {
                case 0:
                        npc.id(9401981).next().say("使用#b裝備傳授#k功能，可將自身角色特定裝備道具移動至相同伺服器內其他角色身上喔！使用裝備傳授還可#r移動不可交換的裝備#k呢！");
                        npc.id(9401981).next().say("不過#b裝備傳授#k的功能可不僅如此！傳授裝備時將會#r配合傳授角色的職業，變更裝備的種類與能力值#k喔！！");
                        npc.id(9401981).next().say("比方說像#b劍士武器#k要傳授成#b手杖武器#k時，#r劍會變為手杖#k，#r武器的力量變為幸運#k。呵呵呵！很驚人吧？");
                        break;
                case 1:
                        npc.id(9401981).next().say("如此神祕又驚人的功能，當然不是在所有裝備都能使用囉！\r\n僅#b特定武器#k與#b特定徽章#k可使用傳授喔！#b\r\n可裝備傳授的裝備目錄\r\n - 航海師武器\r\n - 夫尼爾武器\r\n - 各職業黃金徽章\r\n - 部分特殊徽章\r\n - 各職業100級的部分輔助武器");
                        npc.id(9401981).next().say("想知道有那些裝備可以進行傳授，直接將裝備放至#b裝備傳授#k專用視窗確認也是一種方法喔！還可以事前查看進行#b裝備傳授#k之後將會如何變化！");
                        break;
                case 2:
                        npc.id(9401981).next().say("首先，你會看到裝備傳授專用的視窗！將可傳授的裝備放入視窗裡，就能預覽傳授後的變化！\r\n你可以選擇同個世界裡的其他角色目錄，不妨選擇想要傳授裝備的角色試試吧！");
                        npc.id(9401981).next().say("下定決心之後必須#b萃取裝備精髓#k傳授給另一個角色！\r\n原理就是將萃取的#b裝備精髓#k使用於伺服器內想要的角色身上，裝備就會變換成配合角色的轉變型態喔！\r\n#b裝備精髓#k可透過保管箱轉給其他角色。");
                        npc.id(9401981).next().say("你應該也知道，#e#r萃取精髓的裝備會完全被破壞#k，因此進行之前必須慎重確認！");
                        npc.id(9401981).next().say("接受裝備傳授的其他角色使用萃取的#b裝備精髓#k時，可以再次確認裝備會根據該角色而變為什麼樣的型態。如果不小心選錯角色時，可再次透過保管箱傳授給正確的角色。");
                        npc.id(9401981).next().say("#b裝備的精髓#k使用完畢，且裝備完全傳授後，所有程序就結束了！這是傳授珍貴裝備的過程，不能失誤啊！");
                        break;
                case 3:
                        npc.id(9401981).next().say("使用#b裝備傳授#k功能時，保留裝備擁有的強化數值與能力的同時，根據接受傳授的角色需求改變裝備的型態。\r\n但是有幾個注意事項。");
                        npc.id(9401981).next().say("第一！裝備傳授在#r每個世界 1次的使用限制#k已經到了呢。如果有數個想要傳授的裝備，那可要好好思考優先順序了吧？");
                        npc.id(9401981).next().say("第二！裝備傳授必須在#r慶典期間結束前完成#k！\r\n如果具備裝備傳授的條件還偷懶，或在已萃取裝備精髓的狀態下慶典結束了，#r機會就沒了#k ，決定好了就盡快行動吧！");
                        npc.id(9401981).next().say("第三！為了裝備傳授而萃取裝備的精髓後，#r無法復原因萃取精髓而被破壞的裝備#k，請務必慎重思考後再決定！\r\n在萃取裝備的精髓之前#b可預覽裝備的變化#k，在做決定上會有幫助的。");
                        npc.id(9401981).next().say("第四！部分輔助武器當中若裝備的#b成長等級#k提升且追加包含#r成長型能力值#k，#r該能力值並不會於傳授時一同移動！#k此點請於使用時注意！");
                        npc.id(9401981).next().say("第五！ 裝備傳授只能傳授#rSTR%、INT%、DEX%、LUK%、物理攻擊力%、魔法攻擊力%#k的潛在能力！\r\n還有#b惡魔復仇者#k職業的情況主要屬性的屬性是STR、副屬性是DEX，請注意！");
                        break;
        }
}