// Created by MetaMS

let ccc = npc.id(9000233).askMenu("咕咕咕，你想了解旗幟爭奪戰的哪方面？\r\n\r\n#b#L0#旗幟爭奪戰是什麼？#l\r\n#b#L1#進行旗幟爭奪戰有什麼好處？#l\r\n#L4#想了解旗幟爭奪戰得分標準。#l\r\n#L3#沒什麼。#l");
switch (ccc) {
        case 0:
                npc.id(9000233).next().say("\r\n想要了解我偉大的創作-旗幟爭奪戰嗎？");
                npc.id(9000233).next().say("\r\n每天可以自由參加，只有#r狩獵點數1,000點或Boss點數40點以上的公會成員#k能參加。");
                npc.id(9000233).next().say("\r\n但是，每週日下午11點30分到週一上午0點30分為結算時間，無法入場，請參考。");
                npc.id(9000233).next().say("\r\n規則很簡單，最快時間內跑到終點就可以了。當然，會有一～～～點像障礙物的東西。");
                npc.id(9000233).next().say("\r\n在旗幟爭奪戰內，只能移動跟跳躍，正正當當的分出勝負．．．才怪，有只有在賽道內可以使用的旗幟技能。");
                npc.id(9000233).next().say("\r\n好好搭配旗幟技能跟地圖上的裝置，可以進到一般無法進入的路，或是更快的跑完全程。");
                npc.id(9000233).next().say("\r\n對了，進入爭奪戰之後，所有變身狀態都會解除，即便在爭奪戰內使用變身藥水，也不會變身。反而是珍貴的藥水可能消失，記得小心。");
                npc.id(9000233).next().say("\r\n超過101級才可以參加，這個記得先確認。如果你已經超過101級很久了，就．．．");
                npc.id(9000233).say("\r\n那麼，你就加油吧。");
                break;
        case 1:
                npc.id(9000233).next().say("\r\n有什麼好處？有路就去跑，有障礙就越過他啊，一定要有好處才行嗎？");
                npc.id(9000233).next().say("\r\n．．．開玩笑的。可根據每週旗幟爭奪戰公會得分獲得SP。而該SP能直接投資於公會技能中的貴族技能。");
                npc.id(9000233).next().say("#b#e10,000分以上：10個SP\r\n9,000分以上：9個SP\r\n8,000分以上：8個SP\r\n7,000分以上：7個SP\r\n6,000分以上：6個SP\r\n5,000分以上：5個SP\r\n4,000分以上：4個SP\r\n3,000分以上：3個SP\r\n2,000分以上：2個SP\r\n1,000分以上：1個SP");
                npc.id(9000233).next().say("\r\n旗幟爭奪戰公會得分是以各公會成員的旗幟爭奪戰得分總合決定。賽跑實力傑出的同伴眾多的公會可取得更高的得分。");
                npc.id(9000233).next().say("\r\n你的旗幟爭奪戰分數會是當週最高的紀錄。如果不滿意現在的紀錄，可以隨時再次進行挑戰。當然，僅限於開放的時候。");
                npc.id(9000233).next().say("\r\n對了，退出公會或是被驅逐時，自身當週最高紀錄將會被初始化，加總的分數也會相應減少，所以一定要小心。");
                npc.id(9000233).say("\r\n另外，記錄並不是永遠的。因為每週一晚上12點將重置所有點數與貴族技能，並在重置前套用合計的公會得分來提供貴族技能SP。別因為這週失敗就太失望。");
                break;
        case 3:
                npc.id(9000233).say("\r\n嗯。要做什麼、不做什麼是你的自由。");
                break;
        case 4:
                npc.id(9000233).next().say("\r\n現在在旗幟爭奪戰中，可獲得的旗幟爭奪戰分數取決於跑完一圈所需的時間。與別人無關，只要你跑得好，就能得到高分。");
                npc.id(9000233).next().say("\r\n公會得分只會反映你一週內的最高紀錄。因為可創下更高紀錄來刷新紀錄，如果覺得紀錄很令人遺憾就重新挑戰吧。");
                npc.id(9000233).next().say("\r\n最後，旗幟爭奪戰賽道會在每週一0點更換。每個賽道的分數基準都不盡相同，記得確認後，聰明的奔跑。");
                npc.id(9000233).next().say("\r\n#e[以白晝的雪原點數為準]#n\r\n\r\n未滿44秒 : #b#e1,000點#n#k\r\n未滿44秒 ~ 46秒 : #b#e800點#n#k\r\n未滿46秒 ~ 48秒 : #b#e650點#n#k\r\n未滿48秒 ~ 50秒 : #b#e550點#n#k\r\n未滿50秒 ~ 52秒 : #b#e450點#n#k\r\n未滿52秒 ~ 54秒 : #b#e400點#n#k\r\n未滿54秒 ~ 56秒 : #b#e350點#n#k\r\n未滿56秒 ~ 58秒 : #b#e300點#n#k\r\n未滿58秒 ~ 1分 1秒 : #b#e250點#n#k\r\n未滿1分 1秒 ~ 1分 4秒 : #b#e200 點#n#k\r\n1分 4秒以上 : #b#e100 點#n#k");
                npc.id(9000233).next().say("\r\n#e[以夕陽的雪原點數為準]#n\r\n\r\n未滿37秒 : #b#e1,000點#n#k\r\n未滿37秒 ~ 39秒 : #b#e800點#n#k\r\n未滿39秒 ~ 41秒 : #b#e650點#n#k\r\n未滿41秒 ~ 43秒 : #b#e550點#n#k\r\n未滿43秒 ~ 45秒 : #b#e450點#n#k\r\n未滿45秒 ~ 47秒 : #b#e400點#n#k\r\n未滿47秒 ~ 49秒 : #b#e350點#n#k\r\n未滿49秒 ~ 51秒 : #b#e300點#n#k\r\n未滿51秒 ~ 54秒 : #b#e250點#n#k\r\n未滿54秒 ~ 57秒 : #b#e200點#n#k\r\n57秒以上 : #b#e100點#n#k");
                npc.id(9000233).say("\r\n#e[以夜晚的雪原點數為準]#n\r\n\r\n未滿50秒 : #b#e1,000點#n#k\r\n未滿50秒 ~ 52秒 : #b#e800點#n#k\r\n未滿52秒 ~ 54秒 : #b#e650點#n#k\r\n未滿54秒 ~ 56秒 : #b#e550點#n#k\r\n未滿56秒 ~ 58秒 : #b#e450點#n#k\r\n未滿58秒 ~ 1分 : #b#e400點#n#k\r\n未滿1分 ~ 1分 2秒 : #b#e350點#n#k\r\n未滿1分 2秒 ~ 1分 4秒 : #b#e300點#n#k\r\n未滿1分 4秒 ~ 1分 7秒 : #b#e250點#n#k\r\n未滿1分 7秒 ~ 1分 10秒 : #b#e200點#n#k\r\n1分 10秒以上 : #b#e100 點#n#k");
                break;
}