// Created by MetaMS

let flag = true;
while (flag) {
        let selection = npc.id(2010008).askMenu("\r\n有疑問就儘管問我吧。\r\n\r\n#L0# #b有關<公會系統>。#k#l\r\n#L1# #b有關<貢獻度和名聲值>。#k#l\r\n#L2# #b有關<加入公會宣傳>。#k#l\r\n#L7# #b想要了解<週公會任務>。#k#l\r\n#L3# #b有關<每週公會排名與獎勵>。#k#l\r\n#L6# #b請告訴我關於<公會技能>的事。#k#l\r\n#L4# #b有關<公會會員管理與公會長委任>。#k#l\r\n#L5# #b說明就聽到這裡了。#k#l\r\n");
        switch (selection) {
                case 0:
                        npc.id(2010008).next().say("\r\n你想了解#b#e<公會系統>#k#n嗎？\r\n我說明給你聽。");
                        npc.id(2010008).next().say("\r\n#e<公會>#n是彼此出於相同目的而成立的聚會，透過公會總部的正式登記被正式認可。");
                        npc.id(2010008).next().say("\r\n公會會員透過參與各種公會專用內容，積累貢獻度，一起提升公會等級。\r\n公會升級時，可獲得固定的公會SP，還可使用它獲得新的公會技能！");
                        break;
                case 1:
                        npc.id(2010008).next().say("\r\n有關#b#e<貢獻度和名聲值>#k#n的詳細說明。");
                        npc.id(2010008).next().say("\r\n累積公會會員的#b貢獻度#k的同時也會累積代表公會經驗值的#b名聲值#k。\r\n累積名聲值後可將公會提升到最大#b30等級#k。");
                        npc.id(2010008).next().say("\r\n公會達成30等所需要的名譽值全數獲得時，無法再獲得名譽值。\r\n不過#b會反映到週名譽值排名#k，#bGP也是可以#k獲得的。\r\n但超過GP擁有限制時無法再累積。");
                        npc.id(2010008).next().say("\r\n#b個人貢獻#k無論公會等級如何#b都可以持續獲得#k。\r\n");
                        break;
                case 2:
                        npc.id(2010008).next().say("\r\n有關#b#e<加入公會宣傳>#k#n的說明。\r\n");
                        npc.id(2010008).next().say("\r\n你想積極招募新的公會會員嗎？\r\n那就使用加入公會宣傳功能吧。");
                        npc.id(2010008).next().say("\r\n在公會資訊中點擊#b加入設定鍵#k，即可使用#b加入公會宣傳#k功能。\r\n消耗一定的GP後進行加入宣傳時，會以藍色加強顯示於招募中的公會清單上方。");
                        npc.id(2010008).next().say("\r\n在多個公會進行加入宣傳時，加入宣傳時間越少的公會將顯示在上方。");
                        break;
                case 7:
                        npc.id(2010008).next().say("想要了解\r\n#b#e<週公會任務>#k#n嗎？");
                        npc.id(2010008).next().say("\r\n週公會任務在加入公會的狀態下擊殺等級範圍怪物、週BOSS來自動執行。\r\n透過擊殺等級範圍怪物累積#b狩獵點數#k，透過擊殺週BOSS累積#bBOSS點數#k。\r\n還有每累積5,000狩獵點數，或是80 BOSS點數可獲得#b週公會任務點數#k1個。");
                        npc.id(2010008).next().say("\r\n#b狩獵點數#k每擊殺1隻等級範圍怪物獲得1點。\r\n#bBOSS點數#k會依照每週BOSS置入的點數不同，基準如下。");
                        npc.id(2010008).next().say("\r\n#b#e<BOSS點數提供基準>#n#k\r\n - #r簡單西格諾斯#k :#b5#k BOSS點數\r\n - #r困難希拉#k :#b5#k BOSS點數\r\n - #r混沌皮卡啾#k :#b5#k BOSS點數\r\n - #r普通西格諾斯#k :#b5#k BOSS點數\r\n - #r混沌殘暴炎魔#k :#b10#k BOSS點數\r\n - #r混沌比艾樂#k :#b10#k BOSS點數\r\n - #r混沌斑斑#k :#b10#k BOSS點數\r\n - #r混沌血腥女王#k :#b10#k BOSS點數\r\n - #r普通濃姬#k : #b10#k Boss點數\r\n - #r困難梅格耐斯#k :#b20#k BOSS點數\r\n - #r混沌貝倫#k :#b20#k BOSS點數\r\n - #r混沌拉圖斯#k :#b30#k BOSS點數\r\n - #r普通史烏#k :#b30#k BOSS點數\r\n - #r普通戴米安#k :#b30#k BOSS點數\r\n - #r普通守護天使綠水靈:#b30#k BOSS點數\r\n - #r簡單露希妲#k :#b30#k BOSS點數\r\n - #r簡單 威爾#k :#b30#k Boss點數\r\n - #r普通露希妲#k :#b40#k BOSS點數\r\n - #r普通威爾#k :#b40#k BOSS點數\r\n - #r普通戴斯克#k :#b40#k BOSS點數\r\n - #r普通頓凱爾#k :#b40#k BOSS點數\r\n - #r困難史烏#k :#b60#k BOSS點數\r\n - #r困難戴米安#k :#b60#k BOSS點數\r\n - #r困難露希妲#k :#b60#k BOSS點數\r\n - #r困難威爾#k :#b60#k BOSS點數\r\n - #r普通真‧希拉#k :#b60#k Boss點數\r\n - #r混沌守護天使綠水靈:#b65#k BOSS點數\r\n - #r混沌戴斯克#k :#b70#k BOSS點數\r\n - #r困難頓凱爾#k :#b70#k BOSS點數\r\n - #r困難 真‧希拉#k :#b70#k Boss點數\r\n - #r普通受選的賽蓮#k :#b70#k Boss點數\r\n - #r監視者卡洛斯(簡單)#k：#b80#k Boss點數\r\n - #r咖凌(簡單)#k：#b80 #kBoss點數\r\n - #r困難受選的賽蓮#k : #b80 #kBoss點數\r\n - #r監視者卡洛斯(普通)#k：#b80 #kBoss點數\r\n - #r普通咖凌#k：#b80 #kBoss點數\r\n - #r監視者卡洛斯(混沌)#k：#b80 #kBoss點數\r\n - #r咖凌(困難)#k：#b80 #kBoss點數\r\n - #r終極受選的賽蓮#k：#b80 #kBoss點數\r\n - #r監視者卡洛斯(終極)#k：#b80 #kBoss點數\r\n - #r咖凌(終極)#k：#b80 #kBoss點數\r\n#k");
                        npc.id(2010008).next().say("\r\n最後，#b週公會任務點數#k用哪一種點數累積，每個角色最多只能累積5點。\r\n再來，離開公會或被驅逐的角色週公會任務相關點數會初始化並從離開的公會的週公會任務點數扣除，請留意！");
                        break;
                case 3:
                        npc.id(2010008).next().say("\r\n想知道有關#b#e<每週公會排名與獎勵>#k#n的內容嗎？");
                        npc.id(2010008).next().say("\r\n提供每週獲得名聲值排行、每週旗幟爭奪戰、每週地下水道排行。");
                        npc.id(2010008).next().say("\r\n#b#e<公會週排名及獎勵>#k#n\r\n\r\n週獲得名譽值排名會依照公會在一週獲得的名譽值為基準設定排名。");
                        npc.id(2010008).next().say("\r\n旗幟爭奪戰和地下水道會依照每週獲得的點數決定排名，旗幟爭奪戰依照公會分數發放貴族SP；地下水道依照公會排名發放貴族SP。\r\n不過，退出公會或被驅逐之角色的分數會在公會分數中減少，請多加注意。");
                        npc.id(2010008).next().say("\r\n再來，會按照公會的週任務點數達成率追加提供貴族SP。");
                        npc.id(2010008).next().say("\r\n#b#e<旗幟爭奪戰每週獎勵>#n#k\r\n - #r10,000分以上#k：#b10#k貴族SP\r\n - #r9,000分以上#k：#b9#k貴族SP\r\n - #r8,000分以上#k：#b8#k貴族SP\r\n - #r7,000分以上#k：#b7#k貴族SP\r\n - #r6,000分以上#k：#b6#k貴族SP\r\n - #r5,000分以上#k：#b5#k貴族SP\r\n - #r4,000分以上#k：#b4#k貴族SP\r\n - #r3,000分以上#k：#b3#k貴族SP\r\n - #r2,000分以上#k：#b2#k貴族SP\r\n - #r1,000分以上#k：#b1#k貴族SP\r\n#k\r\n旗幟爭奪戰每週獎勵與排名無關，依照每週公會分數發放。");
                        npc.id(2010008).next().say("\r\n#b#e<地下水道每週獎勵>#n#k\r\n -#r第1名#k：#b40#k貴族SP\r\n -#r第2名#k：#b38#k貴族SP\r\n -#r第3名#k：#b36#k貴族SP\r\n - #r第4名～ 第5名#k：#b34#k貴族SP\r\n - #r第6名～ 第10名#k：#b32#k貴族SP\r\n - #r5%以內#k：#b29#k 貴族SP\r\n - #r6～10%以內#k：#b27#k貴族SP\r\n - #r11～15%以內#k：#b25#k貴族SP\r\n - #r16～20%以內#k：#b23#k貴族SP\r\n - #r21～25%以內#k：#b21#k貴族SP\r\n - #r26～30%以內#k：#b19#k貴族SP\r\n - #r31～40%以內#k：#b17#k貴族SP\r\n - #r41～60%以內#k：#b15#k貴族SP\r\n - #r61～80%以內#k：#b13#k貴族SP\r\n - #r目標達成獎勵(獲得500點以上)#k：#b10#k貴族SP\r\n#k\r\n沒有獲得500點數以上的話，即便在排名內也無法獲得獎勵。");
                        npc.id(2010008).next().say("\r\n#b#e<週公會任務獎勵>#n#k\r\n - #r200點數以上#k :#b10#k 貴族SP\r\n - #r180點數以上#k :#b9#k 貴族SP\r\n - #r160點數以上#k :#b8#k 貴族SP\r\n - #r140點數以上#k :#b7#k 貴族SP\r\n - #r120點數以上#k :#b6#k 貴族SP\r\n - #r100點數以上#k :#b5#k 貴族SP\r\n - #r80點數以上#k :#b4#k 貴族SP\r\n - #r60點數以上#k :#b3#k 貴族SP\r\n - #r40點數以上#k :#b2#k 貴族SP\r\n - #r20點數以上#k :#b1#k 貴族SP\r\n#k");
                        break;
                case 6:
                        npc.id(2010008).next().say("\r\n您想知道關於#b#e<公會技能>#k#n的事嗎？");
                        npc.id(2010008).next().say("\r\n每次公會等級提升時都可以獲得SP，\r\n使用#b具有公會技能管理權限的公會成員#k獲得的SP可提升#b技能等級#k。\r\n另外，可根據公會成員的職位賦予#b主動公會技能使用權限#k。");
                        npc.id(2010008).next().say("\r\n使用公會技能的必要條件可透過技能提示確認，\r\n技能的冷卻時間會#b依據個人狀況套用#k，#b在冷卻時間尚未結束的狀態下，即使技能等級增加，冷卻時間也不會立即減少。#k");
                        break;
                case 4:
                        npc.id(2010008).next().say("\r\n你想知道有關#b#e<公會會員管理與公會長委任>#k#n的內容嗎？");
                        npc.id(2010008).next().say("\r\n公會長可在公會UI點擊#b職位設定鍵#k設定公會會員的職位權限。\r\n擁有管理權限後，即可調整其他公會會員的職位。只能變更低於自己的職位，同一職位內不可變更。");
                        npc.id(2010008).next().say("\r\n因為公會長很久沒有上線，所以很難經營公會嗎？\r\n去找<英雄殿堂>的海拉格，就能#b強制變更公會長#k了。");
                        npc.id(2010008).next().say("\r\n公會長超過#b30天#k未上線時，就能強制委任公會長，並#b按照職位順序#k將有資格成為公會長。比自己高職位的公會會員都超過30天未上線時，一般公會會員也能成為公會長。");
                        break;
                case 5:
                        flag = false;
                        break;
        }
}