var itemlistall = Array(
    [5130000,3000]//护身符
    ,[2049750,1000]//S级潜能附加卷轴 80%]
    ,[2048306,1000]//特殊附加潜能附加古卷
    ,[5570000,1000]//金锤子
    ,[2049323,5000]//高级装备强化卷轴
    ,[5551000,5000]//伤害皮肤扩充券
    ,[2049509,1000]//"金色刻印的印章"),
    ,[2048301,1000]//"金光潜能附加印章"),
    ,[2501000,1000]//能力点初始化卷轴
    ,[2500000,1000]//技能点初始化卷轴
    ,[5133000,1000]//超级复活药水
    ,[5511001,1000]//复仇女神的水
    ,[5062800,2000]//神奇还原器
    ,[2702000,1500]//内在能力还原器
    ,[5537000,6000]//怪怪卡牌包
    ,[5743003,3000]//怪怪卡牌包
    ,[2590030,8000]//强化型灵魂附魔石
    // ,[2434174,10000]//随机灵魂结晶
    ,[5044011,100000,7*24 * 60 * 60 * 1000]
);
module.exports = {
  itemlistall: itemlistall
};



