
const itemlistall = Array(
    
    [2636844, 60, 4],//	潁河
    [2023125, 10, 4],//	極限紅
    [2023126, 10, 4],//	極限綠
    [2023127, 10, 4],//	極限藍
    [2023128, 10, 4],//	極限金
    [2004019, 5, 4],//	力量
    [2004039, 5, 4],//	敏捷
    [2004059, 5, 4],//	智力
    [2004079, 5, 4],//	運氣
    [1004422, 30, 4, -1],//	埃蘇萊布斯騎士頭盔
    [1052882, 30, 4, -1],//	埃蘇萊布斯騎士套裝
    [1073030, 30, 4, -1],//	埃蘇萊布斯騎士鞋
    [1082636, 30, 4, -1],//	埃蘇萊布斯騎士手套
    [1102775, 30, 4, -1],//	埃蘇萊布斯騎士披風
    [1152174, 30, 4, -1],//	埃蘇萊布斯騎士護肩
    [1004423, 30, 4, -1],//	埃蘇萊布斯法師帽
    [1052887, 30, 4, -1],//	埃蘇萊布斯魔法師套裝
    [1073032, 30, 4, -1],//	埃蘇萊布斯法師鞋
    [1082637, 30, 4, -1],//	埃蘇萊布斯法師手套
    [1102794, 30, 4, -1],//	埃蘇萊布斯魔法師披風
    [1152176, 30, 4, -1],//	埃蘇萊布斯法師護肩
    [1004424, 30, 4, -1],//	埃蘇萊布斯弓箭手帽
    [1052888, 30, 4, -1],//	埃蘇萊布斯弓箭手套裝
    [1073033, 30, 4, -1],//	埃蘇萊布斯弓箭手鞋
    [1082638, 30, 4, -1],//	埃蘇萊布斯弓箭手手套
    [1102795, 30, 4, -1],//	埃蘇萊布斯弓箭手披風
    [1152177, 30, 4, -1],//	埃蘇萊布斯弓箭手護肩
    [1004425, 30, 4, -1],//	埃蘇萊布斯飛俠帽
    [1052889, 30, 4, -1],//	埃蘇萊布斯飛俠套裝
    [1073034, 30, 4, -1],//	埃蘇萊布斯飛俠鞋
    [1082639, 30, 4, -1],//	埃蘇萊布斯飛俠手套
    [1102796, 30, 4, -1],//	埃蘇萊布斯飛俠披風
    [1152178, 30, 4, -1], //	埃蘇萊布斯飛俠護肩
    [1004426, 30, 4, -1],//	埃蘇萊布斯海盜帽
    [1052890, 30, 4, -1],//	埃蘇萊布斯海盜套裝
    [1073035, 30, 4, -1],//	埃蘇萊布斯海盜鞋
    [1082640, 30, 4, -1],//	埃蘇萊布斯海盜手套
    [1102797, 30, 4, -1],//	埃蘇萊布斯海盜披風
    [1152179, 30, 4, -1]//	埃蘇萊布斯海盜護肩
    // ["高級機器人", 200, 2] // 高級機器人
);
module.exports = {
  itemlistall: itemlistall
};
