/*
裝備出售 zsf
 */

var head = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n";
var icon = "#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0#";
let log = require('check_log');
var text;
var inventoryType = 1;
var deleteSlot;
var deleteQuantity;
var typed = 0;
var beDeletedArr = new Array();
var listq = Array(
    2, 5, 20
);
var itemq = 0;


const list = [
    [1152174, 30],	//埃蘇萊布斯騎士護肩
    [1152176, 30],	//埃蘇萊布斯法師護肩
    [1152177, 30],	//埃蘇萊布斯弓箭手護肩
    [1152178, 30],	//埃蘇萊布斯飛俠護肩
    [1152179, 30],	//埃蘇萊布斯海盜護肩
    [1004422, 30],	//埃蘇萊布斯騎士頭盔
    [1004423, 30],	//埃蘇萊布斯法師帽
    [1004424, 30],	//埃蘇萊布斯弓箭手帽
    [1004425, 30],	//埃蘇萊布斯飛俠帽
    [1004426, 30],	//埃蘇萊布斯海盜帽
    [1102775, 30],	//埃蘇萊布斯騎士披風
    [1102794, 30],	//埃蘇萊布斯魔法師披風
    [1102795, 30],	//埃蘇萊布斯弓箭手披風
    [1102796, 30],	//埃蘇萊布斯飛俠披風
    [1102797, 30],	//埃蘇萊布斯海盜披風
    [1082636, 30],	//埃蘇萊布斯騎士手套
    [1082637, 30],	//埃蘇萊布斯法師手套
    [1082638, 30],	//埃蘇萊布斯弓箭手手套
    [1082639, 30],	//埃蘇萊布斯飛俠手套
    [1082640, 30],	//埃蘇萊布斯海盜手套
    [1052882, 30],	//埃蘇萊布斯騎士套裝
    [1052887, 30],	//埃蘇萊布斯魔法師套裝
    [1052888, 30],	//埃蘇萊布斯弓箭手套裝
    [1052889, 30],	//埃蘇萊布斯飛俠套裝
    [1052890, 30],	//埃蘇萊布斯海盜套裝
    [1073030, 30],	//埃蘇萊布斯騎士鞋
    [1073032, 30],	//埃蘇萊布斯法師鞋
    [1073033, 30],	//埃蘇萊布斯弓箭手鞋
    [1073034, 30],	//埃蘇萊布斯飛俠鞋
    [1073035, 30],	//埃蘇萊布斯海盜鞋
    [1213017, 50],	//AS調諧器
    [1292017, 50],	//埃蘇萊布斯怪扇
    [1592019, 50],	//埃蘇萊布斯遠古弓
    [1412177, 50],	//埃蘇萊布斯大斧
    [1312199, 50],	//埃蘇萊布斯戰斧
    [1302333, 50],	//埃蘇萊布斯軍刀
    [1542108, 50],	//埃蘇萊布斯武士刀
    [1442268, 50],	//埃蘇萊布斯巨靈開山斧
    [1322250, 50],	//埃蘇萊布斯戰錘
    [1422184, 50],	//埃蘇萊布斯大鎚
    [1432214, 50],	//埃蘇萊布斯穿透矛
    [1232109, 50],	//埃蘇萊布斯亡命劍
    [1402251, 50],	//埃蘇萊布斯寬大刀
    [1582017, 50],	//埃蘇萊布斯雷神
    [1262017, 50],	//埃蘇萊布斯ESP限制器
    [1212115, 50],	//埃蘇萊布斯雙頭杖
    [1552110, 50],	//埃蘇萊布斯扇子
    [1252093, 50],	//埃蘇萊布斯魔法棒
    [1382259, 50],	//埃蘇萊布斯長杖
    [1372222, 50],	//埃蘇萊布斯短杖
    [1522138, 50],	//埃蘇萊布斯雙弩槍
    [1214017, 50],	//埃蘇萊布斯龍息臂箭
    [1452252, 50],	//埃蘇萊布斯弓
    [1462239, 50],	//埃蘇萊布斯弩
    [1242116, 50],	//埃蘇萊布斯能量劍
    [1242120, 50],	//埃蘇萊布斯能量劍
    [1362135, 50],	//埃蘇萊布斯摺疊手杖
    [1472261, 50],	//埃蘇萊布斯復讎斗拳
    [1332274, 50],	//埃蘇萊布斯屠龍斬
    [1342101, 50],	//埃蘇萊布斯之刃
    [1482216, 50],	//埃蘇萊布斯拳甲
    [1492231, 50],	//埃蘇萊布斯槍
    [1222114, 50],	//埃蘇萊布斯靈魂手銃
    [1532144, 50],	//埃蘇萊布斯大炮
    [1272016, 50],	//埃蘇萊布斯鎖鏈
    [1282016, 50],	//埃蘇萊布斯魔力手套
    [1213017, 50],	//埃蘇萊布斯調諧器
    [1404017, 50],	//埃蘇萊布斯環
    [4310217, 50],	//埃蘇萊布斯調諧器
	[1403028, 50],	//埃蘇萊布斯調諧器
    [1004812, 4500], //神秘之影海盜帽
    [1004811, 4500], //神秘之影飛俠帽
    [1004810, 4500], //神秘之影弓箭手帽
    [1004809, 4500], //神秘之影法師帽
    [1004808, 4500], //神秘之影戰士帽
    [1053067, 4500], //神秘之影海盜套裝
    [1053066, 4500], //神秘之影飛俠套裝
    [1053065, 4500], //神秘之影弓箭手套裝
    [1053064, 4500], //神秘之影法師套裝
    [1053063, 4500], //神秘之影戰士套裝
    [1152200, 4500], //神秘之影海盜護肩
    [1152199, 4500], //神秘之影飛俠護肩
    [1152198, 4500], //神秘之影弓箭手護肩
    [1152197, 4500], //神秘之影法師護肩
    [1152196, 4500], //神秘之影戰士護肩
    [1082699, 4500], //神秘之影海盜手套
    [1082698, 4500], //神秘之影飛俠手套
    [1082697, 4500], //神秘之影弓箭手手套
    [1082696, 4500], //神秘之影法師手套
    [1082695, 4500], //神秘之影戰士手套
    [1102944, 4500], //神秘之影海盜披風
    [1102943, 4500], //神秘之影飛俠披風
    [1102942, 4500], //神秘之影弓箭手披風
    [1102941, 4500], //神秘之影法師披風
    [1102940, 4500], //神秘之影戰士披風
    [1073162, 4500], //神秘之影海盜鞋
    [1073161, 4500], //神秘之影飛俠鞋
    [1073160, 4500], //神秘之影弓箭手鞋
    [1073159, 4500], //神秘之影法師鞋
    [1073158, 4500], //神秘之影戰士鞋
	[1403018, 9000],
    [1214018, 9000],
    [1213018, 9000],
    [1292018, 9000],
    [1592020, 9000],  //- 神秘之影雙頭杖 等級要求：200
    [1212120, 9000],  //- 神秘之影雙頭杖 等級要求：200
    [1222113, 9000],  //- 神秘之影靈魂手銃 等級要求：200
    [1232113, 9000],  //- 神秘之影亡命劍 等級要求：200
    [1242121, 9000],  //- 神秘之影能量劍 等級要求：200
    [1242122, 9000],  //- 神秘之影能量劍 等級要求：200
    [1252098, 9000],  //- 神秘之影魔法槌 等級要求：200
    [1262039, 9000],  //- 神秘之影ESP限制器 等級要求：20
    [1302343, 9000],  //- 神秘之影單手劍 等級要求：200
    [1312203, 9000],  //- 神秘之影斧 等級要求：200
    [1322255, 9000],  //- 神秘之影錘 等級要求：200
    [1332279, 9000],  //- 神秘之影匕首 等級要求：200
    [1342104, 9000],  //- 神秘之影刃 等級要求：200
    [1362140, 9000],  //- 神秘之影手杖 等級要求：200
    [1372228, 9000],  //- 神秘之影短杖 等級要求：200
    [1382265, 9000],  //- 神秘之影長杖 等級要求：200
    [1402259, 9000],  //- 神秘之影雙手劍 等級要求：200
    [1412181, 9000],  //- 神秘之影雙手戰斧 等級要求：200
    [1422189, 9000],  //- 神秘之影雙手錘 等級要求：200
    [1432218, 9000],  //- 神秘之影長槍 等級要求：200
    [1442274, 9000],  //- 神秘之影矛 等級要求：200
    [1452257, 9000],  //- 神秘之影弓 等級要求：200
    [1462243, 9000],  //- 神秘之影弩 等級要求：200
    [1472265, 9000],  //- 神秘之影拳套 等級要求：200
    [1482221, 9000],  //- 神秘之影指節 等級要求：200
    [1492235, 9000],  //- 神秘之影短槍 等級要求：200
    [1522143, 9000],  //- 神秘之影雙弩槍 等級要求：200
    [1532150, 9000],  //- 神秘之影攻城炮 等級要求：200
    [1542117, 9000],  //- 神秘之影武士刀 等級要求：200
    [1552119, 9000],  //-  神秘之影摺扇  等級要求：200
    [1582023, 9000],  //- 神秘之影機甲槍 等級要求：200
    [1272017, 9000],  //- 神秘之影鎖鏈 等級要求：200
    [1282017, 9000],  //- 神秘之影魔力手套 等級要求：200
    [1404018, 9000]  //- 神秘之影環刃
];
const itemList = [
    1152174,	//埃蘇萊布斯騎士護肩
    1152176,	//埃蘇萊布斯法師護肩
    1152177,	//埃蘇萊布斯弓箭手護肩
    1152178,	//埃蘇萊布斯飛俠護肩
    1152179,	//埃蘇萊布斯海盜護肩
    1004422,	//埃蘇萊布斯騎士頭盔
    1004423,	//埃蘇萊布斯法師帽
    1004424,	//埃蘇萊布斯弓箭手帽
    1004425,	//埃蘇萊布斯飛俠帽
    1004426,	//埃蘇萊布斯海盜帽
    1102775,	//埃蘇萊布斯騎士披風
    1102794,	//埃蘇萊布斯魔法師披風
    1102795,	//埃蘇萊布斯弓箭手披風
    1102796,	//埃蘇萊布斯飛俠披風
    1102797,	//埃蘇萊布斯海盜披風
    1082636,	//埃蘇萊布斯騎士手套
    1082637,	//埃蘇萊布斯法師手套
    1082638,	//埃蘇萊布斯弓箭手手套
    1082639,	//埃蘇萊布斯飛俠手套
    1082640,	//埃蘇萊布斯海盜手套
    1052882,	//埃蘇萊布斯騎士套裝
    1052887,	//埃蘇萊布斯魔法師套裝
    1052888,	//埃蘇萊布斯弓箭手套裝
    1052889,	//埃蘇萊布斯飛俠套裝
    1052890,	//埃蘇萊布斯海盜套裝
    1073030,	//埃蘇萊布斯騎士鞋
    1073032,	//埃蘇萊布斯法師鞋
    1073033,	//埃蘇萊布斯弓箭手鞋
    1073034,	//埃蘇萊布斯飛俠鞋
    1073035,	//埃蘇萊布斯海盜鞋
    1213017, 	//AS調諧器
    1292017,	//埃蘇萊布斯怪扇
    1592019,	//埃蘇萊布斯遠古弓
    1412177,	//埃蘇萊布斯大斧
    1312199,	//埃蘇萊布斯戰斧
    1302333,	//埃蘇萊布斯軍刀
    1542108,	//埃蘇萊布斯武士刀
    1442268,	//埃蘇萊布斯巨靈開山斧
    1322250,	//埃蘇萊布斯戰錘
    1422184,	//埃蘇萊布斯大鎚
    1432214,	//埃蘇萊布斯穿透矛
    1232109,	//埃蘇萊布斯亡命劍
    1402251,	//埃蘇萊布斯寬大刀
    1582017,	//埃蘇萊布斯雷神
    1262017,	//埃蘇萊布斯ESP限制器
    1212115,	//埃蘇萊布斯雙頭杖
    1552110,	//埃蘇萊布斯扇子
    1252093,	//埃蘇萊布斯魔法棒
    1382259,	//埃蘇萊布斯長杖
    1372222,	//埃蘇萊布斯短杖
    1522138,	//埃蘇萊布斯雙弩槍
    1214017,	//埃蘇萊布斯龍息臂箭
    1452252,	//埃蘇萊布斯弓
    1462239,	//埃蘇萊布斯弩
    1242116,	//埃蘇萊布斯能量劍
    1242120,	//埃蘇萊布斯能量劍
    1362135,	//埃蘇萊布斯摺疊手杖
    1472261,	//埃蘇萊布斯復讎斗拳
    1332274,	//埃蘇萊布斯屠龍斬
    1342101,	//埃蘇萊布斯之刃
    1482216,	//埃蘇萊布斯拳甲
    1492231,	//埃蘇萊布斯槍
    1222114,	//埃蘇萊布斯靈魂手銃
    1532144,	//埃蘇萊布斯大炮
    1272016,	//埃蘇萊布斯鎖鏈
    1282016,	//埃蘇萊布斯魔力手套
    1213017,	// 埃蘇萊布斯調節器
    1404017, 	//埃蘇萊布斯環

    4310217, //神秘精華
	1403028,
    1004812, //神秘之影飛俠帽
    1004811, //神秘之影弓箭手帽
    1004810, //神秘之影法師帽
    1004809, //神秘之影戰士帽
    1004808, //神秘之影海盜套裝
    1053067, //神秘之影飛俠套裝
    1053066, //神秘之影弓箭手套裝
    1053065, //神秘之影法師套裝
    1053064, //神秘之影戰士套裝
    1053063, //神秘之影海盜護肩
    1152200, //神秘之影飛俠護肩
    1152199, //神秘之影弓箭手護肩
    1152198, //神秘之影法師護肩
    1152197, //神秘之影戰士護肩
    1152196, //神秘之影海盜手套
    1082699, //神秘之影飛俠手套
    1082698, //神秘之影弓箭手手套
    1082697, //神秘之影法師手套
    1082696, //神秘之影戰士手套
    1082695, //神秘之影海盜披風
    1102944, //神秘之影飛俠披風
    1102943, //神秘之影弓箭手披風
    1102942, //神秘之影法師披風
    1102941, //神秘之影戰士披風
    1102940, //神秘之影海盜鞋
    1073162, //神秘之影飛俠鞋
    1073161, //神秘之影弓箭手鞋
    1073160, //神秘之影法師鞋
    1073159, //神秘之影戰士鞋
    1073158,
	1403018,
    1214018,  //- 神秘之影雙頭杖 等級要求：200
    1213018,
    1292018,
    1592020,  //- 神秘之影雙頭杖 等級要求：200
    1212120,  //- 神秘之影靈魂手銃 等級要求：200
    1222113,  //- 神秘之影亡命劍 等級要求：200
    1232113,  //- 神秘之影能量劍 等級要求：200
    1242121,  //- 神秘之影能量劍 等級要求：200
    1242122,  //- 神秘之影魔法槌 等級要求：200
    1252098,  //- 神秘之影ESP限制器 等級要求：20
    1262039,  //- 神秘之影單手劍 等級要求：200
    1302343,  //- 神秘之影斧 等級要求：200
    1312203,  //- 神秘之影錘 等級要求：200
    1322255,  //- 神秘之影匕首 等級要求：200
    1332279,  //- 神秘之影刃 等級要求：200
    1342104,  //- 神秘之影手杖 等級要求：200
    1362140,  //- 神秘之影短杖 等級要求：200
    1372228,  //- 神秘之影長杖 等級要求：200
    1382265,  //- 神秘之影雙手劍 等級要求：200
    1402259,  //- 神秘之影雙手戰斧 等級要求：200
    1412181,  //- 神秘之影雙手錘 等級要求：200
    1422189,  //- 神秘之影長槍 等級要求：200
    1432218,  //- 神秘之影矛 等級要求：200
    1442274,  //- 神秘之影弓 等級要求：200
    1452257,  //- 神秘之影弩 等級要求：200
    1462243,  //- 神秘之影拳套 等級要求：200
    1472265,  //- 神秘之影指節 等級要求：200
    1482221,  //- 神秘之影短槍 等級要求：200
    1492235,  //- 神秘之影雙弩槍 等級要求：200
    1522143,  //- 神秘之影攻城炮 等級要求：200
    1532150,  //- 神秘之影武士刀 等級要求：200
    1542117,  //-  神秘之影摺扇  等級要求：200
    1552119,  //- 神秘之影機甲槍 等級要求：200
    1582023,  //- 神秘之影鎖鏈 等級要求：200
    1272017,  //- 神秘之影魔力手套 等級要求：200
    1282017,  //- 神秘之影魔力手套 等級要求：200
    1404018,  //- 神秘之影魔力手套 等級要求：200
];

function start() {
    const toDoList = [];
    let prize = 0;
    let price = 0;
    for (let i = 1; i <= 64; i++) {
        let item = stage.getItemBySlot(1, i);
        if (item == null || item.getAttribute() == 41) {
            continue;
        } else {
            let index = itemList.indexOf(item.getItemId());
            if (index != -1) {
                toDoList.push([list[index][0], list[index][1], i]);
            }
        }
    }

    // 詢問是否分解，分解后不可恢復
    let text = "#e#r#h0##k#n\r\n#k您好，歡迎來到綁定楓幣回收中心\r\n#r#e分解后不可恢復!\r\n";
    text += `本次可分解物品如下如下\r\n`;
    if (toDoList.length == 0) {
        text += `當前無可分解裝備#d#n\r\n`;
    } else {
        for (let i in toDoList) {
            text += `#L${i}##v${toDoList[i][0]}:i# 位置: ${toDoList[i][2]} #v4001714:i# x ${toDoList[i][1]}#l\r\n `;
        }
    }

    text += `\r\n\r\n#k#n回收價格表:\r\n`;
    for (let i in list) {
        text += "#v" + list[i][0] + ":i# #t" + list[i][0] + "# #r#e" + `[#v4001714:i# * ${list[i][1]}]` + `#n#k\r\n`;
    }
    let sel = npc.askMenu(text);
    let toSellItem = stage.getItemBySlot(1, toDoList[sel][2]);
    stage.showSystemMessage(toSellItem);
    stage.showSystemMessage(toDoList[sel][2]);
    if (toSellItem.getItemId() != toDoList[sel][0]) {
        npc.say("請重新選擇，物品信息有誤");
        return;
    } else {
        if (stage.getFreeSlot(2) < 3) {
            npc.say("請清理背包");
        } else if (npc.askYesNo(`是否分解該物品\r\n#v${toDoList[sel][0]}:i##z${toDoList[sel][0]}:i#位置: ${toDoList[sel][2]}\r\n回收價: #v4001714:i# * ${toDoList[sel][1]}`) == 1) {
            stage.removeItemBySlot(1, toDoList[sel][2]);
            stage.gainItem(4001714, toDoList[sel][1]);
            npc.say('分解成功');
        }
    }

    start();
}


start();