/*
 * Copyright (c) 2025. Lorem ipsum dolor sit amet, consectetur adipiscing elit.
 */


const PayUtils = require('constant/PayUtils');
Icon = [
    ["三角", "#fUI/StatusBar.img/base/iconMemo#"],
    ["獎盃", "#fUI/UIAchievement.img/achievement/pages/main/achievementForm/basic/difficultyIcon/unique#"],
    ["王冠", "#fUI/GuildMark/Mark/Etc/00009023/11#"],
    ["大鎚", "#fEffect/CharacterEff.img/MeisterEff/Equipment/10#"],
    ["翅膀", "#fEffect/ItemEff.img/1102982/effect/proneStab/1#"],
    ["奔跑", "#fEffect/ItemEff.img/1103020/effect/move/1#"],
    ["翅膀", "#fEffect/ItemEff.img/1102982/effect/default/4#"],
    ['方框', '#fUI/UIWindow.img/Item/New/inventory/0#'],
    ['方框', '#fUI/UIWindow.img/Item/activeExpChairIcon#'],
    ['確認', '#fUI/CashShop.img/CSCoupon/BtOK/normal/0#'],
    ['確認', '#fUI/CashShop.img/CSCoupon/BtOK/disabled/0#']
]
var date = new Date()
var dayAmount = new Date(date.getFullYear(), date.getMonth() + 1, 0).getDate() - date.getDate();

var money = [0, 388, 688];
var month = date.getMonth() + 1;

var bute = [10, 10, 10];

var group = [
    [0, 0, 0, 500],
    [0, 0, 1, 500],
    [0, 0, 2, 200000000],
    [0, 0, 3, 2637954, 2],
    [0, 0, 3, 5062500, 10],
    [0, 0, 3, 5062009, 10],
    [0, 0, 3, 2636883, 3],
    [0, 0, 3, 5062024, 5],
    [0, 1, 0, 500],
    [0, 1, 1, 500],
    [0, 1, 2, 200000000],
    [0, 1, 3, 2637954, 2],
    [0, 1, 3, 5062500, 10],
    [0, 1, 3, 5062009, 10],
    [0, 1, 3, 2636883, 3],
    [0, 1, 3, 5062024, 5],
    [0, 2, 0, 500],
    [0, 2, 1, 500],
    [0, 2, 2, 200000000],
    [0, 2, 3, 2637954, 2],
    [0, 2, 3, 5062500, 10],
    [0, 2, 3, 5062009, 10],
    [0, 2, 3, 2636883, 3],
    [0, 2, 3, 5062024, 5],
    [0, 3, 0, 500],
    [0, 3, 1, 500],
    [0, 3, 2, 200000000],
    [0, 3, 3, 2637954, 2],
    [0, 3, 3, 5062500, 10],
    [0, 3, 3, 5062009, 10],
    [0, 3, 3, 2636883, 3],
    [0, 3, 3, 5062024, 5],
    [0, 4, 0, 500],
    [0, 4, 1, 500],
    [0, 4, 2, 200000000],
    [0, 4, 3, 2637954, 2],
    [0, 4, 3, 5062500, 10],
    [0, 4, 3, 5062009, 10],
    [0, 4, 3, 2636883, 3],
    [0, 4, 3, 5062024, 5],
    [0, 4, 2, 600000000],
    [0, 5, 0, 500],
    [0, 5, 1, 500],
    [0, 5, 2, 200000000],
    [0, 5, 3, 2637954, 2],
    [0, 5, 3, 5062500, 10],
    [0, 5, 3, 5062009, 10],
    [0, 5, 3, 2636883, 5],
    [0, 5, 3, 5062024, 5],
    [0, 6, 0, 500],
    [0, 6, 1, 500],
    [0, 6, 2, 200000000],
    [0, 6, 3, 2637954, 2],
    [0, 6, 3, 5062500, 10],
    [0, 6, 3, 5062009, 10],
    [0, 6, 3, 2636883, 5],
    [0, 6, 3, 5062024, 5], ,
    [0, 7, 0, 500],
    [0, 7, 1, 500],
    [0, 7, 2, 200000000],
    [0, 7, 3, 2637954, 2],
    [0, 7, 3, 5062500, 10],
    [0, 7, 3, 5062009, 10],
    [0, 7, 3, 4009547, 20],
    [0, 7, 3, 5062024, 5],
    [0, 8, 0, 500],
    [0, 8, 1, 500],
    [0, 8, 2, 200000000],
    [0, 8, 3, 2637954, 2],
    [0, 8, 3, 5062500, 10],
    [0, 8, 3, 5062009, 10],
    [0, 8, 3, 4009547, 20],
    [0, 8, 3, 5062024, 5],
    [0, 9, 0, 500],
    [0, 9, 1, 500],
    [0, 9, 2, 200000000],
    [0, 9, 3, 2637954, 2],
    [0, 9, 3, 5062500, 10],
    [0, 9, 3, 5062009, 10],
    [0, 9, 3, 4009547, 20],
    [0, 9, 3, 5062024, 5],
    [0, 10, 0, 500],
    [0, 10, 1, 500],
    [0, 10, 2, 200000000],
    [0, 10, 3, 2632899, 1],
    [0, 10, 3, 2430026, 2],
    [0, 10, 3, 5062500, 10],
    [0, 10, 3, 5062009, 10],
    [0, 10, 3, 4009547, 20],
    [0, 10, 3, 5062024, 5],

    [1, 0, 0, 600],
    [1, 0, 1, 800],
    [1, 0, 2, 300000000],
    [1, 0, 3, 2048761, 1],
    [1, 0, 3, 2430026, 2],
    [1, 0, 3, 5062500, 15],
    [1, 0, 3, 5062009, 15],
    [1, 0, 3, 2636884, 3],
    [1, 0, 3, 5062024, 10],
    [1, 1, 0, 600],
    [1, 1, 1, 800],
    [1, 1, 2, 300000000],
    [1, 1, 3, 2048761, 1],
    [1, 1, 3, 2430026, 2],
    [1, 1, 3, 5062500, 15],
    [1, 1, 3, 5062009, 15],
    [1, 1, 3, 2636884, 3],
    [1, 1, 3, 5062024, 10],
    [1, 2, 0, 600],
    [1, 2, 1, 800],
    [1, 2, 2, 300000000],
    [1, 2, 3, 2048761, 1],
    [1, 2, 3, 2430026, 2],
    [1, 2, 3, 5062500, 15],
    [1, 2, 3, 5062009, 15],
    [1, 2, 3, 2636884, 3],
    [1, 2, 3, 5062024, 10],
    [1, 3, 0, 600],
    [1, 3, 1, 800],
    [1, 3, 2, 300000000],
    [1, 3, 3, 2048761, 1],
    [1, 3, 3, 2430026, 2],
    [1, 3, 3, 5062500, 15],
    [1, 3, 3, 5062009, 15],
    [1, 3, 3, 2636884, 3],
    [1, 3, 3, 5062024, 10],
    [1, 4, 0, 600],
    [1, 4, 1, 800],
    [1, 4, 2, 300000000],
    [1, 4, 3, 2048761, 1],
    [1, 4, 3, 2430026, 2],
    [1, 4, 3, 5062500, 15],
    [1, 4, 3, 5062009, 15],
    [1, 4, 3, 2636884, 3],
    [1, 4, 3, 5062024, 10],
    [1, 5, 0, 600],
    [1, 5, 1, 800],
    [1, 5, 2, 300000000],
    [1, 5, 3, 2048761, 2],
    [1, 5, 3, 2430026, 2],
    [1, 5, 3, 5062500, 15],
    [1, 5, 3, 5062009, 15],
    [1, 5, 3, 2636884, 3],
    [1, 5, 3, 5062024, 10],
    [1, 6, 0, 600],
    [1, 6, 1, 800],
    [1, 6, 2, 300000000],
    [1, 6, 3, 2048761, 2],
    [1, 6, 3, 2430026, 2],
    [1, 6, 3, 5062500, 15],
    [1, 6, 3, 5062009, 15],
    [1, 6, 3, 2636884, 3],
    [1, 6, 3, 5062024, 10],
    [1, 7, 0, 600],
    [1, 7, 1, 800],
    [1, 7, 2, 300000000],
    [1, 7, 3, 2048761, 2],
    [1, 7, 3, 2430026, 2],
    [1, 7, 3, 5062500, 15],
    [1, 7, 3, 5062009, 15],
    [1, 7, 3, 2636884, 3],
    [1, 7, 3, 5062024, 10],
    [1, 8, 0, 600],
    [1, 8, 1, 800],
    [1, 8, 2, 300000000],
    [1, 8, 3, 2048761, 2],
    [1, 8, 3, 2430026, 2],
    [1, 8, 3, 5062500, 15],
    [1, 8, 3, 5062009, 15],
    [1, 8, 3, 2636884, 3],
    [1, 8, 3, 5062024, 10],
    [1, 9, 0, 600],
    [1, 9, 1, 800],
    [1, 9, 2, 300000000],
    [1, 9, 3, 2048761, 2],
    [1, 9, 3, 2430026, 2],
    [1, 9, 3, 5062500, 15],
    [1, 9, 3, 5062009, 15],
    [1, 9, 3, 2636884, 3],
    [1, 9, 3, 5062024, 10],
    [1, 10, 0, 600],
    [1, 10, 1, 800],
    [1, 10, 2, 300000000],
    [1, 10, 3, 2637955, 1],
    [1, 10, 3, 2048761, 10],
    [1, 10, 3, 2430026, 5],
    [1, 10, 3, 5062500, 50],
    [1, 10, 3, 5062009, 50],
    [1, 10, 3, 2636884, 10],
    [1, 10, 3, 2439137, 1000],
    [1, 10, 3, 5062024, 50],

    [2, 0, 0, 800],
    [2, 0, 1, 1000],
    [2, 0, 2, 500000000],
    [2, 0, 3, 2048761, 2],
    [2, 0, 3, 2430027, 2],
    [2, 0, 3, 5062500, 20],
    [2, 0, 3, 5062009, 20],
    [2, 0, 3, 2636884, 5],
    [2, 0, 3, 5062024, 20],
    [2, 1, 0, 800],
    [2, 1, 1, 1000],
    [2, 1, 2, 500000000],
    [2, 1, 3, 2048761, 2],
    [2, 1, 3, 2430027, 2],
    [2, 1, 3, 5062500, 20],
    [2, 1, 3, 5062009, 20],
    [2, 1, 3, 2636884, 5],
    [2, 1, 3, 5062024, 20],
    [2, 2, 0, 800],
    [2, 2, 1, 1000],
    [2, 2, 2, 500000000],
    [2, 2, 3, 2048761, 2],
    [2, 2, 3, 2430027, 2],
    [2, 2, 3, 5062500, 20],
    [2, 2, 3, 5062009, 20],
    [2, 2, 3, 2636884, 5],
    [2, 2, 3, 5062024, 20],
    [2, 3, 0, 800],
    [2, 3, 1, 1000],
    [2, 3, 2, 500000000],
    [2, 3, 3, 2048761, 2],
    [2, 3, 3, 2430027, 2],
    [2, 3, 3, 5062500, 20],
    [2, 3, 3, 5062009, 20],
    [2, 3, 3, 2636884, 5],
    [2, 3, 3, 5062024, 20],
    [2, 4, 0, 800],
    [2, 4, 1, 1000],
    [2, 4, 2, 500000000],
    [2, 4, 3, 2048761, 2],
    [2, 4, 3, 2430027, 2],
    [2, 4, 3, 5062500, 20],
    [2, 4, 3, 5062009, 20],
    [2, 4, 3, 2636884, 5],
    [2, 4, 3, 5062024, 20],
    [2, 5, 0, 800],
    [2, 5, 1, 1000],
    [2, 5, 2, 500000000],
    [2, 5, 3, 2048761, 2],
    [2, 5, 3, 2430027, 2],
    [2, 5, 3, 5062500, 20],
    [2, 5, 3, 5062009, 20],
    [2, 5, 3, 2636884, 5],
    [2, 5, 3, 2637954, 5],
    [2, 5, 3, 2472000, 5],
    [2, 5, 3, 5062024, 20],
    [2, 6, 0, 800],
    [2, 6, 1, 1000],
    [2, 6, 2, 500000000],
    [2, 6, 3, 2048761, 2],
    [2, 6, 3, 2430027, 2],
    [2, 6, 3, 5062500, 20],
    [2, 6, 3, 5062009, 20],
    [2, 6, 3, 2636884, 5],
    [2, 6, 3, 2637954, 5],
    [2, 6, 3, 2472000, 5],
    [2, 6, 3, 5062024, 20],
    [2, 7, 0, 800],
    [2, 7, 1, 1000],
    [2, 7, 2, 500000000],
    [2, 7, 3, 2048761, 2],
    [2, 7, 3, 2430027, 2],
    [2, 7, 3, 5062500, 20],
    [2, 7, 3, 5062009, 20],
    [2, 7, 3, 2636884, 5],
    [2, 7, 3, 2637954, 5],
    [2, 7, 3, 2472000, 5],
    [2, 7, 3, 5062024, 20],
    [2, 8, 0, 800],
    [2, 8, 1, 1000],
    [2, 8, 2, 500000000],
    [2, 8, 3, 2048761, 2],
    [2, 8, 3, 2430027, 2],
    [2, 8, 3, 5062500, 20],
    [2, 8, 3, 5062009, 20],
    [2, 8, 3, 2636884, 5],
    [2, 8, 3, 2637954, 5],
    [2, 8, 3, 2472000, 5],
    [2, 8, 3, 5062024, 20],
    [2, 9, 0, 800],
    [2, 9, 1, 1000],
    [2, 9, 2, 500000000],
    [2, 9, 3, 2048761, 2],
    [2, 9, 3, 2430027, 2],
    [2, 9, 3, 5062500, 20],
    [2, 9, 3, 5062009, 20],
    [2, 9, 3, 2636884, 5],
    [2, 9, 3, 2637954, 5],
    [2, 9, 3, 2472000, 5],
    [2, 9, 3, 5062024, 20],
    [2, 10, 0, 800],
    [2, 10, 1, 1000],
    [2, 10, 2, 500000000],
    [2, 10, 3, 2636055, 1],
    [2, 10, 3, 2048761, 30],
    [2, 10, 3, 2430028, 5],
    [2, 10, 3, 5062500, 100],
    [2, 10, 3, 5062009, 100],
    [2, 10, 3, 2636884, 20],
    [2, 10, 3, 2637954, 20],
    [2, 10, 3, 2472000, 100],
    [2, 10, 3, 5062024, 100],

]
var judge = false;
var lv = 0;
const log = require('check_log');
CStart();

function CStart() {
    lv = Gicon(log.getEventValue(stage, db, "章-" + month + "-exp"));
    txt = "\t\t\t頑皮寶典　第 #r" + month + "#k 月\r\n";
    txt = "\t\t\t每日完成家務，組隊一條龍，仙樹，氣球以及在線480分鐘均可獲取經驗\r\n";
    txt += "寶典等級 #b" + lv[0] + " / 10\t\t#kEXP:#b" + log.getEventValue(stage, db, "章-" + month + "-exp") + " / " + lv[1] + "\t\t#k本期結束時間剩餘 #g" + dayAmount + "\r\n\r\n";
    txt += "#b#L0#普通寶典 - 免費　#k[ " + (log.getEventValue(stage, db, "第" + month + "章-普通") > 0 ? "#g已解鎖#k" : "#r尚未解鎖#k ") + " ]#l" + (log.getEventValue(stage, db, "第" + month + "章-普通") > 0 ? "" : "\t#d#L996#解鎖當前模式#l") + "\r\n";
    txt += "#r#L1#閃耀寶典388寶典幣　#k[ " + (log.getEventValue(stage, db, "第" + month + "章-閃耀") > 0 ? "#g已解鎖#k" : "#r尚未解鎖#k ") + " ]#l" + (log.getEventValue(stage, db, "第" + month + "章-閃耀") > 0 ? "" : "\t#d#L997#解鎖當前模式#l") + "\r\n";
    txt += "#g#L2#炫彩寶典688寶典幣　#k[ " + (log.getEventValue(stage, db, "第" + month + "章-炫彩") > 0 ? "#g已解鎖#k" : "#r尚未解鎖#k ") + " ]#l" + (log.getEventValue(stage, db, "第" + month + "章-炫彩") > 0 ? "" : "\t#d#L998#解鎖當前模式#l") + "\r\n";
    sel = npc.askMenu(txt);
    switch (sel) {
        case 996:
        case 997:
        case 998:
            var haveMonsy = parseInt(Gmoney());
            if (haveMonsy < money[parseInt(sel - 996)]) {
                stage.dropAlertNotice("抱歉..你沒有 " + money[parseInt(sel - 996)] + " 星語點");
                return;
            }
            Umoney(-money[parseInt(sel - 996)]);
            log.addEventValue(stage, db, "第" + month + "章-" + (sel == 996 ? "普通" : sel == 997 ? "閃耀" : "炫彩"), 1, -1);
            stage.dropAlertNotice("解鎖成功");
            break;
        default:
            txt = "\t\t\t星語谷寶典　第 #r" + month + "#k 月\r\n";
            if (log.getEventValue(stage, db, "第" + month + "章-" + (sel == 0 ? "普通" : sel == 1 ? "閃耀" : "炫彩")) <= 0) {
                txt += "\t\t\t\t#r#e尚未解鎖#k#n\r\n";
            } else {
                judge = true;
                txt += "\t\t\t\t#r#e已解鎖#k#n\r\n";
            }
            txt += "\t#g#L9999#一鍵領當前寶典獎品#l#k\r\n";
            for (var i = 0; i <= bute[sel]; i++) {
                txt += "#L" + i + "##d第 #b" + month + "#d 章 Lv.#r" + marinstring(" ", 4, i.toString()) + "#d 獎品　" + (log.getEventValue(stage, db, month + "章-" + i + (sel == 0 ? "普通" : sel == 1 ? "閃耀" : "炫彩")) > 0 ? "#e#g√#k#n" : "#e#r×#k#n") + "#l\r\n";
            }
            url = npc.askMenu(txt);
            switch (url) {
                case 9999:
                    if (!judge) {
                        stage.dropAlertNotice("抱歉..尚未解鎖");
                        return;
                    }
                    var Sjudge = true;
                    for (var i in group) {
                        if (group[i][0] != sel) continue;
                        if (lv[0] < group[i][1]) {
                            stage.dropAlertNotice("寶典等級沒有達標");
                            Sjudge = false;
                            break;
                        }
                        ;
                        if (Sjudge) {
                            if (log.getEventValue(stage, db, month + "章-" + group[i][1] + (sel == 0 ? "普通" : sel == 1 ? "閃耀" : "炫彩")) > 0) continue;
                            switch (group[i][2]) {
                                case 0:

                                    PayUtils.gainPay(2, group[i][3], stage, db, '寶典', '')
                                    break;
                                case 1:
                                    stage.modifyCurrency(2, group[i][3]);
                                    break;
                                case 2:
                                    stage.gainMesos(group[i][3]);
                                    break;
                                case 3:
                                    stage.gainItem(group[i][3], group[i][4]);
                                    break;
                            }
                        }
                    }
                    for (var i = 0; i <= bute[sel]; i++) {
                        if (lv[0] >= i) {
                            log.addEventValue(stage, db, month + "章-" + i + (sel == 0 ? "普通" : sel == 1 ? "閃耀" : "炫彩"), 1, -1);
                        }
                    }
                    ;
                    stage.dropAlertNotice("恭喜，一鍵領取成功！");
                    break;

                default:
                    txt = "\t\t\t星語谷寶典　第 #r" + month + "#k 章\r\n";
                    txt += "\t\t\t\t#bLv.#r" + url + " #b獎品詳情\r\n\r\n";
                    for (var i in group) {
                        if (group[i][0] != sel) continue;
                        if (group[i][1] != url) continue;
                        switch (group[i][2]) {
                            case 0:
                                txt += "#g　樂　豆 #r" + group[i][3] + "\r\n";
                                break;
                            case 1:
                                txt += "#g　抵用卷 #r" + group[i][3] + "\r\n";
                                break;
                            case 2:
                                txt += "#g　金　幣 #r" + group[i][3] + "\r\n";
                                break;
                            case 3:
                                txt += "#g　道　具 #r#i" + group[i][3] + "##z" + group[i][3] + "# x #b" + group[i][4] + "\r\n";
                                break;
                        }
                    }
                    if (judge) {
                        npc.next().say(txt);
                    } else {
                        npc.say(txt);
                        return;
                    }

                    if (log.getEventValue(stage, db, month + "章-" + url + (sel == 0 ? "普通" : sel == 1 ? "閃耀" : "炫彩")) > 0) {
                        stage.dropAlertNotice("抱歉..該類型已領過了");
                        return;
                    }
                    if (lv[0] < url) {
                        stage.dropAlertNotice("抱歉..寶典等級沒有達標不能領該類型");
                        return;
                    }
                    for (var i in group) {
                        if (group[i][0] != sel) continue;
                        if (group[i][1] != url) continue;
                        switch (group[i][2]) {
                            case 0:
                                PayUtils.gainPay(2, group[i][3], player, player, '寶典', '')
                                break;
                            case 1:
                                stage.modifyCurrency(2, group[i][3]);
                                break;
                            case 2:
                                stage.gainMesos(group[i][3]);
                                break;
                            case 3:
                                stage.gainItem(group[i][3], group[i][4]);
                                break;
                        }
                    }
                    log.addEventValue(stage, db, month + "章-" + url + (sel == 0 ? "普通" : sel == 1 ? "閃耀" : "炫彩"), 1, -1);
                    stage.dropAlertNotice("恭喜，領取成功！");
                    break;
            }
            break;
    }
}

function Umoney(x) {
    if (x != 0) {
        stage.loseItem(4310250, x);
    }
    // return player.customSqlUpdate("UPDATE `accounts` SET `usedrmb` = usedrmb+" + x + " WHERE `id` = " + player.getAccountId() + ";")
}

function Gmoney() {
    return stage.getItemQuantity(4310250);
    // var ret = player.customSqlResult("SELECT `usedrmb` FROM `accounts` WHERE `id` = '" + player.getAccountId() + "' LIMIT 0,1;");
    // return ret.get(0).get("usedrmb");
}

function marinstring(charToFill, totalLength, originalString) {
    const lengthOfDoubleByteChars = (originalString.match(/[\u4E00-\u9FA5]/g) || []).length;
    const length = originalString.length + lengthOfDoubleByteChars;
    const charactersToFill = charToFill.repeat(totalLength - length);
    return originalString + charactersToFill;
}


function Gicon(x) {
    switch (true) {
        case x < 10:
            return [0, 10];
        case x >= 10 && x < 50:
            return [1, 50];
        case x >= 50 && x < 200:
            return [2, 200];
        case x >= 200 && x < 300:
            return [3, 300];
        case x >= 300 && x < 400:
            return [4, 400];
        case x >= 400 && x < 500:
            return [5, 500];
        case x >= 500 && x < 600:
            return [6, 600];
        case x >= 600 && x < 700:
            return [7, 700];
        case x >= 700 && x < 800:
            return [8, 800];
        case x >= 800 && x < 900:
            return [9, 900];
        case x >= 900 && x < 100000:
            return [10, 1000];


    }
}