// Created by MetaMS

let flag = true;
while (flag) {
        let sel = npc.id(9063069).askMenu("\r\n有任何疑問，儘管提出來吧~\r\n#L0#  告訴我有關#b#e<楓之谷時尚週>#n的事。#k#l\r\n#L1#  告訴我有關#b#e<禮券>#n的事。#k#l\r\n#L2#  告訴我有關#b#e<獎勵>#n的事。#k#l\r\n#L3#  告訴我有關#b#e<活動期間>#n的事。#k#l\r\n\r\n#L100# 沒有其他疑問了。#l");
        switch (sel) {
                case 0:
                        npc.id(9063069).next().say("#b#e楓之谷時尚週#n#k是#b#h0##k，還有為了滿足其它勇士的\r\n時尚感而舉辦的慶典！\r\n如果對#b恐怖陰森森#k時尚感興趣的話一定要參與哦~");
                        npc.id(9063069).next().say("#b#e毛骨悚然的衣架#n#k陳列著服裝，#b#e冷清的攤販#n#k陳列著臉部裝飾、騎寵、特效等，請參觀！");
                        break;
                case 1:
                        npc.id(9063069).next().say("#b萬聖貓禮券#k在#b萬聖貓的精品店#k販售的陰森森的時尚\r\n可用於兌換道具！");
                        npc.id(9063069).next().say("#b萬聖貓週#k 蓋上參加印章\r\n可獲得#b#e#i2636802# 萬聖貓禮券#n#k每天#b#e3張#n#k，\r\n請積極參與！\r\n\r\n#r#e※ 每日獎勵每個世界每天僅可獲得1次。\r\n#r#e※ 星期天獎勵獲得數量增加為2倍。");
                        npc.id(9063069).next().say("如果券不夠，\r\n#r等級範圍怪物#k偶爾會掉落\r\n收集#b#e#i2636801:# #t2636801:##n#k怎麼樣？\r\n\r\n#r※ 消滅等級範圍怪物，可依照既定機率獲得萬聖貓禮券交換券。\r\n#r※ 等級範圍怪物指的是以角色等級為基準#e-20級至+20級內#n的怪物。");
                        break;
                case 2:
                        npc.id(9063069).next().say("如果想參加#b#e楓之谷時尚週#n#k，請每天消滅#b#e等級範圍怪物#n#k#b#e1000隻#n#k！\r\n\r\n#r※ 等級範圍怪物指的是以角色等級為基準#e-20級至+20級內#n的怪物。");
                        npc.id(9063069).next().say("如果參加了卻沒得到獎勵，會很失望吧？\r\n每日每當蓋#b萬聖貓週#k參加印章時，\r\n就會給予#b#e#i2636802#萬聖貓禮券3張#n#k和\r\n#b#e#i2635907:# #t2635907:# 500個#n#k！\r\n\r\n#r#e※ 每日獎勵每個伺服器每天只能獲得1次。\r\n#r#e※ 星期天獎勵獲得數量增加2倍。");
                        npc.id(9063069).next().say("再加上！還有為了參與多次#b萬聖貓週#k#b的你#k所準備的#b#e特別獎勵#n#k~\r\n\r\n#r#e※ 根據世界內累計完成次數，獎勵每個楓之谷帳號僅可獲得1次。");
                        npc.id(9063069).next().say("#e<第1天累積獎勵>\r\n#b\r\n- #i2636146:# #t2636146:##n#k 10個\r\n\r\n#e<第2累積獎勵>\r\n#k#b\r\n- #i2450163:# #t2450163:##n#k 5個\r\n\r\n#k#e<第3天累積獎勵>\r\n#b\r\n- #i2633349:# #t2633349:##n#k 20個");
                        npc.id(9063069).next().say("#e<第4天累積獎勵>\r\n#b\r\n- #i2635907:# #t2635907:##n#k 1000個\r\n\r\n#k#e<第5天累積獎勵>\r\n#k#b\r\n- #i2433808:# #t2433808:##n#k 30個\r\n\r\n#k#e<第6天累積獎勵>\r\n#b\r\n- #i2634253:# #t2634253:##n#k 1個");
                        npc.id(9063069).next().say("#e<第7天累積獎勵>\r\n#b\r\n- #i2439869:# #t2439869:##n#k 100個\r\n\r\n#e<第8累積獎勵>\r\n#k#b\r\n- #i2048766:# #t2048766:##n#k 50個\r\n\r\n#k#e<第9天累積獎勵>\r\n#b\r\n- #i2632290:# #t2632290:##n#k 10個");
                        npc.id(9063069).next().say("#e<第10累積獎勵>\r\n#b\r\n- #i2636958:# #t2636958:##n#k 1個");
                        npc.id(9063069).next().say("所以請多多參與#b萬聖貓週#k~！");
                        break;
                case 3:
                        npc.id(9063069).next().say("#r#e[活動期間]#n\r\n - 2024年10月29日下午11點59分為止\r\n#r#e[萬聖貓的精品店期間]#n\r\n - 2024年10月29日下午11點59分為止");
                        npc.id(9063069).next().say("期限內萬聖貓特選！多看看時尚道具再走吧~");
                        break;
                case 100:
                        flag = false;
                        break;
        }
}