// Created by MetaMS

let flag = true;
while (flag) {
        let selection = npc.id(9402003).askMenu("有什麼好奇的嗎？\r\n\r\n#L0##b我想知道<煮出神祕靈藥>#k的進行方法。#l\r\n#L1##b我想瞭解藥材調配#k。#l\r\n#L2##b我想知道進行時間#k。#l\r\n#L3##b我想瞭解捐獻藥材#k。#l\r\n#L4#沒有其他疑問了。#l\r\n");
        switch (selection) {
                case  0:
                        npc.id(9402003).next().say("狩獵時獲得#b#i2638099:# #t2638099:##k和#b#i2638100:# #t2638100:##k後雙擊就能獲得各種藥材。");
                        npc.id(9402003).next().say("請參考下列的藥材種類。\r\n#fc0xFF662500#一般藥材：\r\n#i4037323:# #t4037323:#\r\n#i4037324:# #t4037324:#\r\n#i4037325:# #t4037325:#\r\n#i4037326:# #t4037326:#\r\n#i4037327:# #t4037327:#\r\n\r\n高級藥材：\r\n#i4037328:# #t4037328:#\r\n#i4037329:# #t4037329:#\r\n#i4037330:# #t4037330:#\r\n\r\n#fc0xFF009900#魔法藥材：\r\n#i4037331:# #t4037331:##k\r\n");
                        npc.id(9402003).next().say("一般藥材在組合台的每個欄位最多可放入#b5#k個，高級藥材在組合台的每個欄位最多可放入#b1#k個。");
                        npc.id(9402003).next().say("放入這些藥材熬煮，\r\n就能製作#fc0xFF662500##i2024236:# #t2024236:##k加持技能，\r\n有效期限為#r7天#k。");
                        npc.id(9402003).next().say("可以在有效期限未到期的狀態下重新製作新的靈藥，此時可比較目前套用中的靈藥和新製作的靈藥並進行調整。\r\n#r提醒您，靈藥從製作出來的瞬間起可使用7天，請注意。(有效期限不能超過活動截止時間)#k");
                        npc.id(9402003).next().say("那麼，祝你健康。");
                        break;
                case 1:
                        npc.id(9402003).next().say("所有的藥材都有各自的特性。\r\n組合時可獲得的效果數值分為#b最小值～基本值以下(30%)#k、#b基本值(60%)#k、#b基本值以上～最大值(10%)#k三種，其中隨機出現數值。另外，組合的藥材數量越多，效果越佳，即可獲得較高的Buff值。\r\n放入#fc0xFF009900##i4037331:# #t4037331:##k時，可能會得到比不放入時更差的結果，或者更好的結果。嘿嘿。");
                        npc.id(9402003).next().say("各藥材的詳細BUFF數值如下。\r\n#fc0xFF662500#[一般藥材]\r\n========================================#k\r\n#fc0xFF662500##i4037323:# #t4037323:# #r攻擊力/魔力增加#k\r\n#b5個組合 - 最小：#e+10，#n基本：#e+15#n，最大：#e+20#n\r\n10個組合 - 最小：#e+20#n，基本：#e+30#n，最大：#e+40#n\r\n#fc0xFF662500##i4037324:# #t4037324:# #r全屬性&HP/MP增加#k\r\n#b5個組合 - 最小：#e+10&500，#n基本：#e+20&1000#n，最大：#e+30&1500#n\r\n10個組合 - 最小：#e+30&1500#n，基本：#e+40&2000#n，最大：#e+50&2500#n\r\n#fc0xFF662500##i4037325:# #t4037325:# #r爆擊機率增加#k\r\n#b5個組合 - 最小：#e+5%，#n基本：#e+10%#n，最大：#e+15%#n\r\n10個組合 - 最小：#e+15%#n，基本：#e+20%#n，最大：#e+30%#n\r\n#fc0xFF662500##i4037326:# #t4037326:# #r一般怪物傷害增加#k\r\n#b5個組合 - 最小：#e+10%，#n基本：#e+20%#n，最大：#e+30%#n\r\n10個組合 - 最小：#e+30%#n，基本：#e+40%#n，最大：#e+50%#n\r\n#fc0xFF662500##i4037327:# #t4037327:# #r無視防禦率增加#k\r\n#b5個組合 - 最小：#e+10%，#n基本：#e+20%#n，最大：#e+30%#n\r\n10個組合 - 最小：#e+30%#n，基本：#e+40%#n，最大：#e+50%#n\r\n\r\n#fc0xFF662500#[高級藥材]\r\n========================================#k\r\n#fc0xFF662500##i4037328:# #t4037328:# #rBOSS怪物傷害增加#k\r\n#b1個組合 - 最小：#e+10%，#n基本：#e+20%#n，最大：#e+30%#n\r\n2個組合 - 最小：#e+30%#n，基本：#e+40%#n，最大：#e+50%#n\r\n#fc0xFF662500##i4037329:# #t4037329:# #r經驗值獲得量增加#k\r\n#b1個組合 - 最小：#e+10%，#n基本：#e+20%#n，最大：#e+30%#n\r\n2個組合 - 最小：#e+30%#n，基本：#e+40%#n，最大：#e+50%#n\r\n#fc0xFF662500##i4037330:# #t4037330:# #rBUFF持續時間增加#k\r\n#b1個組合 - 最小：#e+10%，#n基本：#e+15%#n，最大：#e+20%#n\r\n2個組合 - 最小：#e+20%#n，基本：#e+30%#n，最大：#e+40%#n");
                        npc.id(9402003).next().say("#fc0xFF009900##e魔法藥材#n#k和一起使用時，藥材間詳細的Buff數值如下。\r\n#fc0xFF662500#[一般藥材]\r\n========================================#k\r\n#fc0xFF662500##i4037323:# #t4037323:# #r攻擊力/魔力增加#k\r\n#b5個組合 - 最小：#e+0#n，基本：#e+20#n，最大：#e+30#n\r\n10個組合 - 最小：#e+0#n，基本：#e+40#n，最大：#e+60#n\r\n#fc0xFF662500##i4037324:# #t4037324:# #r全屬性&HP/MP增加#k\r\n#b5個組合 - 最小：#e+0#n，基本：#e+30&1500#n，最大：#e+40&2000#n\r\n10個組合 - 最小：#e+0#n，基本：#e+50&2500#n，最大：#e+90&4500#n\r\n#fc0xFF662500##i4037325:# #t4037325:# #r爆擊機率增加#k\r\n#b5個組合 - 最小：#e+0%#n，基本：#e+20%#n，最大：#e+25%#n\r\n10個組合 - 最小：#e+0%#n，基本：#e+30%#n，最大：#e+40%#n\r\n#fc0xFF662500##i4037326:# #t4037326:# #r一般怪物傷害增加#k\r\n#b5個組合 - 最小：#e+0%#n，基本：#e+35%#n，最大：#e+45%#n\r\n10個組合 - 最小：#e+0%#n，基本：#e+50%#n，最大：#e+70%#n\r\n#fc0xFF662500##i4037327:# #t4037327:# #r無視防禦率增加#k\r\n#b5個組合 - 最小：#e+0%#n，基本：#e+30%#n，最大：#e+40%#n\r\n10個組合 - 最小：#e+0%#n，基本：#e+50%#n，最大：#e+70%#n\r\n\r\n#fc0xFF662500#[高級藥材]\r\n========================================#k\r\n#fc0xFF662500##i4037328:# #t4037328:# #rBOSS怪物傷害增加#k\r\n#b1個組合 - 最小：#e+0%#n，基本：#e+30%#n，最大：#e+40%#n\r\n2個組合 - 最小：#e+0%#n，基本：#e+50%#n，最大：#e+70%#n\r\n#fc0xFF662500##i4037329:# #t4037329:# #r經驗值獲得量增加#k\r\n#b1個組合 - 最小：#e+0%#n，基本：#e+30%#n，最大：#e+40%#n\r\n2個組合 - 最小：#e+0%#n，基本：#e+50%#n，最大：#e+100%#n\r\n#fc0xFF662500##i4037330:# #t4037330:# #rBUFF持續時間增加#k\r\n#b1個組合 - 最小：#e+0%#n，基本：#e+20%#n，最大：#e+30%#n\r\n2個組合 - 最小：#e+0%#n，基本：#e+40%#n，最大：#e+60%#n");
                        break;
                case 2:
                        npc.id(9402003).next().say("進行時間至2024年 11月 26日 23點 59分為止。\r\n#b※神祕的靈藥BUFF技能的有效期間，是從製作時間點開始計算7天。(BUFF技能有效期限不能超過活動截止時間)#k");
                        break;
                case 3:
                        npc.id(9402003).next().say("歡迎隨時捐贈藥材。點擊#b捐贈藥材#k鍵，可從持有的#r一般藥材#k中選擇#r5種#k捐贈。捐贈藥材作為回報，可獲得#r一般藥材#k和#r高級藥材#k中#r1個#k，一般藥材分別有#b17%#k，高級藥材分別有#b5%#k的機率。");
                        break;
                case 4:
                        flag = false;
                        break;
        }
}