// Created by MetaMS
// ID:[863010700]
// MapName:培羅德的心臟

let event = stage.getEvent("boss_beidler_normal");
if (event != null) {
        if (event.getVariable("Drop") == null) {
                event.setVariable("Drop", "o");
                map.dropItems(ctx.getEntityPosX(), ctx.getEntityPosY(),
                        [
                                
        4310097, 1000000,//贝勒德币
		4310097, 1000000,//贝勒德币
		4310097, 1000000,//贝勒德币
		4310097, 22222,//贝勒德币
		4310097, 22222,//贝勒德币
		1132243, 66666, //低级贝勒德刻印腰带
		1122264, 66666, //低级贝勒德刻印吊坠
		1032220, 66666, //低级贝勒德耳环
		1113072, 66666, //低级贝勒德戒指
        1113073, 8000,//	1113073	中级贝勒德戒指
        1122265, 8000,//1122265	中级贝勒德刻印吊坠
        1132244, 8000,//1132244	中级贝勒德刻印腰带
        1032221, 8000//1032221	中级贝勒德耳环
                        
                        ]);
        }
}