// Created by MetaMS
// ID:[863010700]
// MapName:培羅德的心臟

let event = stage.getEvent("boss_beidler_normal");
if (event != null) {
        if (event.getVariable("Drop") == null) {
                event.setVariable("Drop", "o");
                map.dropItems(ctx.getEntityPosX(), ctx.getEntityPosY(),
                        [
                                
    4310097, 1000000,//贝勒德币
    4310097, 1000000,//贝勒德币
    4310097, 1000000,//贝勒德币
    4310097, 1000000,//贝勒德币
    4310097, 1000000,//贝勒德币
    4310097, 1000000,//贝勒德币
    4310097, 1000000,//贝勒德币
    4310097, 1000000,//贝勒德币
    4310097, 50000,//贝勒德币
    4310097, 50000,//贝勒德币
    4310097, 50000,//贝勒德币
    4310097, 50000,//贝勒德币
    4310097, 50000,//贝勒德币
    4310097, 50000,//贝勒德币
    4310097, 50000,//贝勒德币
    4310097, 50000,//贝勒德币
    4310097, 50000,//贝勒德币
    4310097, 50000,//贝勒德币
    4310097, 50000,//贝勒德币
    4310097, 50000,//贝勒德币
    1032221, 205555,//中级贝勒德耳环
    1122265, 205555,//中级贝勒德刻印吊坠
    1132244, 205555,//中级贝勒德刻印腰带
    1113073, 205555,//中级贝勒德戒指
    1113074, 92000,//高级贝勒德戒指
    1122266, 92000,//高级贝勒德吊坠
    1132245, 92000,//高级贝勒德腰带
    1032222, 92000,//高级贝勒德耳环	
    1113075, 1000,//最高级贝勒地
    1032223, 1000,//最高级贝勒地
    1122267, 1000,//最高级贝勒地
    1132246, 1000 //最高级贝勒地
                        
                        ]);
        }
}