var jobData = [Array("影魂異人(1轉)", 15500, 15001, 10),
        Array("影魂異人(2轉)", 15510, 15500, 30),
        Array("影魂異人(3轉)", 15511, 15510, 60),
        Array("影魂異人(4轉)", 15512, 15511, 100),
        Array("聖晶使徒(1轉)", 15200, 15000, 10),
        Array("聖晶使徒(2轉)", 15210, 15200, 30),
        Array("聖晶使徒(3轉)", 15211, 15210, 60),
        Array("聖晶使徒(4轉)", 15212, 15211, 100),
        Array("魔鏈影士(1轉)", 6400, 6002, 10),
        Array("魔鏈影士(2轉)", 6410, 6400, 30),
        Array("魔鏈影士(3轉)", 6411, 6410, 60),
        Array("魔鏈影士(4轉)", 6412, 6411, 100),

        Array("阿黛爾(1轉)", 15100, 15002, 10),
        Array("阿黛爾(2轉)", 15110, 15100, 30),
        Array("阿黛爾(3轉)", 15111, 15110, 60),
        Array("阿黛爾(4轉)", 15112, 15111, 100),

        Array("虎影(1轉)", 16400, 16000, 10),
        Array("虎影(2轉)", 16410, 16400, 30),
        Array("虎影(3轉)", 16411, 16410, 60),
        Array("虎影(4轉)", 16412, 16411, 100),

        Array("菈菈(1轉)", 16200, 16001, 10),
        Array("菈菈(2轉)", 16210, 16200, 30),
        Array("菈菈(3轉)", 16211, 16210, 60),
        Array("菈菈(4轉)", 16212, 16211, 100),

        Array("凱因(1轉)", 6300, 6003, 10),
        Array("凱因(2轉)", 6310, 6300, 30),
        Array("凱因(3轉)", 6311, 6310, 60),
        Array("凱因(4轉)", 6312, 6311, 100),

        Array("雙刀入門", 400, 0, 10, 1),
        Array("見習刀客", 430, 400, 20, 1),
        Array("雙刀客", 431, 430, 30, 1),
        Array("雙刀俠", 432, 431, 45, 1),
        Array("血刀", 433, 432, 60, 1),
        Array("暗影雙刀", 434, 433, 100, 1),
        Array("海盜（炮手）", 501, 0, 10, 2),
        Array("火炮手（二轉）", 530, 501, 30, 2),
        Array("毀滅炮手（三轉）", 531, 530, 60, 2),
        Array("神炮王", 532, 531, 100, 2),
        Array("龍的傳人（一轉）", 508, 0, 10, 10),
        Array("龍的傳人（二轉）", 570, 508, 30, 10),
        Array("龍的傳人（三轉）", 571, 570, 60, 10),
        Array("龍的傳人（四轉）", 572, 571, 100, 10),
        Array("戰士", 100, 0, 10),
        Array("劍客", 110, 100, 30),
        Array("勇士", 111, 110, 60),
        Array("英雄", 112, 111, 100),
        Array("準騎士", 120, 100, 30),
        Array("騎士", 121, 120, 60),
        Array("聖騎士", 122, 121, 100),
        Array("槍戰士", 130, 100, 30),
        Array("龍騎士", 131, 130, 60),
        Array("黑騎士", 132, 131, 100),
        Array("魔法師", 200, 0, 10),
        Array("火毒法師", 210, 200, 30),
        Array("火毒巫師", 211, 210, 60),
        Array("火毒魔導士", 212, 211, 100),
        Array("冰雷法師", 220, 200, 30),
        Array("冰雷巫師", 221, 220, 60),
        Array("冰雷魔導士", 222, 221, 100),
        Array("牧師", 230, 200, 30),
        Array("祭司", 231, 230, 60),
        Array("主教", 232, 231, 100),
        Array("弓箭手", 300, 0, 10),
        Array("獵人", 310, 300, 30),
        Array("射手", 311, 310, 60),
        Array("神射手", 312, 311, 100),
        Array("弩弓手", 320, 300, 30),
        Array("遊俠", 321, 320, 60),
        Array("箭神", 322, 321, 100),

        Array("古蹟獵人（一轉）", 301, 0, 10, 3),
        Array("古蹟獵人（二轉）", 330, 301, 30, 3),
        Array("古蹟獵人（三轉）", 331, 330, 60, 3),
        Array("古蹟獵人（四轉）", 332, 331, 100, 3),


        Array("飛俠", 400, 0, 10),
        Array("刺客", 410, 400, 30),
        Array("無影人", 411, 410, 60),
        Array("隱士", 412, 411, 100),
        Array("俠客", 420, 400, 30),
        Array("獨行客", 421, 420, 60),
        Array("俠盜", 422, 421, 100),
        Array("海盜", 500, 0, 10),
        Array("拳手", 510, 500, 30),
        Array("鬥士", 511, 510, 60),
        Array("衝鋒隊長", 512, 511, 100),
        Array("火槍手", 520, 500, 30),
        Array("大副", 521, 520, 60),
        Array("船長", 522, 521, 100),
        /*騎士團聯盟-------------------*/
        Array("魂騎士（一轉）", 1100, 1000, 10),
        Array("魂騎士（二轉）", 1110, 1100, 30),
        Array("魂騎士（三轉）", 1111, 1110, 60),
        Array("魂騎士（四轉）", 1112, 1111, 100),
        Array("炎術士（一轉）", 1200, 1000, 10),
        Array("炎術士（二轉）", 1210, 1200, 30),
        Array("炎術士（三轉）", 1211, 1210, 60),
        Array("炎術士（四轉）", 1212, 1211, 100),
        Array("風靈使者（一轉）", 1300, 1000, 10),
        Array("風靈使者（二轉）", 1310, 1300, 30),
        Array("風靈使者（三轉）", 1311, 1310, 60),
        Array("風靈使者（四轉）", 1312, 1311, 100),
        Array("夜行者（一轉）", 1400, 1000, 10),
        Array("夜行者（二轉）", 1410, 1400, 30),
        Array("夜行者（三轉）", 1411, 1410, 60),
        Array("夜行者（四轉）", 1412, 1411, 100),
        Array("奇襲者（一轉）", 1500, 1000, 10),
        Array("奇襲者（二轉）", 1510, 1500, 30),
        Array("奇襲者（三轉）", 1511, 1510, 60),
        Array("奇襲者（四轉）", 1512, 1511, 100),
        /*騎士團聯盟-------------------*/

        Array("戰神（一轉）", 2100, 2000, 10),
        Array("戰神（二轉）", 2110, 2100, 30),
        Array("戰神（三轉）", 2111, 2110, 60),
        Array("戰神（四轉）", 2112, 2111, 100),
        Array("雙弩精靈（一轉）", 2300, 2002, 10),
        Array("雙弩精靈（二轉）", 2310, 2300, 30),
        Array("雙弩精靈（三轉）", 2311, 2310, 60),
        Array("雙弩精靈（四轉）", 2312, 2311, 100),
        Array("幻影（一轉）", 2400, 2003, 10),
        Array("幻影（二轉）", 2410, 2400, 30),
        Array("幻影（三轉）", 2411, 2410, 60),
        Array("幻影（四轉）", 2412, 2411, 100),
        Array("夜光法師（一轉）", 2700, 2004, 10),
        Array("夜光法師（二轉）", 2710, 2700, 30),
        Array("夜光法師（三轉）", 2711, 2710, 60),
        Array("夜光法師（四轉）", 2712, 2711, 100),

        /*惡魔聯盟--------------------------*/
        Array("惡魔獵手（一轉）", 3100, 3001, 10),
        Array("惡魔獵手（二轉）", 3110, 3100, 30),
        Array("惡魔獵手（三轉）", 3111, 3110, 60),
        Array("惡魔獵手（四轉）", 3112, 3111, 100),
        Array("惡魔復仇者（一轉）", 3101, 3001, 10),
        Array("惡魔復仇者（二轉）", 3120, 3101, 30),
        Array("惡魔復仇者（三轉）", 3121, 3120, 60),
        Array("惡魔復仇者（四轉）", 3122, 3121, 100),
        /*惡魔聯盟--------------------------*/

        /*反抗者聯盟--------------------------*/
        Array("豹弩遊俠（一轉）", 3300, 3000, 10),
        Array("豹弩遊俠（二轉）", 3310, 3300, 30),
        Array("豹弩遊俠（三轉）", 3311, 3310, 60),
        Array("豹弩遊俠（四轉）", 3312, 3311, 100),
        Array("喚靈鬥師（一轉）", 3200, 3000, 10),
        Array("喚靈鬥師（二轉）", 3210, 3200, 30),
        Array("喚靈鬥師（三轉）", 3211, 3210, 60),
        Array("喚靈鬥師（四轉）", 3212, 3211, 100),
        Array("機械師（一轉）", 3500, 3000, 10),
        Array("機械師（二轉）", 3510, 3500, 30),
        Array("機械師（三轉）", 3511, 3510, 60),
        Array("機械師（四轉）", 3512, 3511, 100),
        Array("爆破手（一轉）", 3700, 3000, 10),
        Array("爆破手（二轉）", 3710, 3700, 30),
        Array("爆破手（三轉）", 3711, 3710, 60),
        Array("爆破手（四轉）", 3712, 3711, 100),
        /*反抗者聯盟--------------------------*/

        /*尖兵聯盟--------------------------*/
        Array("尖兵（一轉）", 3600, 3002, 10),
        Array("尖兵（二轉）", 3610, 3600, 30),
        Array("尖兵（三轉）", 3611, 3610, 60),
        Array("尖兵（四轉）", 3612, 3611, 100),
        /*尖兵聯盟--------------------------*/

        /*米哈爾聯盟--------------------------*/
        Array("米哈爾（一轉）", 5100, 5000, 10),
        Array("米哈爾（二轉）", 5110, 5100, 30),
        Array("米哈爾（三轉）", 5111, 5110, 60),
        Array("米哈爾（四轉）", 5112, 5111, 100),
        /*米哈爾聯盟--------------------------*/


        Array("狂龍戰士（一轉）", 6100, 6000, 10),
        Array("狂龍戰士（二轉）", 6110, 6100, 30),
        Array("狂龍戰士（三轉）", 6111, 6110, 60),
        Array("狂龍戰士（四轉）", 6112, 6111, 100),
        Array("爆莉萌天使（一轉）", 6500, 6001, 10),
        Array("爆莉萌天使（二轉）", 6510, 6500, 30),
        Array("爆莉萌天使（三轉）", 6511, 6510, 60),
        Array("爆莉萌天使（四轉）", 6512, 6511, 100),
        Array("隱月（一轉）", 2500, 2005, 10),
        Array("隱月（二轉）", 2510, 2500, 30),
        Array("隱月（三轉）", 2511, 2510, 60),
        Array("隱月（四轉）", 2512, 2511, 100),
        Array("劍豪（一轉）", 4100, 4001, 10),
        Array("劍豪（二轉）", 4110, 4100, 30),
        Array("劍豪（三轉）", 4111, 4110, 60),
        Array("劍豪（四轉）", 4112, 4111, 100),
        Array("陰陽師（一轉）", 4200, 4002, 10),
        Array("陰陽師（二轉）", 4210, 4200, 30),
        Array("陰陽師（三轉）", 4211, 4210, 60),
        Array("陰陽師（四轉）", 4212, 4211, 100),
        Array("超能力者（一轉）", 14200, 14000, 10),
        Array("超能力者（二轉）", 14210, 14200, 30),
        Array("超能力者（三轉）", 14211, 14210, 60),
        Array("超能力者（四轉）", 14212, 14211, 100),
        Array("龍神（一轉）", 2210, 2001, 10),
        Array("龍神（二轉）", 2212, 2210, 30),
        Array("龍神（三轉）", 2216, 2212, 60),
        Array("龍神（四轉）", 2217, 2216, 100)];

let changeJob = exports;

changeJob.askChange = function (npc, stage) {
        var flag = false;
        var text = "請選擇您要轉職的職業：\r\n";
        var subjob = stage.getSubJob();
        for (var i = 0; i < jobData.length; i++) {
                if (subjob == 1) {
                        if (stage.getJob() == jobData[i][2] && jobData[i][4] == 1) {
                                text += "#L" + i + "#" + jobData[i][0] + "#l#k\r\n";
                                flag = true;
                        }
                } else if (subjob == 2) {
                        if (stage.getJob() == jobData[i][2] && jobData[i][4] == 2) {
                                text += "#L" + i + "#" + jobData[i][0] + "#l#k\r\n";
                                flag = true;
                        }
                } else {
                        var subtype = null == jobData[i][4] ? 0 : jobData[i][4];
                        if (stage.getJob() == jobData[i][2] && subtype == subjob) {
                                text += "#b#L" + i + "#" + jobData[i][0] + "#l#k\r\n";
                                flag = true;
                        }
                }
        }
        if (flag) {
                let sel = npc.askMenu(text);
                let ret = npc.askYesNo("您是否要轉職為:#b" + jobData[sel][0] + "#l#k。");
                if (ret == 1) {
                        if (stage.getLevel() < jobData[sel][3]) {
                                npc.next().say("對不起,您的等級不足#e#r" + jobData[sel][3] + "級#k#n。");
                        } else {
                                stage.setJob(jobData[sel][1]);
                        }
                }
        } else {
                npc.next().say("對不起,你現在不能轉職。");
        }
}





        