let unionHelp = exports;

unionHelp.showHelp = function (npc) {
        let flag = true;
        while (flag) {
                let sel = npc.id(9010106).askMenu("你說想要了解有關#b楓之谷聯盟#k的情況？\r\n有什麼需要我告訴你的嗎？\r\n#L0# #b什麼是楓之谷聯盟？#k#l\r\n#L1# #b聯盟等級#k#l\r\n#L2# #b聯盟級別#k#l\r\n#L3# #b攻擊隊和戰鬥力#k#l\r\n#L9# #b預設保存功能#k#l\r\n#L4# #b戰鬥地圖和角色積木#k#l\r\n#L5# #b聯盟突襲#k#l\r\n#L6# #b每周獲得聯盟幣排名#k#l\r\n#L7# #b專屬網吧福利#k#l\r\n\r\n#L100# #e不再聽取說明。#n#l");
                switch (sel) {
                        case 0:
                                npc.id(9010106).next().say("#e<什麼是楓之谷聯盟？>#n\r\n\r\n#e楓之谷聯盟#n是指#b同一個世界裡的各個角色組成的團體#k。\r\n不過，並不是所有角色都屬於#b楓之谷聯盟#k。\r\n必須要滿足#r角色等級超過60/完成2次轉職#k的條件。\r\n還有，#r若同一個世界內擁有的角色數量超過42人時，#k #b以等級為準，只有前42個角色#k隸屬于楓之谷聯盟。\r\n\r\n對於#b神之子#k角色，只有#r130級以上、等級最高的1人#k會被視作楓之谷聯盟成員。");
                                npc.id(9010106).next().say("#e<楓之谷聯盟是？>#n\r\n\r\n#e楓之谷聯盟#n所屬角色根據#r等級#k不同可提升#b角色等級#k\r\n\r\n#e<普通角色>#n\r\n#b#eB(60)>A(100)>S(140)>SS(200)>SSS(250)#n#k\r\n#e<神之子>#n\r\n#b#eB(130)>A(160)>S(180)>SS(200)>SSS(250)#n#k");
                                break;
                        case 1:
                                npc.id(9010106).next().say("#e<聯盟等級>#n\r\n\r\n#e聯盟等級#n指的是隸屬於#b楓之谷聯盟#k角色的\r\n#r等級合計值#k。\r\n\r\n只有聯盟等級夠高，才能夠#r升級#k到更高的#b聯盟級別#k，打造更加強大的楓之谷聯盟。\r\n\r\n#b聯盟等級排名#k也可以在官網主頁上查看。");
                                break;
                        case 2:
                                let cSel = npc.id(9010106).askMenu("#e<聯盟級別>#n\r\n\r\n#e聯盟級別#n是當#b聯盟等級#k達到特定數值後提升的#b成長尺度#k。\r\n\r\n#b聯盟級別#k越高，就可以在#r更廣闊的戰鬥地圖#k中配置#r更多的攻擊隊隊員#k。\r\n#b聯盟等級#k達到一定水平將要#b進階#時，需要支付#b#i4310229:##t4310229##k。\r\n\r\n#L1# #b 查看各級別所需等級/支付幣/攻擊隊隊員人數#k#l");
                                if (cSel == 1) {
                                        npc.id(9010106).next().say("#e<新手聯盟>#n\r\n\r\n  -#e第1階段#n #bLv.   -#k     #r需要聯盟幣：無#k     #b攻擊隊員：9名#k#n\r\n  -#e第2階段#n #bLv.1000#k   #r需要聯盟幣：120個#k   #b攻擊隊員：10名#k\r\n  -#e第3階段#n #bLv.1500#k   #r需要聯盟幣：140個#k   #b攻擊隊員：11名#k\r\n  -#e第4階段#n #bLv.2000#k   #r需要聯盟幣：150個#k   #b攻擊隊員：12名#k\r\n  -#e第5階段#n #bLv.2500#k   #r需要聯盟幣：160個#k   #b攻擊隊員：13名#k");
                                        npc.id(9010106).next().say("#e<資深聯盟>#n\r\n\r\n  -#e第1階段#n #bLv.3000#k   #r所需聯盟幣：170個#k   #b攻擊隊隊員：18人#k#n\r\n  -#e第2階段#n #bLv.3500#k   #r所需聯盟幣：430個#k   #b攻擊隊隊員：19人#k\r\n  -#e第3階段#n #bLv.4000#k   #r所需聯盟幣：450個#k   #b攻擊隊隊員：20人#k\r\n  -#e第4階段#n #bLv.4500#k   #r所需聯盟幣：470個#k   #b攻擊隊隊員：21人#k\r\n  -#e第5階段#n #bLv.5000#k   #r所需聯盟幣：490個#k   #b攻擊隊隊員：22人#k");
                                        npc.id(9010106).next().say("#e<大師聯盟>#n\r\n\r\n  -#e第1階段#n #bLv.5500#k   #r所需聯盟幣： 510個#k   #b攻擊隊隊員：27人#k#n\r\n  -#e第2階段#n #bLv.6000#k   #r所需聯盟幣： 930個#k   #b攻擊隊隊員：28人#k\r\n  -#e第3階段#n #bLv.6500#k   #r所需聯盟幣： 960個#k   #b攻擊隊隊員：29人#k\r\n  -#e第4階段#n #bLv.7000#k   #r所需聯盟幣：1000個#k   #b攻擊隊隊員：30人#k\r\n  -#e第5階段#n #bLv.7500#k   #r所需聯盟幣：1030個#k   #b攻擊隊隊員：31人#k");
                                        npc.id(9010106).next().say("#e<大宗師聯盟>#n\r\n\r\n  -#e第1階段#n #bLv.8000#k   #r所需聯盟幣：1060個#k   #b攻擊隊隊員：36人#k#n\r\n  -#e第2階段#n #bLv.8500#k   #r所需聯盟幣：2200個#k   #b攻擊隊隊員：37人#k\r\n  -#e第3階段#n #bLv.9000#k   #r所需聯盟幣：2300個#k   #b攻擊隊隊員：38人#k\r\n  -#e第4階段#n #bLv.9500#k   #r所需聯盟幣：2350個#k   #b攻擊隊隊員：39人#k\r\n  -#e第5階段#n #bLv.10000#k  #r所需聯盟幣：2400個#k   #b攻擊隊隊員：40人#k");
                                        npc.id(9010106).next().say("#e<至尊聯盟>#n\r\n\r\n  -#e1階段#n #bLv.10500#k   #r所需硬幣：3000個#k   #b攻擊隊員：41人#k#n\r\n  -#e2階段#n #bLv.11000#k   #r所需硬幣：3400個#k   #b攻擊隊員：42人#k\r\n  -#e3階段#n #bLv.11500#k   #r所需硬幣：3900個#k   #b攻擊隊員：43人#k\r\n  -#e4階段#n #bLv.12000#k   #r所需硬幣：4400個#k   #b攻擊隊員：44人#k\r\n  -#e5階段#n #bLv.12500#k   #r所需硬幣：5000個#k   #b攻擊隊員：45人#k");
                                }
                                break;
                        case 3:
                                npc.id(9010106).next().say("#e<攻擊隊和戰鬥力>#n\r\n\r\n所謂#b攻擊隊#k，指的是聯盟角色中，#b分配到戰鬥地圖上的角色組織#k。\r\n\r\n成為#b攻擊隊隊員#k的角色會參加#r聯盟突襲#k，與強大的敵人展開戰鬥，並收集#b聯盟幣#k。\r\n\r\n另外攻擊隊隊員還會觸發角色固定的#b<攻擊隊隊員效果>#k和戰鬥地圖占領狀態所產生的#b<攻擊隊占領效果>#k，對#r世界內所有角色#k帶來#b能力值提升效果#k。");
                                npc.id(9010106).next().say("#e<攻擊隊和戰鬥力>#n\r\n\r\n#b戰鬥力#k由角色的#r等級#k和#r星之力數值#k決定。\r\n\r\n#b攻擊隊戰鬥力#k即#b攻擊隊員#k們的戰鬥力總和，#b攻擊隊戰鬥力#k越高，在#r聯盟突襲#k中給敵人造成的傷害越大，收集聯盟幣的速度也越快。");
                                break;
                        case 9:
                                npc.id(9010106).next().say("#e<預設保存功能>#n\r\n\r\n你想根據各種情況變更#b戰鬥地圖#k中配置的#r角色積木和內部8個能力值#k嗎？\r\n使用#b聯盟預設#k功能吧！");
                                npc.id(9010106).next().say("#e<預設保存功能>#n\r\n\r\n預設默認會提供兩個，還可以額外通過#r紀念幣商店#k在出售的#b#i2436884:##t2436884##k\r\n#r最多再激活三個，#k#b時長為30天#k。\r\n激活時間#b從現在起最多只能延長180天#k。");
                                npc.id(9010106).next().say("#e<預設保存功能>#n\r\n\r\n#b點擊預設按鈕並進行配置#k後，將配置保存下來，下次就可以快速更改！如果是當前使用的預設，更改後保存時，會立即應用。");
                                break;
                        case 4:
                                npc.id(9010106).next().say("#e<戰鬥地圖和角色積木>#n\r\n\r\n#b戰鬥地圖#k是一種可以分配#r攻擊隊隊員#k占領的地圖，#b內部8個#k、#r外部8個#k，#e總共由16個地區#n組成。\r\n每個地區都擁有#b固定的能力值#k，根據各地區的#r占領格數#k，能力值也會有所提升。\r\n\r\n#b內部8個地區的能力值#k可以按照需求#b進行更改#k\r\n#r外部8個地區的能力值#k是固定的。");
                                npc.id(9010106).next().say("#e<戰鬥地圖和角色積木>#n\r\n\r\n將角色#e拖拽#n至#b戰鬥地圖#k上，角色就會顯示為#b積木#k，並占據一部分#b戰鬥地圖#k。\r\n\r\n#e角色積木#n會根據#b等級#k和#b職業種類#k，以#b原有角色積木#k為中心成長，形狀也會各不相同。");
                                npc.id(9010106).next().say("#e<戰鬥地圖和角色積木>#n\r\n\r\n第一次將角色配置在#b戰鬥地圖#k上時，#r原有的角色積木#k一定要包含在#b中央四個地方之一#k。\r\n\r\n接下來才可以繼續配置其他角色，讓角色積木互相碰觸或重疊，還可以#b翻轉或轉動#k角色積木，改變成自己想要的形狀，#b通過點擊滑鼠右鍵還可以解除#k。");
                                break;
                        case 5:
                                npc.id(9010106).next().say("#e<聯盟突襲>#n\r\n\r\n#b聯盟突襲#k是#b攻擊隊員#k們進行的#r戰鬥內容#k。\r\n\r\n用加入攻擊隊的角色點擊聯盟UI中的#e<參加戰鬥>按鈕#n時，可以入場。\r\n進入突襲之後，#b攻擊隊員#k們就會努力地進行戰鬥。");
                                npc.id(9010106).next().say("#e<聯盟突襲>#n\r\n\r\n#b聯盟突襲#k中會出現#b2種怪物#k。\r\n\r\n#e第一個#n是出現在戰場中央的#b巨龍#k。\r\n#b攻擊隊隊員#k自動攻擊中央的巨龍。\r\n\r\n#r親自參加戰鬥的角色#k也可以攻擊#b巨龍#k。\r\n注意，#r巨龍#k血量中的#b綠色血條#k清空時，會生成#b保護罩#k，直接參戰角色的攻擊將失效，#b只有其餘攻擊隊隊員的傷害生效#k。\r\n\r\n攻擊隊隊員即使#b不親自參與戰鬥#k，也會#b不停#k與巨龍作戰，並收集#b聯盟幣#k。\r\n\r\n#r退出突襲#k，或點擊#r「領取按鈕」後會統計#k#b聯盟幣#k，玩家可#b周期性入場#k回收攻擊隊隊員們收集的硬幣。");
                                npc.id(9010106).next().say("#e<聯盟突襲>#n\r\n\r\n#e第二種#n是保護巨龍的#b迷你龍#k。\r\n\r\n這些傢伙只會被#r直接參加戰鬥的角色#k攻擊到，可以擊敗這些傢伙，進行#b每日任務#k。\r\n在對付迷你龍的過程中，偶爾還會出現稀有的#b黃金飛龍#k。");
                                npc.id(9010106).next().say("#e<聯盟突襲>#n\r\n\r\n每當對#b巨龍#k造成的累積傷害達到#e1000億#n時，就會獲得一個#b聯盟幣#k。\r\n累積傷害會以#b每天為單位進行初始化#k。\r\n\r\n不同聯盟級別都存在不同的#r極限值#k，當達到極限時，聯盟幣就不會再疊加，所以最好還是每天都確認一下吧？");
                                break;
                        case 6:
                                npc.id(9010106).next().say("#e<每周獲得聯盟幣排名>#n\r\n\r\n#b每周獲得聯盟幣排名#k是以世界內所有角色\r\n#b每周一00點30分#k到#r周日23點30分#k獲得的#b聯盟幣#k數量為基準計算的排名。");
                                npc.id(9010106).next().say("#e<每周獲得聯盟幣排名>#n\r\n\r\n會以#b最後#k更新每周累積聯盟幣的#b角色名#k登陸排名，等到下一周時，再向#r排名第1到\r\n第100的聯盟#k發送#b特別的禮物#k。\r\n通過#b每日任務#k所獲得的聯盟幣會得到累積，所以最好常來看看吧？");
                                break;
                        case 7:
                                npc.id(9010106).next().say("#e<專屬網吧福利>#n\r\n\r\n在#b專屬網吧#k登陸的角色\r\n可以從我這裡領取#b網吧專用每日任務#k。\r\n通過#b每日任務#k可以獲得的#r聯盟幣將會是雙倍#k，一定要挑戰看看哦！");
                                break;
                        case 100:
                                flag = false;
                                break;
                }
        }
}