/*
 * Copyright (c) 2023. Lorem ipsum dolor sit amet, consectetur adipiscing elit.
 * marin 腳本訂製 技術顧問 50009219
 */

player = require("check_log");
composite = require("composite");
option = require("option_tabulation");
marin_change = exports;

marin_change.marin = function (npc, stage, db, util) {
    var txt = "\r\n";
    txt += "#b#L22#職業前置#l    #b#L2#創世武器#l   #b#L3#創胸附加#l  #r#L4#漆黑升星#l\r\n\r\n";
    txt += "#b#L5#背包疊加#l    #b#L6#強制副手#l   #b#L7#背包擴充#l  #b#L8#燈泡消除#l\r\n\r\n";
    txt += "#b#L9#一鍵技能#l    #b#L10#超級屬性#l   #b#L11#加血加藍#l  #L12#時裝鐵砧#l\r\n\r\n";
    txt += "#b#L13#自動白錘#l    #b#L14#裝備綁定#l   #L15#裝備繼承#l  #L16#裝備轉換#l\r\n\r\n";
    txt += "#b#L17#真實符文#l    #b#L18#職業更換#l   #L19#白金剪刀#l  #L20#符文重置#l\r\n\r\n";
    txt += "#b#L21#神子武器#l\r\n"
    txt += " ";
    sel = npc.meFlip().askMenu(txt);

    switch (sel) {
        case 1:
            var txt = "\r\n";
            txt += "#L0#紅色方塊#l\t#L1#每日核心#l\r\n";
            url = npc.meFlip().askMenu(txt);
            switch (url) {
                case 0:
                    var count = player.getEventValue(stage, db, "紅色方塊");
                    count += 1;
                    if (npc.meFlip().askYesNo("是否今日第 #r" + count + " #k購買#i5062009# x 10 消耗 " + 1E8 * count + " 楓幣嗎?") === 1) {
                        if (!stage.hasMesos(1E7 * count)) {
                            npc.meFlip().say("抱歉..你沒有 " + 1E7 * count + " 楓幣");
                            return;
                        }
                        player.addEventValue(stage, db, "紅色方塊");
                        stage.loseMesos(1E7 * count);
                        stage.gainItem(5062009, 10);
                        npc.meFlip().say("購買成功");
                    }
                    break;
                case 1:
                    var count = player.getEventValue(stage, db, "每日核心");
                    if (count > 0) {
                        npc.meFlip().say("今日領過了!!明日再光臨吧~");
                        return;
                    }
                    stage.gainItem(2630402, 10);
                    player.addEventValue(stage, db, "每日核心");
                    npc.meFlip().say("恭喜~今日核心已領！");
                    break;
            }
            break;
        case 2:
            var combination = {
                1: [1442285, 1312213, 1382274, 1252106, 1582044, 1452266, 1322264, 1522152, 1262051, 1592022, 1462252, 1332289, 1532157, 1402268, 1403022, 1272040, 1404022, 1472275, 1212129, 1213022, 1214022, 1542128, 1412189, 1282040, 1482232, 1222122, 1552130, 1422197, 1292022, 1492245, 1362149, 1232122, 1562010, 1432227, 1302355, 1372237, 1242139, 1242141, 1572010],
                2: [
                    "創世解封",
                    "武功寶珠",
                    "創世技能",
                    '創世附加',
                    '創世卷軸'
                ],
                3: [
                    [40603, "#d攻擊頭領提高 #r40#b %"],
                    [40292, "#d免疫怪獸防禦 #r40#b %"],
                    [42051, "#d提高物攻屬性 #r12#b %"],
                    [40052, "#d提高魔攻屬性 #r12#b %"],
                    [60001, "#d提高總傷害值 #r12#b %"],
                    [60002, "#d提高所有屬性 #r20#b %"],
                    [40045, "#d提高血量上限 #r12#b %"],
                    [40056, "#d提高暴擊傷害 #r 8#b %"],
                    [40055, "#d提高暴擊概率 #r12#b %"]
                ]
            }
            var txt = "";
            for (var i in combination[2]) {
                if (i % 3 == 0) {
                    txt += "\r\n\r\n";
                } else {
                    txt += "\t";
                }
                txt += "#L" + i + "#" + combination[2][i] + "#l";
            }
            url = npc.meFlip().askMenu(txt);
            switch (url) {
                case 0:
                    crl = 0;

                    var txt = "\t\t創世解封\r\n\r\n";
                    txt += "需擊殺黑魔法師 #b困難#k #r8#k 回 <同時達標> 已完成 #b" + stage.getIntQuestRecordEx(1000000, "blackmage") + "#k\r\n";
                    txt += "才可以將神秘武器解封成為創世武器\r\n";
                    txt += "黑魔法師每周只能擊殺#r1#k回 困難\r\n";
                    txt += "可消耗 #r50 #k星語幣重置本週黑魔法師次數 (賬號限制 4次)\r\n";
                    txt += "解封時需將神秘武器放置 [ 1 ]位置\r\n";
                    txt += "#L0##r創世解封#l\t\t#L1##b黑魔法師重置#l\r\n";
                    url_0 = npc.meFlip().askMenu(txt);
                    switch (url_0) {
                        case 0:
                            var Equip = stage.getItemBySlot(1, 1);
                            if (Equip == null) {
                                npc.meFlip().say("抱歉..[1]位置不能留空");
                                return;
                            }
                            var marin = [1212120, 1213018, 1214018, 1222113, 1232113, 1242121, 1242122, 1252098, 1262039, 1272017, 1282017, 1292018, 1302343, 1312203, 1322255, 1332279, 1342104, 1362140, 1372228, 1382265, 1402259, 1403018, 1412181, 1422189, 1432218,
                                1442274, 1452257, 1462243, 1472265, 1482221, 1492235, 1522143, 1532150, 1542117, 1552119, 1582023, 1592020];
                            var marin_cs = [
                                1212129, 1213022, 1214022, 1222122, 1232122, 1242139, 1242141, 1252106, 1262051, 1272040, 1282040,
                                1292022, 1302355, 1312213, 1322264, 1332289, 1362149, 1372237, 1382274, 1402268, 1403022,
                                1412189, 1422197, 1432227, 1442285, 1452266, 1462252, 1472275, 1482232, 1492245, 1522152, 1532157, 1542128, 1552130, 1562010, 1572010, 1582044, 1592022, 1404022
                            ]
                            if (marin.indexOf(Equip['itemId']) <= -1) {
                                npc.meFlip().say("抱歉..[1]位置不是神秘武器");
                                return;
                            }
                            var txt = "創世解封\r\n\r\n";
                            txt += "物品信息:#i" + Equip['itemId'] + "#\r\n";
                            txt += "解封狀態:#b黑魔法師 困難 [#r " + stage.getIntQuestRecordEx(1000000, "blackmage") + "#b ]\r\n";
                            txt += "\r\n";
                            txt += "\t\t見證創世解封吧！！！\r\n";
                            yes = npc.meFlip().askYesNo(txt);
                            if (yes != 1) return;
                            if (stage.getIntQuestRecordEx(1000000, "blackmage") < 8) {
                                npc.meFlip().say("抱歉..你沒有完成指標不能解封..");
                                return;
                            }
                            var txt = "請選擇你想解封的創世\r\n";
                            for (var i in marin_cs) {
                                txt += "#L" + marin_cs[i] + "##i" + marin_cs[i] + ":##l";
                            }
                            num = npc.meFlip().askMenu(txt);

                            if (npc.meFlip().askYesNo("#i" + Equip['itemId'] + "#確認繼承到 #i" + num + "# 嗎?") != 1) return;

                            if (player.getEventValue(stage, db, "創世解封效驗") > 0) {
                                npc.meFlip().say("抱歉..你解封過了 一個賬號只能解封1回");
                                return;
                            }
                            marinchange(stage, util, 1, Equip, num, true, 0);
                            player.resetEventValue(stage, db, "黑魔法師困難效驗");
                            stage.updateQuestRecordEx(1000000, "blackmage", "0")
                            player.addEventValue(stage, db, "創世解封效驗", 1, -1);
                            npc.meFlip().say("繼承成功");
                            break;

                        case 1:
                            var txt = "黑魔法師重置\r\n\r\n";
                            txt += "當前已重置 [ #r" + player.getEventValue(stage, db, "黑魔法師重置效驗") + "#k ]\r\n\r\n";
                            txt += "是否立即重置本周黑魔法師 #b困難#k\r\n";
                            txt += "重置時消耗 #r50 #k星語幣\r\n";
                            yes = npc.meFlip().askYesNo(txt);
                            if (yes != 1) return;
                            if (G_money(stage, db) < 50) {
                                npc.meFlip().say("真可惜..重置失敗..你沒有 50 星語幣");
                                return;
                            }
                            D_money(stage, db, -50);
                            player.addEventValue(stage, db, "黑魔法師重置效驗", 1, -1);
                            player.resetEventValue(stage, db, "BlackMage");
                            player.resetEventValue(stage, db, "BlackMage_Hard");
                            npc.meFlip().say("重置成功");
                            break;
                    }
                    break;
                case 1:
                    while (true) {
                        txt = "武功寶珠\r\n\r\n";
                        txt += "武器必須在[1]位置且是創世武器\r\n";
                        txt += "武器的默認寶珠必須是武功靈魂寶珠\r\n";
                        txt += "每次消耗30億楓幣與70億綁幣\r\n\r\n";
                        npc.meFlip().next().say(txt);

                        let pro = {
                            20051: 4.4,
                            20070: 4.4,
                            20044: 4.4,
                            20052: 4.4,
                            20055: 4.4,
                            20041: 4.4,
                            20042: 4.4,
                            20291: 4.4,
                            20043: 4.4,
                            20047: 4.4,
                            20086: 4.4,
                            30048: 4.4,
                            30070: 4.4,
                            30041: 4.4,
                            30291: 4.4,
                            30086: 4.4,
                            30044: 4.4,
                            30055: 4.4,
                            30601: 4.4,
                            30042: 4.4,
                            30043: 4.4,
                            30047: 4.4,
                            30051: 1.6,
                            30052: 1.6
                        }
                        txt = "武功寶珠\r\n\r\n";
                        txt += "隨機生成一條寶珠潛能!\r\n\r\n";
                        npc.meFlip().next().say(txt);
                        if (!stage.hasMesos(30 * 1E8)) {
                            npc.meFlip().say("抱歉..你沒有 30 億楓幣");
                            return;
                        }
                        totalmoney = parseInt(stage.getQuestRecordExShare(100000, "totalmoney") || 0);
                        if (isInputNaN(totalmoney)) {
                            stage.updateQuestRecordExShare(100000, "totalmoney", "0");
                        }
                        if (totalmoney < 70 * 1E8) {
                            npc.meFlip().say("抱歉..你沒有 " + 70 + " 綁金");
                            return;
                        }
                        var Equip = stage.getItemBySlot(1, 1);
                        if (Equip == null) {
                            stage.dropAlertNotice("抱歉..[1]不能留空");
                            return;
                        }
                        if (combination[1].indexOf(Equip['itemId']) <= -1) {
                            stage.dropAlertNotice("抱歉..[1]位置的物品並非創世系列");
                            return;
                        }
                        if (Equip['soulOptionId'] != 9) {
                            stage.dropAlertNotice("抱歉..現在武器並非靈魂武器");
                            return;
                        }
                        randomId = getRandomIdByProbability(pro);
                        Equip['soulOption'] = randomId;
                        stage.updateItemBySlot(1, 1);
                        stage.loseMesos(30 * 1E8);
                        totalmoney -= 70 * 1E8;
                        stage.updateQuestRecordExShare(100000, "totalmoney", String(totalmoney));
                        npc.meFlip().next().say("變更成功\r\n\r\n" + option.tabulation[Equip['soulOption']][parseInt(util.getItemReqLevel(Equip['itemId']) / 10)]);
                    }
                    break;
                case 2:
                    let is_char = [907, 2875, 2908, 3354, 4085, 1651];
                    if (is_char.indexOf(stage.getCharacterId()) > -1) {
                        if (!stage.isQuestCompleted(35666) || !stage.isQuestCompleted(35667)) {
                            if (npc.meFlip().askYesNo("檢測到你購買過創世技能 是否立即恢復?") == 1) {
                                stage.completeQuest(35666);
                                stage.completeQuest(35667);
                                npc.meFlip().say("已恢復");
                                return;
                            }
                        }
                    }
                    let bute_ins = [
                        1302355,
                        1212129,
                        1213022,
                        1214022,
                        1562010,
                        1222122,
                        1232122,
                        1242139,
                        1242141,
                        1252106,
                        1262051,
                        1272040,
                        1282040,
                        1292022,
                        1302355,
                        1312213,
                        1322264,
                        1332289,
                        1362149,
                        1372237,
                        1382274,
                        1402268,
                        1403022,
                        1412189,
                        1422197,
                        1432227,
                        1442285,
                        1452266,
                        1462252,
                        1472275,
                        1482232,
                        1492245,
                        1522152,
                        1532157,
                        1542128,
                        1552130,
                        1582044,
                        1592022,
                        1404022
                    ]
                    txt = "創世技能\r\n\r\n";
                    txt += "創世武器解封後需消耗 150億楓幣與150億綁金\r\n\r\n";
                    txt += "請選擇你想解封創世技能\r\n\r\n";
                    if (!stage.isQuestCompleted(35666)) {
                        txt += "\t\t#L0##s80002632:##l\t\t\t";
                    }
                    if (!stage.isQuestCompleted(35667)) {
                        txt += "#L1##s80002633:##l\r\n";
                    }
                    url_2 = npc.meFlip().askMenu(txt);

                    var Equip = stage.getItemBySlot(-1, -11);
                    if (Equip == null) {
                        npc.meFlip().say("抱歉..你沒有佩戴任何創世武器");
                        return;
                    }
                    if (bute_ins.indexOf(Equip['itemId']) <= -1) {
                        npc.meFlip().say("抱歉..你佩戴的武器並不是創世");
                        return;
                    }
                    var txt = "創世技能\r\n";
                    txt += "#d佩戴武器：#i" + Equip['itemId'] + "#\r\n";
                    txt += "#d解封技能：#s" + (url_2 == 0 ? 80002632 : 80002633) + "#\r\n";
                    txt += "#d消耗條件：#b150億楓幣 與 150億綁金\r\n\r\n";
                    txt += "\t\t\t#e#r是否立即解封當前技能?\r\n";
                    yeno = npc.meFlip().askYesNo(txt);

                    if (yeno != 1) return;

                    if (!stage.hasMesos(150 * 1E8)) {
                        npc.meFlip().say("抱歉..你沒有" + 150 * 1E8 + " 億楓幣");
                        return;
                    }
                    let totalmoney = parseInt(stage.getQuestRecordExShare(100000, "totalmoney") || 0);
                    if (isInputNaN(totalmoney)) {
                        stage.updateQuestRecordExShare(100000, "totalmoney", "0");
                    }
                    if (totalmoney < 150 * 1E8) {
                        npc.meFlip().say("抱歉..你沒有 " + 150 + " 綁金");
                        return;
                    }
                    stage.loseMesos(150 * 1E8);
                    totalmoney -= 150 * 1E8;
                    stage.updateQuestRecordExShare(100000, "totalmoney", String(totalmoney));
                    if (url_2 == 0) {
                        stage.completeQuest(35666);
                    } else {
                        stage.completeQuest(35667);
                    }
                    stage.dropAlertNotice("恭喜\r\n\r\n創世技能解封成功");
                    break;
                case 3:
                    var potential = [
                        [1212120, 1213018, 1214018, 1222113, 1232113, 1242121, 1242122, 1252098, 1262039, 1272017, 1282017, 1292018, 1302343, 1312203, 1322255, 1332279, 1342104, 1362140, 1372228, 1382265, 1402259, 1403018, 1412181, 1422189, 1432218,
                            1442274, 1452257, 1462243, 1472265, 1482221, 1492235, 1522143, 1532150, 1542117, 1552119, 1582023, 1592020, 1462254],
                        [1442285, 1312213, 1382274, 1252106, 1582044, 1452266, 1322264, 1522152, 1262051, 1592022, 1462252, 1332289, 1532157, 1402268, 1403022, 1272040, 1404022, 1472275, 1212129, 1213022, 1214022, 1542128, 1412189, 1282040, 1482232, 1222122, 1552130, 1422197, 1292022, 1492245, 1362149, 1232122, 1562010, 1432227, 1302355, 1372237, 1242139, 1242141, 1572010]
                    ]
                    var txt = "創世附加\r\n";
                    txt += "可以將神秘武器的附加潛能替換到現在正在裝備的創世武器上\r\n";
                    txt += "神秘武器放置[1]位置創世武器放置[2]位置\r\n";
                    txt += "#k附加潛能 39%物理/魔法攻擊力 #r498 星語幣\r\n";
                    txt += "#k附加潛能 36%物理/魔法攻擊力 #r298 星語幣\r\n";
                    txt += "#k附加潛能 33%物理/魔法攻擊力 #r128 星語幣\r\n";
                    txt += "#b置換後神秘武器會進行銷毀\r\n";
                    txt += "\r\n";
                    txt += "\t\t#r#L0#開始創世附加置換#l\r\n";
                    url_3 = npc.meFlip().askMenu(txt);

                    var Equip_1 = stage.getItemBySlot(1, 1);
                    if (Equip_1 == null) {
                        npc.meFlip().say("抱歉..[ 1 ] 不能留空");
                        return;
                    }
                    if (potential[0].indexOf(Equip_1['itemId']) <= -1) {
                        npc.meFlip().say("抱歉..[ 1 ] 位置的武器並不是神秘系列");
                        return;
                    }

                    var Equip_2 = stage.getItemBySlot(1, 2);
                    if (Equip_2 == null) {
                        npc.meFlip().say("抱歉..[ 2 ] 不能留空");
                        return;
                    }
                    if (potential[1].indexOf(Equip_2['itemId']) <= -1) {
                        npc.meFlip().say("抱歉..[ 2 ] 位置的武器並不是創世系列");
                        return;
                    }
                    var summary = {
                        39: 498,
                        36: 298,
                        33: 128,
                        40051: 13,
                        40052: 13,
                        30051: 10,
                        30052: 10
                    }
                    var Spotential = [];
                    Spotential[0] = summary[Equip_1.getOption4()] || 0;
                    Spotential[1] = summary[Equip_1.getOption5()] || 0;
                    Spotential[2] = summary[Equip_1.getOption6()] || 0;
                    Spotential[3] = Spotential[0] + Spotential[1] + Spotential[2];
                    if (Spotential[3] < 30) {
                        npc.meFlip().say("抱歉..當前你的神秘附加潛能不屬於置換範圍");
                        return;
                    }
                    Spotential[4] = summary[Spotential[3]];
                    var txt = "創世附加\r\n";
                    txt += "[ 1 ] #i" + Equip_1['itemId'] + "# #z" + Equip_1['itemId'] + "#\r\n";
                    txt += "[ 2 ] #i" + Equip_2['itemId'] + "# #z" + Equip_2['itemId'] + "#\r\n";
                    txt += "\r\n";
                    txt += "#b當前附加潛能共消耗 : #r" + Spotential[4] + "\r\n";
                    txt += "#b當前星語幣擁有 : #r" + G_money(stage, db) + "\r\n";
                    txt += "\r\n";
                    txt += "\t\t\t#r確認立即進行置換嗎？\r\n";
                    if (npc.meFlip().askYesNo(txt) != 1) return;
                    if (G_money(stage, db) < Spotential[4]) {
                        npc.meFlip().say("抱歉..你沒有 " + Spotential[4] + " 星語幣");
                        return;
                    }
                    Equip_2['grade'] = 20;
                    Equip_2.setOption4(Equip_1.getOption4());
                    Equip_2.setOption5(Equip_1.getOption5());
                    Equip_2.setOption6(Equip_1.getOption6());
                    stage.updateItemBySlot(1, 2);
                    D_money(stage, db, -Spotential[4]);
                    stage.removeItemBySlot(1, 1);
                    npc.meFlip().say("恭喜..置換成功");
                    break;

                case 4:
                    stage.runScript("expand/創世繼承")
                    break;
            }
            break;
        case 3:
            var txt = "\t\t創世潛能\r\n\r\n";
            txt += "將消耗 10 億楓幣開啟潛能 or 附加潛能效果\r\n";
            txt += "將創世勛章放置 [ 1 ] 位置\r\n";
            npc.meFlip().next().say(txt);
            var Equip = stage.getItemBySlot(1, 1);
            if (Equip == null || Equip['itemId'] != 1182285) {
                npc.meFlip().say("抱歉..[ 1 ] 位置不能留空!或並非創世勛章");
                return;
            }
            if (!stage.hasMesos(1E9)) {
                npc.meFlip().say("抱歉..你沒有 10 億楓幣");
                return;
            }
            stage.loseMesos(1E9);
            Equip.setGrade(20);
            Equip.setOption1(2002);
            Equip.setOption2(2002);
            Equip.setOption3(2002);
            Equip.setOption4(12002);
            Equip.setOption5(12002);
            Equip.setOption6(12002);
            stage.updateItemBySlot(1, 1);
            stage.dropAlertNotice("恭喜..勛章已開啟潛能");
            break;
        case 4:
        case 5:
            //composite["0"](npc, stage);
            break;
        case 9:
            if (stage.getLevel() < 150) {
                npc.meFlip().say("抱歉..低於 150 級禁止使用!必須達到150級且滿足4轉條件!");
                return;
            }
            stage.maxAllSkill();
            npc.meFlip().say("已滿技能!");
            break;
        case 12:
            stage.runScript("expand/Anvil")
            break;
        case 6:
            let jon = [
                [6000, 6100, 6110, 6111, 6112],
                [6001, 6500, 6510, 6511, 6512]
            ];
            var txt = "如果使用強制更換功能,請先卸下你的副手!\r\n";
            txt += "可以使用卸下副手的功能取下副手!(取下後的副手位置會被木盾替代)\r\n";
            txt += "需要強制裝的副手請放置 請放到 [ 1 ] 位置\r\n";
            txt += "\r\n";
            txt += "#L0#強制上副手#l\t\t#L1#卸下副手#l\r\n";
            url_6 = npc.meFlip().askMenu(txt);

            switch (url_6) {
                case 0:
                    var judge = false;
                    var num = null;
                    for (var i in jon) {
                        if (jon[i].indexOf(stage.getJob()) > -1) {
                            judge = true;
                            num = i;
                        }
                    }
                    if (!judge) {
                        npc.meFlip().say("抱歉..你不是狂龍戰士或天使職業");
                        return;
                    }
                    if (stage.getLevel() < 10) {
                        npc.meFlip().say("抱歉。。等級必須大於10");
                        return;
                    }
                    var Equip = stage.getItemBySlot(-1, -10);
                    if (Equip != null) {
                        npc.meFlip().say("抱歉..你現在擁有副手不可以強制佩戴");
                        return;
                    }
                    stage.equipped(-10, (num == 0 ? 1352500 : 1352600));
                    npc.meFlip().say("佩戴成功");
                    break;
                case 1:
                    stage.equipped(-10, 1092003);
                    break;
            }
            break;
        case 7:
            stage.increaseEquipInvSlot(128);
            stage.increaseConsumeInvSlot(128);
            stage.increaseEquipInvSlot(128);
            stage.increaseEtcInvSlot(128);
            stage.increaseInstallInvSlot(128);
            stage.increaseTrunkCapacity(128);
            stage.dropAlertNotice("擴充成功");
            break;
        case 8:
            let quest = [31161, 31529, 66949, 66950, 32240, 62395, 62396, 23220, 101052, 101289, 17007, 3475, 3476, 3477, 3478, 3479, 3480, 3481, 3482, 3483, 3484, 3485, 3486, 3487, 3488, 3489, 3490, 3491, 3492, 3493, 3494, 3495, 3496,
                3462, 3463, 3468, 3469, 3470, 3471, 65851, 31533, 3138, 3139, 3140, 3141, 3142, 3157, 3163, 3164, 3165, 3166, 3167, 3168, 3169, 3170, 3171, 1600, 1601, 1602, 1607, 1608, 1616, 1617, 1618, 1619, 1620, 1621, 1622, 1623, 1624, 1625, 1626, 1627, 1628, 1629, 1630, 1631, 1632, 1633, 1634, 1635, 1636, 1637, 1638, 1639,
                58914, 58916, 58917, 58918, 58919, 58920, 58921, 58922, 58923, 58924, 58925, 58926, 58927, 58928, 58929, 58930, 58931, 58932, 58933, 58934, 58936, 58937, 58938, 58939, 58940, 58941, 58942, 58943, 58944, 58945, 58946, 58947, 58963, 58964, 58965, 58966, 58967, 58968, 17523, 17524, 17525, 17526, 17527, 17528, 17529, 17530, 17531, 17532, 17533, 17534,
                3500, 3501, 3502, 3503, 3504, 3505, 3506, 3507, 3508, 3509, 3510, 3511, 3512, 3513, 3514, 3515, 3516, 3517, 3518, 3519, 3520, 3521, 3522, 3523, 3524, 3525, 3526, 3527, 3528, 3529, 3530, 3531, 3532, 3533, 3534, 3535, 3536, 3537, 3538, 15095, 31124, 31125, 31126, 31127, 31128, 31132, 31133, 31134, 31135, 31136, 31141, 31142, 31143, 31145, 31146, 31147, 31148, 31149, 31150, 31151, 31152, 31153, 31154, 31155, 31156,
                33120, 33121, 33122, 33123, 33124, 33125, 34300, 34301, 34302, 34303, 34304, 34305, 34306, 34307, 34308, 34309, 34310, 34311, 34312, 34313, 34314, 34315, 34316, 34317, 34318, 34319, 34320, 34321, 34322, 34323, 34324, 34325, 34326, 34327, 34328, 34329, 34330, 34331, 34370, 34371, 34372, 34373, 34374, 34375, 34561, 34562, 34563, 34564, 34565, 34566, 34567, 34568, 34569, 34570, 34571, 34572, 34573, 34574, 34575, 34576, 34577, 34578, 34579, 34580, 34581, 34582, 34583, 34584, 34585, 34586, 34591,
                35600, 35601, 35602, 35603, 35604, 35605, 35606, 35607, 35608, 35609, 35610, 35611, 35612, 35613, 35614, 35615, 35616, 35617, 35618, 35619, 35620, 35621, 35622, 35623, 35624, 35625, 35626, 35627, 35628, 35629, 35630, 35631, 35632, 35635, 35700, 35701, 35702, 35703, 35704, 35705, 35706, 35707, 35708, 35709, 35710, 35711, 35712, 35713, 35714, 35715, 35716, 35717, 35718, 35719, 35720, 35721, 35722, 35723, 35724, 35725, 35726, 35727, 35728, 35729, 35730, 35731, 35740, 35756,
                35800, 35801, 35802, 35803, 35804, 35805, 35806, 35807, 35808, 35809, 35810, 35811, 35812, 35813, 35814, 35815, 1484, 39712, 39713, 39714, 39715, 39716, 39717, 39718, 39719, 39720, 39721, 39722, 39740, 39801, 39802, 39803, 39804, 39805, 39806, 39807, 39808, 39809, 39810, 39811, 39812, 39813, 39814, 39815, 39816, 39817, 39818, 39901, 39902, 39903, 39904, 39905, 39906, 39907, 39908, 39909, 39910, 39911, 39912, 39913, 39914, 39915, 39916, 39917, 39918, 39919, 39920, 39921,
                38201, 38202, 38203, 38204, 38205, 38206, 38207, 38208, 38209, 38210, 38211, 38212, 38213, 38214, 38305, 38310, 38317, 39917, 35807, 35728, 35622, 37916, 34570, 34257, 34471, 34318, 37726, 34200, 37620, 34114, 33565,
                6995, 35600, 101456, 37151, 55433, 55434, 55435, 31100, 6500, 1466, 35651, 39701, 39081, 36401, 39079, 34249, 34841, 15642, 33125, 33127, 33136, 33137, 33138, 33139, 33140, 33141, 33142, 33143, 33144, 33145, 33146, 33147, 33148, 33149, 33157, 33171, 33172, 33173, 33174, 33175, 33176, 33178, 33179, 33180, 33185, 33186, 33187, 33189, 33190, 33191, 33192, 33193, 33194, 33195, 33196, 33197, 33198, 33201, 33207, 33208, 33223, 33243, 33265, 33267, 33270, 33271, 33272, 33273, 33274, 33275, 33276, 33277, 33278, 33279, 33280, 33281, 33282, 33283, 33284, 33285, 33286, 33287, 33288, 33289, 33294, 33304, 33305, 33306, 33307, 33308, 33309, 33310, 33311, 33312, 33313, 33314, 33317, 33318, 33319, 33320, 39131, 39132, 39133, 39134, 39135, 39136, 39141, 39142, 39143, 39144, 39145, 39146, 39147, 39148, 39149, 39150, 39151, 39152, 39153, 39154, 39155, 39163, 39164, 39206, 64382, 502813,
                34230, 34231, 34232, 34233, 34234, 34235, 34236, 34237, 34238, 34239, 34240, 34241, 34242, 34243, 34244, 34249, 34250, 34251, 34252, 34253, 34254, 34255, 34256, 34257, 34258, 34259, 34260, 34261, 34262, 34263, 34264, 34265, 34266, 34267, 34268, 34269, 34272, 34275, 34595, 39079, 39080, 100845, 100962, 101223, 101404, 36401, 36402, 36403, 36404, 36405, 36406, 36407, 36408, 34450, 34451, 34452, 34453, 34454, 34455, 34456, 34459, 34460, 34461, 34462, 34463, 34464, 34465, 34466, 34467, 34468, 34469, 34470, 34471, 34472, 34473, 34474, 34475, 34476, 34477, 34478, 34491, 34492, 39035, 39327, 39368, 100843, 100960, 101221, 101403, 34300, 34301, 34302, 34303, 34304, 34305, 34306, 34307, 34308, 34309, 34310, 34311, 34312, 34313, 34314, 34315, 34316, 34317, 34318, 34319, 34320, 34321, 34322, 34323, 34324, 34325, 34326, 34327, 34328, 34329, 34330, 34331, 34332, 34333, 34334, 34336, 34378, 37006, 100841, 100958, 101219, 101402, 15723, 15724, 34200, 34201, 34202, 34203, 34204, 34205, 34206, 34207, 34208, 34209, 34210, 34211, 34212, 34213, 34214, 34215, 34216, 34217, 34218, 34227, 34228, 39014, 39072, 39365, 100839, 100956, 101217, 101401, 36010, 36011, 36012, 36013, 36016, 36019, 25760, 25873, 31442, 34841, 34966, 36252, 39440, 39573, 23666, 31800, 31811, 31812, 31852, 34647, 34701, 34839, 34840, 34952, 34965, 3625, 38029, 39432, 39439, 39572, 59269, 25760, 25873, 31442, 34841, 34966, 36252, 39440, 39573, 59835, 1349, 15091, 15092, 15093, 15094, 15096, 15650, 16338, 30000, 30002, 30003, 30004, 30005, 30006, 30007, 30008, 30009, 30010, 30011, 30012, 30013, 30014, 30015, 30016, 30017, 30018, 30019, 30020, 30021, 30022, 30027, 52668, 52669, 52670, 52671, 52955, 52956, 52957, 52958, 52959, 52960, 52961, 52962, 52963, 52964, 52965, 52966, 52967, 52968, 55076, 55082, 55083, 55084, 55085, 55086, 55087, 55088, 55089, 55090, 55091, 55092, 55093, 55094, 55095, 1344, 1600, 1601, 1602, 1607, 1608, 1616, 1617, 1618, 1619, 1620, 1621, 1622, 1623, 1624, 1625, 1626, 1627, 1628, 1629, 1630, 1631, 1632, 1633, 1634, 1635, 1636, 1637, 1638, 1639, 1644, 1645, 1646, 1647, 1653, 1654, 1655, 1656, 1657, 1658, 1659, 1660, 1661, 1662, 1663, 1664, 1665, 1666, 1667, 1668, 1669, 1670, 1671, 1672, 1673, 1674, 1675, 1693, 1694, 1695, 31165, 31166, 31167, 31168, 31169, 31170, 31171, 31172, 31173, 31174, 31175, 31176, 31177, 31178, 31179, 31180, 36652, 36653, 36654, 36655, 36656, 52247, 55073, 55260, 64361, 64365, 57605, 57606, 58025, 58026, 58927, 58940, 58968, 501814, 502864, 15241, 15242, 15243, 15244, 33916, 33917, 33920, 33921, 33922, 33923, 33924, 33925, 33926, 33928, 33929, 33930, 33934, 33935, 33947, 33948, 33949, 33950, 33951, 33953, 33954, 33955, 33956, 33957, 33958, 33967, 33968, 33969, 33971, 33972, 33973, 33974, 33975, 33976, 33977, 33993, 33994, 34001, 34003, 34004, 34005, 34006, 34007, 34009, 34010, 34011, 34012, 34013, 34014, 34015, 34023, 61336, 61344, 61345, 64384, 502813, 1331, 1487, 16991, 25780, 25878, 26439, 26442, 29997, 31533, 31732, 31733, 31840, 31851, 31854, 32703, 36103, 100084, 100098, 501263, 501479, 502254, 502546, 57605, 57606, 58025, 58026, 58927, 58940, 58968, 501814, 502864, 57377, 57378, 12820, 12821, 12822, 12823, 12824, 12825, 12826, 12827, 12828, 12829, 12830, 12831, 12832, 12833, 12834, 12835, 12836, 25711, 25712, 25713, 25720, 25721, 25722, 25867, 25870, 25872, 25891, 25895, 29987, 29988, 29989, 29990, 31421, 31499, 31600, 31611, 31651, 31656, 31848, 31849, 31400, 31801, 25781,
                101098, 101099, 101032, 101103, 101036, 101037, 101038, 101104, 101039, 101105, 101048, 101107, 101051, 101053, 101057, 101058, 101064, 101065, 101111, 101067, 101069, 101070, 101071, 101286, 101287, 101288, 101109, 101045, 101067, 101068, 101069, 101070, 101071, 101096, 101097, 101098, 101099, 101100, 101101, 101102, 101103, 101104, 101105, 101106, 101107, 101108, 101109, 101110, 101111, 101171, 101172, 101286, 101287, 101288, 101289, 101497, 101056, 101063, 16013, 39300, 39302, 39304, 39306, 39308, 39310, 39311, 39312, 39313, 39314, 39315, 39316, 39317, 39319, 39322, 39323, 39324, 39325, 39328, 39329, 39330, 39331, 39334, 39335, 39336, 39337, 39338, 39341, 39342, 39343, 39344, 39345, 39346, 39347, 39348, 39349, 39350, 39351, 39352, 39353, 39354, 39355, 39356, 39357, 39358, 39359, 39360, 39370, 39373, 100985, 100986, 100987, 100988, 100989, 100990, 100991, 100992, 100993, 100994, 100995, 100996, 100997, 100998, 100999, 101000, 101001, 101002, 101003, 101004, 101005, 101006, 101007, 101008, 101009, 101010, 101011, 101012, 101013, 101014, 101015, 101016, 101017, 101019, 101020, 101021, 101022, 101023, 101024, 101025, 101026, 101027, 101028, 101029, 101030, 101031, 101032, 101033, 101034, 101035, 101036, 101037, 101038, 101039, 101040, 101041, 101042, 101043, 101044, 101045, 101046, 101047, 101048, 101049, 101050, 101051, 101052, 101053, 101054, 101055, 101056, 101057, 101058, 101059, 101060, 101061, 101062, 101063, 101064, 101065, 101066, 101067, 101068, 101069, 101070, 101071, 101091, 101092, 101093, 101094, 101095, 101096, 101097, 101098, 101099, 101100, 101101, 101102, 101103, 101104, 101105, 101106, 101107, 101108, 101109, 101110, 101111, 101171, 101172, 101286, 101287, 101288, 101289
            ];
            if (player.getPQLog(stage, db, "每日燈泡") > 0) {
                return;
            }
            for (var i in quest) {
                if (stage.isQuestStarted(quest[i])) {
                    stage.completeQuest(quest[i]);
                } else {
                    if (!stage.isQuestCompleted(quest[i])) {
                        stage.completeQuest(quest[i]);
                    }
                }
            }
            player.addPQLog(stage, db, "每日燈泡");
            stage.dropAlertNotice("清理結束");
            break;
        case 10:
            var skills = [
                [80000400, 15, "STR"],
                [80000401, 15, "DEX"],
                [80000402, 15, "INT"],
                [80000403, 15, "LUK"],
                [80000404, 15, "HP"],
                [80000405, 15, "MP"],
                [80000406, 15, "DF"],
                [80000409, 15, "發動暴擊"],
                [80000410, 15, "暴擊傷害"],
                [80000412, 15, "無視防禦"],
                [80000413, 15, "傷害"],
                [80000414, 15, "BOSS傷害"],
                [80000416, 15, "狀態異常抗性"],
                [80000419, 15, "攻擊力魔力"],
                [80000420, 15, "獲得經驗值"],
                [80000421, 15, "秘法符文"],
                [80000422, 15, "一般傷害"]
            ]
            var txt = "\t\t\t超級屬性 ( #r方案套用將重置屬性#k )\r\n\r\n";
            for (var i in skills) {
                txt += "#L" + i + "##b提升 #r" + marinString(" ", 16, skills[i][2].toString()) + "#d < #b" + marinString(" ", 3, stage.getSkillLevel(skills[i][0]).toString()) + "#d > MAX < #r" + marinString(" ", 3, skills[i][1].toString()) + "#d >#l\r\n";
            }
            url_10 = npc.meFlip().askMenu(txt);

            var txt = "\t\t\t\t超級屬性\r\n\r\n";
            txt += "　提升 " + skills[url_10][2] + "\r\n";
            txt += "　級別 " + stage.getSkillLevel(skills[url_10][0]) + "\r\n";
            txt += "　上限 " + skills[url_10][1] + "\r\n";
            txt += "　消耗 每點消耗 2000萬 楓幣\r\n";
            txt += "\r\n\r\n ";
            num = npc.meFlip().minNum(1).maxNum(skills[url_10][1] - stage.getSkillLevel(skills[url_10][0])).defNum(1).askNumber(txt);

            count = num * 2E7;
            if (!stage.hasMesos(count)) {
                npc.meFlip().say("抱歉..你沒有 " + num * 2E7 + " 楓幣");
                return;
            }
            stage.loseMesos(count);
            stage.changeSkillLevel(skills[url_10][0], stage.getSkillLevel(skills[url_10][0]) + num);
            npc.meFlip().say("恭喜...提升成功");
            break;
        case 11:
            var marin = [
                [3101, 3120, 3121, 3122],//惡魔復仇者
                [4002, 4200, 4210, 4211, 4212, 14200, 14210, 14211, 14212],//沒有藍條的
                [210, 211, 212, 220, 221, 222, 230, 231, 232, 3200, 3210, 3211, 3212, 2700, 2710, 2711, 2712, 2200, 2211, 2214, 2217, 16200, 16210, 16211, 16212, 1200, 1210, 1211, 1212, 15200, 15210, 15211, 15212],//法師數組
                [3100, 3110, 3111, 3112]//惡魔獵手的ID
            ]
            txt = "\r\n";
            txt += "#L0#增加2萬血量 ( #b惡魔復仇者與法師不適用#k 　　)#l\r\n\r\n";
            txt += "#L1#增加1萬藍量 ( #b法師與沒有藍條的職業不適用#k )#l\r\n\r\n";
            txt += "#L2#增加8k血量與2.2萬藍量 ( #b法師專用 沒藍條的增加2萬血量#k )#l\r\n\r\n";
            txt += "#L3##i1142722:#惡魔復仇者專用徽章#l\r\n";
            url_11 = npc.meFlip().askMenu(txt);

            if (npc.meFlip().askYesNo("你確定你選擇的模式適合你當前職業嗎?") != 1) return;

            if (player.getPQLog(stage, db, "血量效驗S") > 0) {
                npc.meFlip().say("抱歉..你使用過當前功能了");
                return;
            }
            switch (url_11) {
                case 3:
                    if (marin[0].indexOf(stage.getJob()) <= -1) {
                        npc.meFlip().say("抱歉..當前職業禁止使用此功能");
                        return;
                    }
                    if (marin[3].indexOf(stage.getJob()) > -1) {
                        npc.meFlip().say("抱歉..惡魔獵手不允許使用此功能");
                        return;
                    }
                    stage.gainItem(1142722, 1)
                    player.addPQLog(stage, db, "血量效驗S", 1, 3650);
                    npc.meFlip().say("恭喜,已成功獲取");
                    break;

                default:
                    if (marin[0].indexOf(stage.getJob()) > -1) {
                        npc.meFlip().say("抱歉..惡魔復仇者不允許使用當前功能");
                        return;
                    }
                    switch (url_11) {
                        case 0:
                            if (marin[1].indexOf(stage.getJob()) > -1) {
                                npc.meFlip().say("抱歉..法師不可以使用此功能");
                                return;
                            }
                            stage.increaseMaxHp(20000);
                            break;
                        case 1:
                            if (marin[3].indexOf(stage.getJob()) > -1) {
                                npc.meFlip().say("抱歉..惡魔獵手不允許使用此功能");
                                return;
                            }
                            if (marin[1].indexOf(stage.getJob()) > -1) {
                                npc.meFlip().say("抱歉..沒有藍條的職業不允許使用");
                                return;
                            }
                            if (marin[2].indexOf(stage.getJob()) > -1) {
                                npc.meFlip().say("抱歉..法師職業不允許使用");
                                return;
                            }
                            stage.increaseMaxMp(10000);
                            break;
                        case 2:
                            if (marin[3].indexOf(stage.getJob()) > -1) {
                                npc.meFlip().say("抱歉..惡魔獵手不允許使用此功能");
                                return;
                            }
                            if (marin[1].indexOf(stage.getJob()) > -1) {
                                stage.increaseMaxHp(20000);
                            } else {
                                if (marin[2].indexOf(stage.getJob()) > -1) {
                                    stage.increaseMaxHp(8000);
                                    stage.increaseMaxMp(20000);
                                } else {
                                    npc.meFlip().say("抱歉..你不是法師或存在藍條");
                                    return;
                                }
                            }
                            break;
                    }
                    player.addPQLog(stage, db, "血量效驗S", 1, 3650);
                    npc.meFlip().say("恭喜,已成功增加");
                    break;
            }
            break;
        case 13:
            var txt = "請將要使用的裝備放在第一個位置,每次需 [ #r1#k ]億楓幣\r\n";
            txt += "請選擇需要消耗的錘子類型\r\n";
            txt += "#r(必須使用錘子手動進行+1才允許使用此功能)#k\r\n\r\n";
            txt += "#L0#剩餘 " + stage.getItemQuantity(2472001) + " 把#i2472000:##z2472000##l\r\n";
            url_13 = npc.meFlip().askMenu(txt);

            txt = "請輸入你想使用的個數 (當前擁有#z2472000# x " + stage.getItemQuantity(2472001) + ")\r\n\r\n ";
            var num = npc.meFlip().minNum(1).maxNum(stage.getItemQuantity(2472001)).defNum(1).askNumber(txt);

            txt = "請輸入期望達到的等級 ( #r必須大於當前自身等級#k )\r\n\r\n ";
            var lv = npc.meFlip().minNum(1).maxNum(5).defNum(1).askNumber(txt);

            if (!stage.hasMesos(1E8)) {
                npc.meFlip().say("抱歉..你沒有 1E 楓幣");
                return;
            }
            var Equip = stage.getItemBySlot(1, 1);
            var puc = Equip['puc'];

            if (Equip == null) {
                npc.meFlip().say("抱歉..【1】位置不能留空");
                return;
            }

            if (puc <= 0) {
                npc.meFlip().say("抱歉..必須強化過一回的物品才允許使用");
                return;
            }
            if (puc >= 5) {
                npc.meFlip().say("抱歉..最大值 5 級不能使用了");
                return;
            }
            if (lv <= puc) {
                npc.meFlip().say("抱歉..期望等級不能小於自身等級");
                return;
            }
            stage.loseMesos(1E8);
            txt = "";
            var sum = 0;
            var successRates = {
                1: 20,
                2: 8,
                3: 4,
                4: 2,
            };
            while (num > 0 && puc < lv) {
                sum += 1;
                var random = getRandom(1, 100);
                var success = random <= successRates[puc];
                if (success) {
                    puc += 1;
                    Equip['puc'] = puc;
                    Equip['ruc'] += 1;
                    stage.updateItemBySlot(1, 1);
                    txt += "第 " + sum + " 次[ #r#z2472000#成功,增加一次強化次數#k ]\r\n";
                } else {
                    txt += "第 " + sum + " 次[ #b#z2472000#失敗,未增加強化次數#k ]\r\n";
                }
                num -= 1;
                stage.loseItem(2472001, 1);
                if (puc >= lv) {
                    break;
                }
            }
            npc.meFlip().say(txt);
            break;
        case 14:
            var txt = "請選擇你要綁定的類型\r\n";
            txt += "選擇綁定的類型後要將物品放置 [ 1 ]位置\r\n";
            txt += "將該物品的技能綁定至 角色技能欄\r\n"
            txt += "< #r 不可佩戴擁有此技能的耳環和胸章,否則會重置綁定#k >\r\n";
            txt += "\r\n";
            txt += "#L0##i1032261:# 消耗 2 億楓幣#l\r\n"
            txt += "#L1##i1182158:# 消耗 3 億楓幣#l\r\n";
            txt += "#L2##i1033000:# 消耗 5 億楓幣#l\r\n";
            url_14 = npc.meFlip().askMenu(txt);

            switch (url_14) {
                case 0:
                    if (!stage.hasMesos(2E8)) {
                        npc.meFlip().say("抱歉..你沒有2億楓幣");
                        return;
                    }
                    if (npc.meFlip().askYesNo("確認將#i1032261:#物品綁定至角色內嗎?") == 1) {
                        Equip = stage.getItemBySlot(6, 1);
                        if (Equip == null || Equip['itemId'] != 1032261) {
                            npc.meFlip().say("抱歉..[1]不能留空 or [1]位置物品並不是#i1032261:#");
                            return;
                        }
                        stage.loseMesos(2E8);
                        stage.changeSkillLevel(80011302, 1);
                        stage.removeItemBySlot(6, 1);
                        npc.meFlip().say("綁定成功");
                    }
                    break;

                case 1:
                    if (!stage.hasMesos(3E8)) {
                        npc.meFlip().say("抱歉..你沒有3億楓幣");
                        return;
                    }
                    if (npc.meFlip().askYesNo("確認將#i1182158:#物品綁定至角色內嗎?") == 1) {
                        Equip = stage.getItemBySlot(1, 1);
                        if (Equip == null || Equip['itemId'] != 1182158) {
                            npc.meFlip().say("抱歉..[1]不能留空 or [1]位置物品並不是#i1182158:#");
                            return;
                        }
                        stage.loseMesos(3E8);
                        stage.changeSkillLevel(80011158, 1);
                        stage.changeSkillLevel(80011159, 1);
                        stage.removeItemBySlot(1, 1);
                        npc.meFlip().say("綁定成功");
                    }
                    break;

                case 2:
                    if (!stage.hasMesos(5E8)) {
                        npc.meFlip().say("抱歉..你沒有5億楓幣");
                        return;
                    }
                    if (npc.meFlip().askYesNo("確認將#i1033000:#物品綁定至角色內嗎?") == 1) {
                        Equip = stage.getItemBySlot(6, 1);
                        if (Equip == null || Equip['itemId'] != 1033000) {
                            npc.meFlip().say("抱歉..[1]不能留空 or [1]位置物品並不是#i1033000:#");
                            return;
                        }
                        stage.loseMesos(5E8);
                        stage.changeSkillLevel(80011540, 1);
                        stage.removeItemBySlot(6, 1);
                        npc.meFlip().say("綁定成功");
                    }
                    break;
            }
            break;
        case 15:
            var marin = [
                [1004808, 1004809, 1004810, 1004811, 1004812],
                [1052723],
                [1190544]
            ];
            var bute = [
                [1005980, 1005981, 1005982, 1005983, 1005984],
                [1042433, 1042434, 1042435, 1042436, 1042437, 1062285, 1062286, 1062287, 1062288, 1062289],
                [1190555, 1190556, 1190557, 1190558, 1190559]
            ]
            var txt = "裝備繼承\r\n\r\n";
            txt += "將#r神秘帽子#k的捲軸 星力 潛能 火花\r\n";
            txt += "全部繼承到#b永恆帽子#k\r\n";
            txt += "繼承完畢 #r神秘帽子 #k消失 手續 #r500億楓幣與5個#i2634472#\r\n";
            txt += "#k將#r滅龍#k的捲軸 星力 潛能 火花\r\n";
            txt += "全部繼承到#r永恆 上衣 / 下衣\r\n";
            txt += "#k繼承完畢 #r滅龍#k 消失 手續 300億楓幣與3個#i2634472#\r\n";
            txt += "屬性物品放置 [1] 位置 繼承給 [2] 位置的永恆\r\n";
            txt += "#r覺醒的記憶徽章繼承到米特拉的憤怒 收取100億楓幣\r\n";
            if (npc.meFlip().askYesNo(txt) != 1) return;
            var Equip = stage.getItemBySlot(1, 1);
            if (Equip == null) {
                stage.dropAlertNotice("[1]位置不能留空");
                return;
            }

            var index = null;
            for (var i in marin) {
                if (marin[i].indexOf(Equip['itemId']) > -1) {
                    index = i;
                }
            }
            if (index == null) {
                stage.dropAlertNotice("抱歉..當前物品不能進行繼承");
                return;
            }
            var SEquip = stage.getItemBySlot(1, 2);
            if (SEquip == null) {
                npc.meFlip().say("抱歉..[2]位置不能留空");
                return;
            }
            if (bute[index].indexOf(SEquip['itemId']) <= -1) {
                npc.meFlip().say("抱歉..你[2]位置的物品並不是永恆");
                return;
            }
            var txt = "裝備繼承\r\n\r\n";
            txt += "當前物品：#i" + Equip['itemId'] + "#\r\n";
            txt += "繼承物品：#i" + SEquip['itemId'] + "#\r\n";
            if (index == 2) {
                txt += "消耗 100 億楓幣\r\n\r\n";
            } else {
                txt += "消耗 " + (index == 0 ? 500 : 300) + " 億楓幣 " + (index == 0 ? 5 : 3) + " 個#i2634472#\r\n\r\n";
            }
            if (npc.meFlip().askYesNo(txt) != 1) return;
            switch (parseInt(index)) {
                case 0:
                    if (!stage.hasMesos(500 * 1E8)) {
                        npc.meFlip().say("抱歉..你沒有 500 億楓幣");
                        return;
                    }
                    if (!stage.hasItem(2634472, 5)) {
                        npc.meFlip().say("抱歉..你沒有 5 個 #i" + 2634472 + "#");
                        return;
                    }
                    stage.loseMesos(500 * 1E8);
                    stage.loseItem(2634472, 5);
                    break;
                case 1:
                    if (!stage.hasMesos(300 * 1E8)) {
                        npc.meFlip().say("抱歉..你沒有 300 億楓幣");
                        return;
                    }
                    if (!stage.hasItem(2634472, 3)) {
                        npc.meFlip().say("抱歉..你沒有 3 個 #i" + 2634472 + "#");
                        return;
                    }
                    stage.loseMesos(300 * 1E8);
                    stage.loseItem(2634472, 3);
                    break;
                case 2:
                    if (!stage.hasMesos(100 * 1E8)) {
                        npc.meFlip().say("抱歉..你沒有 100 億楓幣");
                        return;
                    }
                    stage.loseMesos(100 * 1E8);
                    break;
            }
            var SITEMID = SEquip['itemId'];
            marinchange(stage, util, 1, Equip, SITEMID, true, 0);
            stage.removeItemBySlot(1, 2);
            npc.meFlip().say("恭喜..繼承成功");
            break;
        case 16:
            var marin = {
                /* 航海武器 */
                2: [[1404017, 1212115, 1213017, 1214017, 1222109, 1232109, 1242116, 1252093, 1262017, 1272016, 1292017, 1302333, 1312199, 1332274, 1362135, 1372222, 1382259, 1402251, 1403017, 1412177, 1422184, 1432214, 1442268, 1452252, 1462239, 1472261, 1482216, 1492231, 1522138, 1532144, 1542108, 1552110, 1582017, 1592019]],

                /* 神秘武器 */
                10: [[1212120, 1213018, 1214018, 1222113, 1232113, 1242121, 1242122, 1252098, 1262039, 1272017, 1282017, 1292018, 1302343, 1312203, 1322255, 1332279, 1342104, 1362140, 1372228, 1382265, 1402259, 1403018, 1412181, 1422189, 1432218,
                    1442274, 1452257, 1462243, 1472265, 1482221, 1492235, 1522143, 1532150, 1542117, 1552119, 1582023, 1592020]],

                /* 航海防具 */
                1: [[1004422, 1004423, 1004424, 1004425, 1004426, 1005823, 1052882, 1052887, 1052888, 1052889, 1052890, 1073030, 1073032, 1073033, 1073034, 1073035, 1082636, 1082637, 1082638, 1082639, 1082640, 1102775, 1102794, 1102795, 1102796, 1102797]],

                /* 神秘防具 */
                5: [[1004808, 1004809, 1004810, 1004811, 1004812, 1053063, 1053064, 1053065, 1053066, 1053067, 1073158, 1073159, 1073160, 1073161, 1073162, 1082695, 1082696, 1082697, 1082698, 1082699, 1102940, 1102941, 1102942, 1102943, 1102944, 1152196, 1152197, 1152198, 1152199, 1152200]],

                /* 永恆帽子 */
                100: [[1005980, 1005981, 1005982, 1005983, 1005984]],
                101: [[1442285, 1312213, 1382274, 1252106, 1582044, 1452266, 1322264, 1522152, 1262051, 1592022, 1462252, 1332289, 1532157, 1402268, 1403022, 1272040, 1404022, 1472275, 1212129, 1213022, 1214022, 1542128, 1412189, 1282040, 1482232, 1222122, 1552130, 1422197, 1292022, 1492245, 1362149, 1232122, 1562010, 1432227, 1302355, 1372237, 1242139, 1242141, 1572010]],
                /* 永恆上衣 下裙 */
                50: [[1042433, 1042434, 1042435, 1042436, 1042437, 1062285, 1062286, 1062287, 1062288, 1062289]],

                200: [[1092088, 1092089, 1099011, 1099012, 1098006, 1352013, 1342095, 1352113, 1352209, 1352219, 1352229, 1352239, 1352249, 1352259, 1352269, 1352279, 1352289, 1352299, 1352410, 1352510, 1352610, 1352711, 1352819, 1352831, 1352867, 1352909, 1352919, 1352938, 1352948, 1352978, 1352981,
                    1352990, 1353010, 1353105, 1353105, 1353205, 1353306, 1353405, 1353505, 1353606, 1353707, 1353807, 1353900, 1354007, 1354017, 1354027, 1354037, 1552133, 1099015]]
            }
            var bute = [1005823, 1005952, 1006014, 1006025, 1006026, 1073554, 1073616, 1073651, 1073652, 1073653, 1082754, 1082759, 1082766, 1082767, 1082768, 1103352, 1103418, 1103465, 1103466, 1103467, 1152209, 1152211, 1152217, 1152218, 1152219]
            crl = 0;
            var txt = "裝備轉換\r\n\r\n";
            txt += "目前支持轉換的類型#r航海/神秘/永恆武器 #bor#r 防具/飾品#k\r\n";
            txt += "可將這些類型的物品變更成其他職業\r\n";
            txt += "變更時可消耗星語幣\r\n\r\n";
            txt += "#L0#我已閱讀明白開始變更#l";
            url_16 = npc.meFlip().askMenu(txt);

            var Equip = stage.getItemBySlot(1, 1);
            if (Equip == null) {
                npc.meFlip().say("抱歉..[1]位置不能留空");
                return;
            }
            if (bute.indexOf(Equip['itemId']) > -1) {
                npc.meFlip().say("抱歉.該類型航海禁止轉換 ");
                return;
            }
            var result = getEquipCareer(Equip['itemId'], marin);
            if (result) {
                var careerId = result.careerId;
                var equipList = result.equipList;
                if (careerId == 200) {
                    var txt = "#d當前消耗楓幣 : #r" + 10 + " 億#d < #b請下列選擇變更職業物品#d >\r\n";
                } else {
                    var txt = "#d當前消耗星語幣 : #r" + careerId + "#d < #b請下列選擇變更職業物品#d >\r\n";
                }
                txt += "當前待變更物品:#i" + Equip['itemId'] + "# #z" + Equip['itemId'] + "#\r\n\r\n";
                for (var i in equipList) {
                    if (getItemType(Equip['itemId']) != getItemType(equipList[i])) continue;
                    if (Equip['itemId'] == equipList[i]) continue;
                    txt += "#L" + i + "##i" + equipList[i] + "# #z" + equipList[i] + "##l\r\n";
                }
                url_16_0 = npc.meFlip().askMenu(txt);

                if (careerId == 200) {
                    var txt = "#d當前消耗楓幣 : #r" + (10 * 1E8) + "\r\n";
                } else {
                    var txt = "#d當前消耗星語幣 : #r" + careerId + "\r\n";
                }
                txt += "#d變更前：#i" + Equip['itemId'] + "# #z" + Equip['itemId'] + "#\r\n";
                txt += "#d變更後：#i" + equipList[url_16_0] + "# #z" + equipList[url_16_0] + "#\r\n";
                txt += "\r\n";
                txt += "#d請選擇保留的屬性\r\n";
                txt += "#b保留捲軸：#r將保留除附加潛能之外的所有屬性\r\n";
                txt += "#b保留潛能:#r將保留除卷軸之外的所有屬性\r\n";
                txt += "\r\n#k";
                if (careerId == 101) {
                    txt += "#b#L2#創世專屬無損變更屬性#l\r\n";
                } else {
                    txt += "#b#L0#保留捲軸屬性#l\r\n";
                    txt += "#d#L1#保留潛能屬性( #r不包含捲軸屬性#d )#l\r\n";
                }
                crl = npc.meFlip().askMenu(txt);

                if (careerId == 200) {
                    if (!stage.hasMesos((10 * 1E8))) {
                        npc.meFlip().say("抱歉..你沒有 " + parseInt((10 * 1E8)) + " 億楓幣");
                        return;
                    }

                    if (npc.meFlip().askYesNo("確認要保留潛能變更物品嗎?") == 1) {
                        stage.loseMesos((10 * 1E8));
                    }
                } else {
                    if (parseInt(G_money(stage, db)) < careerId) {
                        npc.meFlip().say("抱歉..你沒有 " + careerId + " 星語幣 目前擁有 " + G_money(stage, db));
                        return;
                    }
                    if (npc.meFlip().askYesNo("確認要保留潛能變更物品嗎?") == 1) {
                        D_money(stage, db, -careerId);
                    }
                }
                switch (crl) {
                    case 2:
                        marinchange(stage, util, 1, Equip, equipList[url_16_0], true, 0);
                        break;

                    default:
                        marinchange(stage, util, 1, Equip, equipList[url_16_0], false, crl);
                        break;
                }
                npc.meFlip().say("變更成功");
            } else {
                npc.meFlip().say("抱歉..[ 1 ]的物品不可以進行變更");
            }
            break;
        case 17:
            if (stage.isQuestCompleted(1484) && stage.isQuestCompleted(38391)) {
                npc.meFlip().say("此任務已完成不能重複完成");
                return;
            }
            txt = "想開啟真實之力嗎？\r\n\r\n";
            txt += "需等級達到 260 才可以開啟\r\n\r\n";
            if (npc.meFlip().askYesNo(txt) != 1) return;

            if (stage.getLevel() < 260) {
                npc.meFlip().say("抱歉..你的等級沒有達到260");
                return;
            }
            for (let i = 38391; i <= 38415; i++) {
                stage.completeQuest(i);
            }
            stage.completeQuest(1484);
            stage.gainItem(1713000, 1);
            stage.gainItem(1713001, 1);
            npc.meFlip().say("開啟成功");
            break;
        case 18:
            stage.runScript("expand/occupation")
            break;
        case 19:
            var prohibit = [1182285, 1662002, 1662003, 1012471, 1005823, 1005952, 1006014, 1006025, 1006026, 1073554, 1073616, 1073651, 1073652, 1073653, 1082754, 1082759, 1082766, 1082767, 1082768, 1103352, 1103418, 1103465, 1103466, 1103467, 1152209, 1152211, 1152217, 1152218, 1152219, 1143012, 1302355, 1212129, 1213022, 1214022, 1562010, 1222122, 1232122, 1242139, 1242141, 1252106, 1262051, 1272040, 1282040, 1292022, 1302355, 1312213, 1322264, 1332289, 1362149, 1372237, 1382274, 1402268, 1403022, 1412189, 1422197, 1432227, 1442285, 1452266, 1462252, 1472275, 1482232, 1492245, 1522152, 1532157, 1542128, 1552130, 1582044, 1592022, 1404022];
            var bute = [1212115, 1213017, 1214017, 1222109, 1232109, 1242116, 1252093, 1262017, 1272016, 1292017, 1302333, 1312199, 1332274, 1362135, 1372222, 1382259, 1402251, 1403017, 1412177, 1422184, 1432214, 1442268, 1452252, 1462239, 1472261, 1482216, 1492231, 1522138, 1532144, 1542108, 1552110, 1582017, 1592019, 1004422, 1004423, 1004424, 1004425, 1004426, 1005823, 1052882, 1052887, 1052888, 1052889, 1052890, 1073030, 1073032, 1073033, 1073034, 1073035, 1082636, 1082637, 1082638, 1082639, 1082640, 1102775, 1102794, 1102795, 1102796, 1102797]
            var txt = "剪刀功能\r\n\r\n";
            txt += "每件物品只有 #r10#k 次使用剪刀的限制\r\n";
            txt += "玩家進行物品交易時請注意物品剩餘剪刀次數\r\n";
            txt += "需剪刀的物品放置 [ 1 ] 位置\r\n";
            txt += "每次使用剪刀消耗 #b120#k 樂豆 ( 特殊物品消耗餘額 )\r\n";
            txt += "#r要進行物品剪刀交易嗎?\r\n";
            if (npc.meFlip().askYesNo(txt) != 1) return;
            var judge = false;
            var Equip = stage.getItemBySlot(1, 1);
            if (Equip == null) {
                npc.meFlip().say("抱歉..[ 1 ]位置不能留空");
                return;
            }
            if (bute.indexOf(Equip['itemId']) > -1) {
                judge = true;
            }
            if (prohibit.indexOf(Equip['itemId']) > -1) {
                npc.meFlip().say("抱歉...該物品禁止使用剪刀 #i" + Equip['itemId'] + "#");
                return;
            }
            if (Equip['expireDate'] != 3439728000000) {
                npc.meFlip().say("時限物品禁止使用剪刀");
                return;
            }
            var marin = [];
            marin[0] = parseInt(getCustomData(db, Equip['id'], "scissors") || 0);
            var txt = "剪刀功能\r\n\r\n";
            txt += "#b物品信息：#r#i" + Equip['itemId'] + ":#\r\n";
            txt += "#b剩餘剪刀：#r" + parseInt(10 - marin[0]) + "\r\n";
            if (judge) {
                txt += "#b擁有樂豆：#r" + stage.getCurrency(1) + "\r\n";
                txt += "#b消耗樂豆：#r120\r\n";
            } else {
                txt += "#b擁有星語幣：#r" + G_money(stage, db) + "\r\n";
                txt += "#b消耗星語幣：#r5\r\n";
            }
            txt += "\r\n";
            txt += "#e#r\t\t\t是否立即使用剪刀？\r\n";
            if (npc.meFlip().askYesNo(txt) != 1) return;
            if (parseInt(marin[0]) >= 10) {
                npc.meFlip().say("抱歉。。該物品已達到交易上限");
                return;
            }
            if (judge) {
                if (stage.getCurrency(1) < 120) {
                    npc.meFlip().say("抱歉..你沒有 120 樂豆");
                    return;
                }
                stage.modifyCurrency(1, -120);
            } else {
                if (G_money(stage, db) < 5) {
                    npc.meFlip().say("抱歉..你沒有 5 星語幣");
                    return;
                }
                D_money(stage, db, -5);
            }
            marin[0] += 1;
            setCustomData(stage, db, Equip['id'], "scissors", marin[0]);
            Equip['attribute'] = 1048;
            Equip['title'] = "已剪刀<" + marin[0] + ">次";
            stage.updateItemBySlot(1, 1);
            stage.dropAlertNotice("已進行剪刀 可進行交易一回");
            break;
        case 20:
            if (!stage.isQuestCompleted(1465)) {
                npc.meFlip().say("抱歉..必須完成五轉才可以進行符文重置");
                return;
            }
            if (stage.getLevel() < 200) {
                npc.meFlip().say("抱歉..必須大於200級");
                return;
            }
            if (stage.getFreeSlot(1) < 12) {
                npc.meFlip().say("抱歉..請把裝備欄空出 12 個空位");
                return;
            }
            let equip_bute = {
                0: [-1600, -1601, -1602, -1603, -1604, -1605],
                1: [-1700, -1701, -1702, -1703, -1704, -1705]
            }

            for (let i in equip_bute) {
                for (let n in equip_bute[i]) {
                    equip = stage.getItemBySlot((i == 0 ? -6 : -9), equip_bute[i][n]);
                    if (equip == null) continue;
                    creation = util.makeItem(equip['itemId'], 1);
                    switch (parseInt(i)) {
                        case 0:
                            creation['arcLevel'] = equip['arcLevel'];
                            break;
                        case 1:
                            creation['autLevel'] = equip['autLevel'];
                            break;
                    }
                    stage.gainItem(creation);
                    stage.removeItemBySlot((i == 0 ? -6 : -9), equip_bute[i][n]);
                }
            }
            npc.meFlip().say("重置成功~");
            break;
        case 21:
            if (stage.getJob() == 10112) {
                stage.startQuest(40914)
                stage.completeQuest(40914);
                stage.startQuest(41403)
                stage.completeQuest(41403);
                stage.startQuest(40905)
                stage.completeQuest(40905);
                stage.startQuest(41406)
                stage.completeQuest(41406);
            }
            npc.meFlip().say("神之子武器開放了!");
            break;
        case 22:
            let jobs = {
                "幻獸師": {
                    job: [11212],
                    skills: [112100000, 112000000, 110001501, 110001502, 110001503, 110001504, 110001506, 110001510, 110001512]
                },
                "惡　魔": {
                    job: [3001, 3100, 3110, 3111, 3112],
                    skills: [30010110, 30010185, 30010111]
                },
                "復　仇": {
                    job: [3101, 3120, 3121, 3122],
                    skills: [30010110, 30010185, 30010230, 30010231, 30010232, 30010242]
                },
                "卡　莉": {
                    job: [15003, 15400, 15410, 15411, 15412],
                    skills: [150030079]
                },
                "阿黛爾": {
                    job: [15002, 15100, 15110, 15111, 15112],
                    skills: [150026001]
                },
                "末日反抗者_豹弩": {
                    job: [3000, 3300, 3310, 3311, 3312],
                    skills: [30001026, 30001061, 30001062]
                },
                "劍　豪": {
                    job: [4001, 4100, 4110, 4111, 4112],
                    skills: [40010000, 40010001, 40011288, 40010067, 40011289]
                },
                "隱　月": {
                    job: [2500, 2510, 2511, 2512],
                    skills: [20050285, 250001000]
                },
                "尖　兵": {
                    job: [3600, 3610, 3611, 3612],
                    skills: [30020232, 30020234, 30021235, 30021236, 30021237, 30020240, 30020300]
                },
                "夜　光": {
                    job: [2700, 2710, 2711, 2712],
                    skills: [20040012, 20040216, 20040217, 20040219, 20040221, 20040222]
                },
                "凱　撒": {
                    job: [6100, 6110, 6111, 6112],
                    skills: [60001216, 60001217, 60001218, 60000219, 60001225]
                },
                "槍　神": {
                    job: [3712, 3312, 3212],
                    skills: [30001000, 30001001, 30000002, 30001281]
                },
                "機甲戰神": {
                    job: [3512],
                    skills: [30001000, 30001001, 30000002, 30001281, 30001068, 30000227]
                },
                "精靈遊俠": {
                    job: [2312],
                    skills: [20020109, 20020111, 20020112]
                },
                "狂狼勇士": {
                    job: [2112],
                    skills: [20001295]
                },
                "天使破壞者": {
                    job: [6500, 6510, 6511, 6512],
                    skills: [60011222, 60011216, 60011218]
                },
                "亞克": {
                    job: [15500, 15510, 15511, 15512],
                    skills: [150010079, 150011074, 150011005, 155101006]
                },
                "陰陽師": {
                    job: [4200, 4210, 4211, 4212],
                    skills: [40020000, 40020001, 40020109, 40021227]
                },
                "虎　影": {
                    job: [16400, 16410, 16411, 16412],
                    skills: [160000000, 164001004]
                },
                "墨　玄": {
                    job: [17500, 17510, 17511, 17512],
                    skills: [175001003]
                },
                "幻　影": {
                    job: [2400, 2410, 2411, 2412],
                    skills: [20030012, 20030073, 20031161, 20031203, 20031205, 20030206, 20031207, 20031208, 20031210, 20031251, 20031260, 8001089]
                },
                "琳　恩": {
                    job: [17200, 17210, 17211, 17212],
                    skills: [170011001]
                },
                "暗夜行者": {
                    job: [1400, 1410, 1411, 1412],
                    skills: [10000250]
                },
                "精靈遊俠": {
                    job: [2310, 2311, 2312],
                    skills: [20020109, 20020111, 20020112]
                }
            }
            if (stage.getJob() >= 100 && stage.getJob() <= 512) {
                stage.changeSkillLevel(1005, 1);
            } else if (stage.getJob() >= 1000 && stage.getJob() <= 1512) {
                stage.changeSkillLevel(10001005, 1);
                stage.changeSkillLevel(10001215, 1);
            } else if (stage.getJob() >= 2100 && stage.getJob() <= 2112) {
                stage.changeSkillLevel(20001005, 1);
            } else if (stage.getJob() >= 2200 && stage.getJob() <= 2212) {
                stage.changeSkillLevel(20011005, 1);
            } else if (stage.getJob() >= 3000 && stage.getJob() <= 3512) {
                stage.changeSkillLevel(30001005, 1);
            } else if (stage.getJob() >= 5100 && stage.getJob() <= 5112) {
                stage.changeSkillLevel(50001005, 1);
                stage.changeSkillLevel(50001215, 1);
            } else if (stage.getJob() >= 3600 && stage.getJob() <= 3612) {
                stage.changeSkillLevel(30021005, 1);
            } else if (stage.getJob() >= 2700 && stage.getJob() <= 2712) {
                stage.changeSkillLevel(20041005, 1);
            } else if (stage.getJob() >= 2300 && stage.getJob() <= 2312) {
                stage.changeSkillLevel(20021005, 1);
            } else if (stage.getJob() >= 2400 && stage.getJob() <= 2412) {
                stage.changeSkillLevel(20031005, 1);
            } else if (stage.getJob() >= 3100 && stage.getJob() <= 3112) {
                stage.changeSkillLevel(30011005, 1);
            } else if (stage.getJob() >= 6000 && stage.getJob() <= 6112) {
                stage.changeSkillLevel(60001005, 1);
            } else if (stage.getJob() >= 15002 && stage.getJob() <= 15112) {
                stage.changeSkillLevel(150021005, 1);
            } else if (stage.getJob() >= 6001 && stage.getJob() <= 6512) {
                stage.changeSkillLevel(60011005, 1);
            }
            let judge = false;
            let txt = "前置技能\r\n\r\n";
            txt += "開始效驗你的職業並完成前置技能嗎\r\n";
            if (npc.meFlip().askYesNo(txt) == 1) {
                for (let i in jobs) {
                    if (jobs[i].job.indexOf(stage.getJob()) > -1) {
                        judge = true;
                        for (let n in jobs[i].skills) {
                            stage.dropMessage(0x15, jobs[i].skills[n]);
                            stage.changeSkillLevel(jobs[i].skills[n], 1);
                        }
                        npc.meFlip().say("效驗完成!");
                        break;
                    }
                }
                if (!judge) {
                    npc.meFlip().say("抱歉..沒有效驗到你的前置!\r\n\r\n請聯繫管理員上報你的職業序列 ( #r" + stage.getJob() + "#k )");
                }
            }
            break;
    }
}

function getCustomData(db, onyID, data) {
    var sql = "SELECT * FROM `marin_customdata` WHERE `id` = '" + onyID + "' LIMIT 1;";
    var ret = db.select(sql);
    if (ret.length <= 0) {
        return null;
    } else {
        var split = [];
        split = ret[0].get('customData').split(";");
        for (var n in split) {
            var splitB = split[n].split("=");
            if (splitB.length != 2 || !splitB[0].equals(data)) continue;
            return splitB[1];
        }
        return null;
    }
}

function setCustomData(stage, db, onyID, key, value) {
    var Equip = stage.getItemBySlot(1, 1);
    var sql = "SELECT * FROM `marin_customdata` WHERE `id` = '" + onyID + "' LIMIT 1;";
    var ret = db.select(sql);
    if (ret.length <= 0) {
        db.insert("INSERT INTO `marin_customdata`(`id`, `itemid`, `customData`) VALUES (" + onyID + ", " + Equip['itemId'] + ", '" + key + "=" + value + "');");
        return;
    }
    if (ret[0].get('customData').indexOf(key) <= -1) {
        var info = ret[0].get('customData');
        info = info + ";" + key + "=" + value;
        db.update("UPDATE `marin_customdata` SET `customData` = '" + info + "' WHERE `id` = " + onyID + ";")
        return;
    }
    var split = [];
    split = ret[0].get('customData').split(";");
    var changed = false;
    var newsplit = new StringBuilder();
    for (var n in split) {
        var splitB = split[n].split("=");
        if (splitB.length != 2) continue;
        if (splitB[0].equals(key)) {
            newsplit.append(key);
            newsplit.append("=");
            newsplit.append(value);
            changed = true;
        } else {
            newsplit.append(split[n]);
        }
        newsplit.append(";");
    }
    if (!changed) {
        newsplit.append(key);
        newsplit.append("=");
        newsplit.append(value);
    }
    var ret = db.select(sql);
    var info = ret[0].get('customData');
    var newInfo = key + "=" + value;
    var beforeStat = info.substring(0, info.indexOf(key));
    var from = info.indexOf(";", info.indexOf(key) + key.length);
    var afterStat = from == -1 ? "" : info.substring(from + 1);
    var write = String(beforeStat) + String(newInfo) + (afterStat.length != 0 ? ";" + afterStat : "");
    db.update("UPDATE `marin_customdata` SET `customData` = '" + write + "' WHERE `id` = " + onyID + ";")
}

function StringBuilder() {
    this.arr = new Array();
    this.append = function (str) {
        this.arr.push(str);
    }
    this.tostring = function () {
        return this.arr.join('');
    }
}

function getEquipCareer(equipId, marin) {
    for (var careerId in marin) {
        var careerEquipLists = marin[careerId];
        for (var equipList of careerEquipLists) {
            if (equipList.includes(equipId)) {
                return {careerId: careerId, equipList: equipList};
            }
        }
    }
    return null;
}

function getItemType(itemid) {
    var type = Math.floor(itemid / 10000);
    switch (type) {
        case 100:
            return 0; //帽子
        case 104:
            return 1; //上衣
        case 105:
            return 2; //套裝
        case 106:
            return 3; //褲裙
        case 107:
            return 4; //鞋子
        case 108:
            return 5; //手套
        case 110:
            return 6; //披風
        case 115:
            return 8; //護肩
        case 111:
            return 9; //ring
        case 113:
            return 10; //腰帶
        case 116:
            return 11;//口袋物品
        default:
            if (type == 120) return -1; //銀河
            if (type == 135) return -1; //副手
            var type = Math.floor(type / 10);
            if (type == 12 || type == 13 || type == 14 || type == 15 || type == 17) {
                return 7; //武器
            }
            return -1;
    }
}

function marinchange(stage, util, types, GEquip, CEquip, judge, crl) {
    switch (types) {
        case 1:
            var DEquip = util.makeItem(GEquip['itemId'], 1);
            var EquipStat = [];
            EquipStat[0] = GEquip['expireDate']
            EquipStat[1] = GEquip['title']
            switch (crl) {
                case 0:
                    EquipStat[2] = GEquip['ruc']//可使用卷轴
                    EquipStat[3] = GEquip['cuc']//已使用卷轴
                    EquipStat[4] = (GEquip['baseStr'] - DEquip['baseStr'] <= 0 ? 0 : GEquip['baseStr'] - DEquip['baseStr']);
                    EquipStat[5] = (GEquip['baseDex'] - DEquip['baseDex'] <= 0 ? 0 : GEquip['baseDex'] - DEquip['baseDex']);
                    EquipStat[6] = (GEquip['baseInt'] - DEquip['baseInt'] <= 0 ? 0 : GEquip['baseInt'] - DEquip['baseInt']);
                    EquipStat[7] = (GEquip['baseLuk'] - DEquip['baseLuk'] <= 0 ? 0 : GEquip['baseLuk'] - DEquip['baseLuk']);
                    EquipStat[8] = (GEquip['maxHp'] - DEquip['maxHp'] <= 0 ? 0 : GEquip['maxHp'] - DEquip['maxHp']);
                    EquipStat[9] = (GEquip['maxMp'] - DEquip['maxMp'] <= 0 ? 0 : GEquip['maxMp'] - DEquip['maxMp']);
                    EquipStat[10] = (GEquip['pad'] - DEquip['pad'] <= 0 ? 0 : GEquip['pad'] - DEquip['pad']);
                    EquipStat[11] = (GEquip['mad'] - DEquip['mad'] <= 0 ? 0 : GEquip['mad'] - DEquip['mad']);
                    EquipStat[12] = (GEquip['pdd'] - DEquip['pdd'] <= 0 ? 0 : GEquip['pdd'] - DEquip['pdd']);
                    break;

                case 1:
                    EquipStat[2] = GEquip['ruc'] + GEquip['cuc']
                    EquipStat[3] = 0
                    EquipStat[4] = 0
                    EquipStat[5] = 0
                    EquipStat[6] = 0
                    EquipStat[7] = 0
                    EquipStat[8] = 0
                    EquipStat[9] = 0
                    EquipStat[10] = 0
                    EquipStat[11] = 0
                    EquipStat[12] = 0
                    break;
            }
            EquipStat[13] = GEquip['craft']
            EquipStat[14] = (GEquip['speed'] - DEquip['speed'] <= 0 ? 0 : GEquip['speed'] - DEquip['speed']);
            EquipStat[15] = (GEquip['jump'] - DEquip['jump'] <= 0 ? 0 : GEquip['jump'] - DEquip['jump']);
            EquipStat[16] = GEquip['attribute']
            EquipStat[17] = GEquip['levelUpType']
            EquipStat[18] = GEquip['incSkill']
            EquipStat[19] = GEquip['level']
            EquipStat[20] = GEquip['exp']
            EquipStat[21] = GEquip['durability']
            EquipStat[22] = GEquip['iuc']
            EquipStat[23] = GEquip['puc']
            EquipStat[24] = GEquip['pvpDamage']
            EquipStat[25] = GEquip['reduceReq']
            EquipStat[26] = GEquip['specialAttribute']
            EquipStat[27] = GEquip['durabilityMax']
            EquipStat[28] = GEquip['incReq']
            EquipStat[29] = GEquip['growthEnchant']
            EquipStat[30] = (GEquip['bossDamageR'] - DEquip['bossDamageR'] <= 0 ? 0 : GEquip['bossDamageR'] - DEquip['bossDamageR']);
            EquipStat[31] = (GEquip['ignorePdr'] - DEquip['ignorePdr'] <= 0 ? 0 : GEquip['ignorePdr'] - DEquip['ignorePdr']);
            EquipStat[32] = (GEquip['damageR'] - DEquip['damageR'] <= 0 ? 0 : GEquip['damageR'] - DEquip['damageR']);
            EquipStat[33] = (GEquip['statRate'] - DEquip['statRate'] <= 0 ? 0 : GEquip['statRate'] - DEquip['statRate']);
            EquipStat[34] = GEquip['cuttable']
            EquipStat[35] = GEquip['exGradeOption']
            EquipStat[36] = GEquip['itemState']
            EquipStat[37] = GEquip['grade']
            EquipStat[38] = GEquip['chuc']
            EquipStat[39] = GEquip['soulOption']
            EquipStat[40] = GEquip['soulSocket']
            EquipStat[41] = GEquip['soulOptionId']
            EquipStat[42] = GEquip['arc']
            EquipStat[43] = GEquip['arcExp']
            EquipStat[44] = GEquip['arcLevel']
            EquipStat[45] = GEquip['aut']
            EquipStat[46] = GEquip['autExp']
            EquipStat[47] = GEquip['autLevel']
            EquipStat[48] = GEquip['option1']
            EquipStat[49] = GEquip['option2']
            EquipStat[50] = GEquip['option3']
            EquipStat[51] = GEquip['option4']
            EquipStat[52] = GEquip['option5']
            EquipStat[53] = GEquip['option6']
            EquipStat[54] = GEquip['socket1']
            EquipStat[55] = GEquip['socket2']
            EquipStat[56] = GEquip['socket3']
            var alternate = util.makeItem(CEquip, 1);
            alternate['expireDate'] = EquipStat[0];
            alternate['title'] = EquipStat[1];
            alternate['ruc'] = EquipStat[2];
            alternate['cuc'] = EquipStat[3];
            alternate['baseStr'] += EquipStat[4];
            alternate['baseDex'] += EquipStat[5];
            alternate['baseInt'] += EquipStat[6];
            alternate['baseLuk'] += EquipStat[7];
            alternate['maxHp'] += EquipStat[8];
            alternate['maxMp'] += EquipStat[9];
            alternate['pad'] += EquipStat[10];
            alternate['mad'] += EquipStat[11];
            alternate['pdd'] += EquipStat[12];
            alternate['craft'] += EquipStat[13];
            alternate['speed'] += EquipStat[14];
            alternate['jump'] = EquipStat[15];
            alternate['attribute'] = EquipStat[16];
            alternate['levelUpType'] = EquipStat[17];
            alternate['incSkill'] = EquipStat[18];
            alternate['level'] = EquipStat[19];
            alternate['exp'] = EquipStat[20];
            alternate['durability'] = EquipStat[21];
            alternate['iuc'] = EquipStat[22];
            alternate['puc'] = EquipStat[23];
            alternate['pvpDamage'] = EquipStat[24];
            alternate['reduceReq'] = EquipStat[25];
            alternate['specialAttribute'] = EquipStat[26];
            alternate['durabilityMax'] = EquipStat[27];
            alternate['incReq'] = EquipStat[28];
            alternate['growthEnchant'] = EquipStat[29];
            alternate['bossDamageR'] += EquipStat[30];
            alternate['ignorePdr'] += EquipStat[31];
            alternate['damageR'] += EquipStat[32];
            alternate['statRate'] += EquipStat[33];
            alternate['cuttable'] = EquipStat[34];
            alternate['exGradeOption'] = EquipStat[35];
            alternate['itemState'] = EquipStat[36];
            alternate['grade'] = EquipStat[37];
            alternate['chuc'] = EquipStat[38];
            alternate['soulOption'] = EquipStat[39];
            alternate['soulSocket'] = EquipStat[40];
            alternate['soulOptionId'] = EquipStat[41];
            alternate['arc'] = EquipStat[42];
            alternate['arcExp'] = EquipStat[43];
            alternate['arcLevel'] = EquipStat[44];
            alternate['aut'] = EquipStat[45];
            alternate['autExp'] = EquipStat[46];
            alternate['autLevel'] = EquipStat[47];
            alternate['option1'] = EquipStat[48];
            alternate['option2'] = EquipStat[49];
            alternate['option3'] = EquipStat[50];
            if (judge) {
                alternate['option4'] = EquipStat[51];
                alternate['option5'] = EquipStat[52];
                alternate['option6'] = EquipStat[53];
            }
            switch (crl) {
                case 1:
                    alternate['option4'] = EquipStat[51];
                    alternate['option5'] = EquipStat[52];
                    alternate['option6'] = EquipStat[53];
                    break;
            }
            alternate['socket1'] = EquipStat[54];
            alternate['socket2'] = EquipStat[55];
            alternate['socket3'] = EquipStat[56];
            stage.gainItem(alternate);
            stage.removeItemBySlot(1, 1);
            break;
    }
}

function getRandom(min, max) {
    var floatRandom = Math.random()
    var difference = max - min
    var random = Math.round(difference * floatRandom)
    var randomWithinRange = random + min
    return randomWithinRange
}


function marinString(charToFill, totalLength, originalString) {
    const doubleByteChars = /[\u0391-\uFFE5]/g;
    const lengthOfDoubleByteChars = String(originalString).replace(doubleByteChars, "aa").length;
    const charactersToFill = charToFill.repeat(totalLength - lengthOfDoubleByteChars);
    const finalStringArray = [originalString, charactersToFill];
    const finalString = finalStringArray.slice(0, totalLength).join("");
    return finalString;
}

function G_money(stage, db) {
    var ret = db.select("SELECT `money` FROM `account` WHERE `id` = '" + stage.getAccountId() + "' LIMIT 1;");
    return ret[0].get('money');
}

function D_money(stage, db, count) {
    return db.update("UPDATE `account` SET `money` = money+" + count + " WHERE `id` = " + stage.getAccountId() + ";");
}

function setSub(stage, db, sub) {
    db.update("UPDATE `character_stat` SET `vassal_sub` = " + sub + " WHERE `id` = " + stage.getCharacterId() + ";");
}

function isInputNaN(value) {
    return isNaN(value);
}

function getRandomIdByProbability(pro) {
    let totalProbability = Object.values(pro).reduce((acc, val) => acc + val, 0);
    let randomNum = Math.random() * totalProbability;
    let cumulativeProbability = 0;
    let idsWithSameProb = [];
    for (let id in pro) {
        cumulativeProbability += pro[id];
        if (randomNum <= cumulativeProbability) {
            idsWithSameProb.push(id);
        }
    }
    if (idsWithSameProb.length > 1) {
        return idsWithSameProb[Math.floor(Math.random() * idsWithSameProb.length)];
    } else {
        return idsWithSameProb[0];
    }
}
