let slideMenu = exports;

slideMenu.askDefault = function (npc, stage, map) {
        let menus = [["六條岔道", 104020000], ["弓箭手村", 100000000], ["魔法森林", 101000000], ["勇士之村", 102000000], ["墮落城市", 103000000],
                ["維多利亞港", 104000000], ["奇幻村", 105000000], ["鯨魚號", 120000000], ["耶雷弗", 130000000],
                ["瑞恩", 140000000], ["天空之城", 200000000], ["冰原雪域", 211000000], ["玩具城", 220000000],
                ["地球防衛本部", 221000000], ["童話村", 222000000], ["水世界", 230000000], ["神木村", 240000000],
                ["武陵", 250000000], ["靈藥幻境", 251000000], ["納希沙漠", 260000000], ["瑪迦提亞", 261000000],
                ["埃德爾斯坦", 310000000], ["櫻花處", 101050000], ["克里提亞斯", 241000000], ["天堂", 310070000],
                ["萬神殿", 400000000], ["被遺棄的露營地", 105300000], ["野蠻之星", 402000000], ["賽爾尼溫", 410000500],
                ["阿爾克斯", 410003000], ["奧迪溫", 410007000]];
        let msg = "";
        for (let i = 0; i < menus.length; i++) {
                if (parseInt(map.getId() / 100000) != parseInt(menus[i][1] / 100000)) {
                        msg += "#" + i + "#" + menus[i][0];
                }
        }
        let sel = npc.slideType(5).askSlideMenu(msg);
        let mapId = menus[sel][1];
        stage.changeMap(mapId, 0);
}

slideMenu.askPromessa = function (npc, stage) {
        let menus = [["弓箭手村", 100000000], ["魔法森林", 101000000], ["勇士之村", 102000000], ["墮落城市", 103000000],
                ["維多利亞港", 104000000], ["奇幻村", 105000000], ["鯨魚號", 120000000], ["耶雷弗", 130000000],
                ["瑞恩", 140000000], ["天空之城", 200000000], ["冰原雪域", 211000000], ["玩具城", 220000000],
                ["地球防衛本部", 221000000], ["童話村", 222000000], ["水世界", 230000000], ["神木村", 240000000],
                ["桃花仙境", 250000000], ["靈藥幻境", 251000000], ["納希綠洲城", 260000000], ["瑪迦提亞城", 261000000],
                ["埃德爾斯坦", 310000000], ["櫻花處", 101050000], ["萬神殿", 400000000], ["克里提亞斯", 241000000],
                ["天堂", 310070000], ["野蠻之星", 402000000], ["賽爾尼溫", 410000500], ["阿爾克斯", 410003000],
                ["奧迪溫", 410007000]];
        let msg = "";
        for (let i = 0; i < menus.length; i++) {
                msg += "#" + i + "#" + menus[i][0];
        }
        let sel = npc.slideType(6).askSlideMenu(msg);
        let mapId = menus[sel][1];
        stage.changeMap(mapId, 0);
}