var itemlistall = [
    ['戰士',
        [
            [1005980, ""],//無盡輝耀騎士頭盔
            [1042433, ""],//無盡輝耀騎士盔甲
            [1062285, ""], //無盡輝耀騎士褲
            [1152212, ""], //無盡輝耀騎士護肩

        ],
        [
            [4021043, 100, "金幣購買,裝備分解"]//匠人之心
            , [2634472, 10, "BOSS掉落,交換硬幣"]
        ], "無盡輝耀"
    ]
    ,
    ['法師',
        [

            [1005981, ""],//無盡輝耀魔法師帽
            [1042434, ""],//無盡輝耀魔法師長袍
            [1062286, ""], //無盡輝耀魔法師褲
            [1152213, ""], //無盡輝耀法師護肩
        ],
        [
            [4021043, 100, "金幣購買,裝備分解"]//匠人之心
            , [2634472, 10, "BOSS掉落,交換硬幣"]
        ]
    ]
    , ['弓箭手',
        [

            [1005982, ""],//無盡輝耀弓箭手帽
            [1042435, ""],//無盡輝耀弓箭手斗篷
            [1062287, ""], //無盡輝耀弓箭手褲
            [1152214, ""], //無盡輝耀弓箭手護肩

        ], [
            [4021043, 100, "金幣購買,裝備分解"]//匠人之心
            , [2634472, 10, "BOSS掉落,交換硬幣"]
        ]
    ], ['飛俠',
        [

            [1005983, ""],//無盡輝耀飛俠頭巾
            [1042436, ""],//無盡輝耀飛俠襯衫
            [1062288, ""], //無盡輝耀飛俠褲
            [1152215, ""], //無盡輝耀飛俠護肩

        ], [
            [4021043, 100, "金幣購買,裝備分解"]//匠人之心
            , [2634472, 10, "BOSS掉落,交換硬幣"]
        ]
    ]
    , ['海盜',
        [

            [1005984, ""],//無盡輝耀海盜帽
            [1042437, ""],//無盡輝耀海盜大衣
            [1062289, ""], //無盡輝耀海盜褲
            [1152216, ""], //無盡輝耀海盜護肩

        ], [
            [4021043, 100, "金幣購買,裝備分解"]//匠人之心
            , [2634472, 10, "BOSS掉落,交換硬幣"]
        ]
    ]
    , ['帽子',
        [
            [1005980, 14],//無盡輝耀騎士頭盔
            [1005981, 14],//無盡輝耀魔法師帽
            [1005982, 14],//無盡輝耀弓箭手帽
            [1005983, 14],//無盡輝耀飛俠頭巾
            [1005984, 14],//無盡輝耀海盜帽
        ]
    ]
    , ['上衣',
        [
            [1042433, 14],//無盡輝耀騎士盔甲
            [1042434, 14],//無盡輝耀魔法師長袍
            [1042435, 14],//無盡輝耀弓箭手斗篷
            [1042436, 14],//無盡輝耀飛俠襯衫
            [1042437, 14],//無盡輝耀海盜大衣
        ]
    ]
    , ['褲子',
        [
            [1062285, 14], //無盡輝耀騎士褲
            [1062286, 14], //無盡輝耀魔法師褲
            [1062287, 14], //無盡輝耀弓箭手褲
            [1062288, 14], //無盡輝耀飛俠褲
            [1062289, 14], //無盡輝耀海盜褲
        ]
    ]
    , ['護肩',
        [
            [1152212, 20], //無盡輝耀騎士褲
            [1152213, 20], //無盡輝耀魔法師褲
            [1152214, 20], //無盡輝耀弓箭手褲
            [1152215, 20], //無盡輝耀飛俠褲
            [1152216, 20], //無盡輝耀海盜褲
        ]
    ]
]
var itemlistall2 = [
    ['上衣',
        [
            [1042433, 14],//無盡輝耀騎士盔甲
            [1042434, 14],//無盡輝耀魔法師長袍
            [1042435, 14],//無盡輝耀弓箭手斗篷
            [1042436, 14],//無盡輝耀飛俠襯衫
            [1042437, 14],//無盡輝耀海盜大衣
        ]
    ]
    , ['褲子',
        [
            [1062285, 14], //無盡輝耀騎士褲
            [1062286, 14], //無盡輝耀魔法師褲
            [1062287, 14], //無盡輝耀弓箭手褲
            [1062288, 14], //無盡輝耀飛俠褲
            [1062289, 14], //無盡輝耀海盜褲
        ]
    ]
    , ['護肩',
        [
            [1152212, 20], //無盡輝耀騎士褲
            [1152213, 20], //無盡輝耀魔法師褲
            [1152214, 20], //無盡輝耀弓箭手褲
            [1152215, 20], //無盡輝耀飛俠褲
            [1152216, 20], //無盡輝耀海盜褲
        ]
    ]
    
    , ['帽子',
        [
            [1005980, 14],//無盡輝耀騎士頭盔
            [1005981, 14],//無盡輝耀魔法師帽
            [1005982, 14],//無盡輝耀弓箭手帽
            [1005983, 14],//無盡輝耀飛俠頭巾
            [1005984, 14],//無盡輝耀海盜帽
        ]
    ]
]
var itemlistall3 = [
    ['鞋子',
        [
            [1073629, 28],//無盡輝耀騎士盔甲
            [1073630, 28],//無盡輝耀魔法師長袍
            [1073631, 28],//無盡輝耀弓箭手斗篷
            [1073632, 28],//無盡輝耀飛俠襯衫
            [1073633, 28],//無盡輝耀海盜大衣
        ]
    ]
    , ['披風',
        [
            [1103437, 24], //無盡輝耀騎士褲
            [1103436, 24], //無盡輝耀魔法師褲
            [1103435, 24], //無盡輝耀弓箭手褲
            [1103434, 24], //無盡輝耀飛俠褲
            [1103433, 24], //無盡輝耀海盜褲
        ]
    ]
    , ['手套',
        [
            [1082764, 20], //無盡輝耀騎士褲
            [1082763, 20], //無盡輝耀魔法師褲
            [1082762, 20], //無盡輝耀弓箭手褲
            [1082761, 20], //無盡輝耀飛俠褲
            [1082760, 20], //無盡輝耀海盜褲
        ]
    ]
]
module.exports = {
    itemlistall: itemlistall,
    itemlistall2: itemlistall2,
    itemlistall3: itemlistall3
};