// Created by MetaMS
// [潘]  |  [2159018]
// MapName:休菲凱曼的招待所


let selection = npc.askMenu("#e<組隊任務 :冰騎士的詛咒>#n\r\n等一下，噓…！ 安靜！不然會被冰騎士發現。收到他的詛咒的話，會變成在我旁邊的朋友一樣…我就直說。幫我的朋友脫離冰騎士的詛咒！！\r\n#b#L0#我會幫你的朋友。#l\r\n#L1#想知道到底發生什麼事情。#l\r\n#L2#想要拿到冰騎士的特別的道具。#l\r\n#L3#想要知道今天剩餘的挑戰次數。#l\r\n\r\n");
switch (selection) {
        case 0:
                npc.say("#e<組隊任務：冰騎士的詛咒>#n\r\n目前準備中。即將以新的組隊任務來進行。");
                break;
        case 1:
                npc.next().say("我認為除了我自己是大人以外，其他的小孩都非常幼稚，所以如果要跟著我的話，一定是要無條件聽大人話的小孩，像平時一樣在玩捉迷藏的時候，變成鬼的約翰有點膽小。他的樣子看起來很好笑，只是開他玩笑而已……");
                npc.next().say("約翰說想要變得更勇敢，想要變成全部的人都可以認定他是個勇敢的人，所以被冰騎士欺騙後受到詛咒而變成這個模樣，請幫助我的朋友約翰！如果不快點解開詛咒的話，約翰也會像冰騎士一樣遺失了人類的心靈。");
                break;
        case 2:
                let sel = npc.askMenu("聽說#b消滅冰凍騎士#k時可獲得#b#t4001529##k，而且對其進行加工即可製作特別的道具。如果你消滅冰凍騎士、解除詛咒，並且把#t4001529#帶過來，我就救你。\r\n#L0##i1152127:##t1152127# - #t4001529#20個#l\r\n#L1##i1072819:##t1072819# - #t4001529#10個#l\r\n#L2##i2041513:##t2041513# - #t4001529#10個#l\r\n#L3##i2041514:##t2041514# - #t4001529#10個#l");

                npc.say("確定#b#t4001529##k帶來了需要的數量嗎？不要想騙我。");
                break;
        case 3:
                stage.startQuest(7920, "0");//Quest Name:Unknown
                stage.startQuest(7921, util.getStringDate("yy/MM/dd"));//Quest Name:Unknown
                npc.say("今天剩餘的挑戰次數是10次。");
                break;
}