// Created by MetaMS
// [休菲凱曼]  |  [2042010]
// MapName:休菲凱曼的招待所


let selection = npc.askMenu("#e<競爭活動 : 怪物擂台賽>#n\r\n技癢的冒險家都來參加怪物擂台賽吧.#b\r\n\r\n#L2# 我想參加怪物擂台賽.#l\r\n#L0# 我想了解怪物擂台賽.#l\r\n#L1# 我想用閃亮的楓葉黃金標誌交換其他道具.#l");
switch (selection) {
        case 0:
                npc.next().say("#b怪物擂台賽#k是與其他人組隊競爭，看看誰能在最短的時間消滅更多怪物，取得更高的分數。和其他人組隊後，只要召喚怪物或使用技能擊敗怪物就行了。");
                npc.next().say("問我一個人行不行?呵呵呵.那沒什麼好擔心的.我會幫忙找適合的人.你只要表明有沒有意願參加.找到人的話我會叫你.\r\n - #e等級#n : 110以上 ~ 130以下 \r\n - #e獲得道具#n :\r\n#i1012373:# #t1012373#\r\n#i1102556:# #t1102556#\r\n#i1122248:# #t1122248#");
                break;
        case 1:
                npc.say("搞什麼？你一個#t4001254#都沒有嘛，想得到#i1012373:# #t1012373#、#i1102556:# #t1102556#或#i1122248:# #t1122248#的話就去收集#b#i4001254# #t4001254##k。");
                break;
        case 2:
                npc.say("怪物擂台賽暫時關閉. 去找別的樂趣如何? 呵呵.");
                break;
}