// Created by MetaMS
// [凯尼斯]  |  [9400922]
// MapName:凯尼斯的家


let selection = npc.id(9400922).ui(1).askMenu("#face1#有像你這樣厲害的勇士在我們的村莊裡，真是令人覺得可靠呢。\r\n#L0# 問候 #l\r\n#L1# 說說關於房子的事情 #l");
if (selection == 0) {
        npc.id(9400922).ui(1).next().say("#face1#我剛吃完晚餐正要回家呢。你吃過晚飯了嗎？今天去的餐廳很好吃呢，改天我們一起去吧。");
} else if (selection == 1) {
        npc.id(9400922).ui(1).next().say("#face1#呵呵，家啊…\r\n小時候對我來說，家只是單純睡覺的地方而已。能夠有一個地方能夠讓疲憊的身軀躺下休息就很滿足了。");
        npc.id(9400922).ui(1).next().say("#face1#但是在遇見我深愛的妻子之後，我的想法開始有些改變。家是與家人共度大部分時間的地方，也是充滿回憶的空間，已經成為我非常珍貴的地方了。 ");
        npc.id(9400922).ui(1).next().say("#face1#每個人對於家的想法都不同。你問１０位克蘭西亞居民，你會得到１０種不同的答案。");
        npc.id(9400922).ui(1).next().say("#face1#家對你來說代表了什麼呢？");
}