// Created by MetaMS
// [Unknown]  |  [5039]
// MapName:麗娜的家

let loop = true;
/* Update Quest RecordEx | Id:101858 | Name: Unknown | Data: "start=1" */
if (!"1".equals(stage.getQuestRecordEx(101858, "start"))) {
        stage.updateQuestRecordEx(101858, "start", "1");
}
let total = stage.getIntWorldShareRecord(256, "count");
let win = stage.getIntWorldShareRecord(256, "win");
while (loop) {
        let selection = npc.id(9270321).askMenu("#b#e你是來參加<戰鬥吧！傳說的回歸>#k#n的嗎？\r\n#e累積勝利次數：" + win + "次#k\r\n#e累積失敗次數：" + (total - win) + "次#k\r\n\r\n#L1##b#e我要參加<戰鬥吧！傳說的回歸>#k#n。#l\r\n#L2##b#e我想領取<累積勝利次數獎勵>#k#n。#l\r\n#L3##b#e我想瞭解<戰鬥吧！傳說的回歸>#k#n。#l\r\n#L4##b#e我想瞭解<活動期間>#k#n。#l\r\n\r\n#L5#和達利額對話#l\r\n\r\n#L99#沒有其他疑問了。#l");
        switch (selection) {
                case 5:
                        npc.id(9270321).next().say("這裡就是聚集著最高榮譽的人的地方，真是偉大的地方。");
                        npc.id(9270321).next().say("嗯？有什麼事嗎？\r\n你問我為什麼我的身體會這麼奇怪？");
                        npc.id(9270321).next().say("那是祕密。我的身體是投影，這件事不重要吧？");
                        break;
                case 4:
                        npc.id(9270321).next().say("很高興見到你。\r\n\r\n#r#e[活動期間]#n\r\n - 2025年06月11日 維護後\r\n ~ 2025年06月24日 下午11點59分為止#k\r\n\r\n#r#e[排名獎勵領取期間]#n\r\n - 2025年07月30日 維護後\r\n ~ 2025年08月12日 下午11點59分為止#k");
                        break;
                case 3:
                        let loop2 = true;
                        while (loop2) {
                                let qSel = npc.id(9270321).askMenu("需要我幫忙嗎？\r\n\r\n#L1##b#e我想瞭解<參加方法>#k#n。#l\r\n#L2##b#e我想瞭解<累積勝利獎勵>#k#n。#l\r\n#L3##b#e我想瞭解<排行獎勵>#k#n。#l\r\n#L4##b#e我想瞭解<活動期間>#k#n。#l\r\n\r\n#L99#沒有其他疑問了。#l");
                                switch (qSel) {
                                        case 1:
                                                npc.id(9270321).next().say("\r\n#b#e<戰鬥吧！傳說的回歸>#n#k是成為傳說中的人物，以3對3的方式#b進行戰鬥的遊戲#k。");
                                                npc.id(9270321).next().say("\r\n進入遊戲時請選擇適合勇士的角色。\r\n#b角色是戰鬥時使用的角色#k，分別具有專用外型和#b專用技能#k。");
                                                npc.id(9270321).next().say("\r\n戰鬥開始時在狩獵場上消滅怪物或使用技能壓制對方，即可獲得#b經驗值和黃金#k。");
                                                npc.id(9270321).next().say("\r\n獲得的經驗值可用來#b升級角色#k，並且可用黃金\r\n#b強化角色#k。");
                                                npc.id(9270321).next().say("\r\n顯示在遊戲上方的咕咕鐘的時間結束時，將會開始生死戰。\r\n在生死戰中#b將敵隊全數消滅#k的隊伍即可獲勝。");
                                                npc.id(9270321).next().say("\r\n遊戲結束時，我會#e根據結果提供#b收藏點數#k#n。\r\n#r勝利：300點\r\n失敗：150點#k");
                                                npc.id(9270321).next().say("\r\n不誠實參加遊戲，或在遊戲結束前\r\n離開的勇士將無法獲得獎勵。不僅如此，\r\n那些勇士#r將無法參與遊戲10分鐘到30分鐘#k。");
                                                npc.id(9270321).next().say("\r\n戰鬥吧！傳說的回歸的說明到此為止。\r\n\r\n那麼，今天也祝你有美好的一天。");
                                                break;
                                        case 2:
                                                npc.id(9270321).next().say("用各角色達成累積勝利次數就送你獎勵。\r\n\r\n#e#b[用卡伊琳角色獲勝20次]#k#n\r\n#i2639406:# #t2639406:#\r\n\r\n#e#b[用麥吉角色獲勝20次]#k#n\r\n#i2632434:# #t2632434:#\r\n\r\n#e#b[用麥克角色獲勝20次]#k#n\r\n#i2632435:# #t2632435:#\r\n\r\n#e#b[用達克魯角色獲勝20次]#k#n\r\n#i2632436:# #t2632436:#\r\n\r\n#e#b[用漢斯角色獲勝20次]#k#n\r\n#i2632437:# #t2632437:#\r\n\r\n#e#b[用武公角色獲勝20次]#k#n\r\n#i2632438:# #t2632438:#\r\n\r\n#e#b[用赫麗娜角色獲勝20次]#k#n\r\n#i2632439:# #t2632439:#\r\n\r\n#e#b[用小蘭角色獲勝20次]#k#n\r\n#i2632440:# #t2632440:#\r\n\r\n#e#b[用琉德角色獲勝20次]#k#n\r\n#i2632441:# #t2632441:#\r\n\r\n#e#b[用溫莉角色獲勝20次]#k#n\r\n#i2632442:# #t2632442:#\r\n\r\n#e#b[用波羅&普里托角色獲勝20次]#k#n\r\n#i2632443:# #i2632444:#波羅&普里托面具交換券");
                                                break;
                                        case 3:
                                                npc.id(9270321).next().say("達成特定排名以上的勇士將可獲得獎勵。\r\n\r\n#b#e[傳說：第1～100名]#n\r\n#n#k - #i1143355:#  #t1143355:#\r\n - #k#i3019535:#  #t3019535:#\r\n - #i2637777:#  #t2637777:#\r\n - #i2637778:#  #t2637778:#\r\n - #k#i2637607:#  #t2637607:#\r\n\r\n#e#b[鑽石：第101～1,000名]#n\r\n#n#k - #i1143356:#  #t1143356:#\r\n - #i2637777:#  #t2637777:#\r\n - #i2637778:#  #t2637778:#\r\n - #k#i2637607:#  #t2637607:#\r\n\r\n#e#b[黃金：第1,001～10,000名]#n\r\n#n#k - #i1143357:#  #t1143357:#\r\n - #i2637778:#  #t2637778:#\r\n - #k#i2637607:#  #t2637607:#\r\n\r\n#e#b[銀：第10,001～30,000名]#n\r\n#n#k - #i1143358:#  #t1143358:#\r\n - #k#i2637607:#  #t2637607:#");
                                                npc.id(9270321).next().say("達成特定排名時請別忘記來找我。\r\n\r\n#r#e[排名獎勵領取期間]#n\r\n - 2025年7月30日維護後\r\n ~ 2025年8月12日下午11點59分為止#k");
                                                break;
                                        case 4:
                                                npc.id(9270321).next().say("請及時來找我。\r\n\r\n#r#e[活動期間]#n\r\n - 2025年6月11日上午9點開始\r\n ~ 2025年6月24日下午11點59分為止#k\r\n\r\n#r#e[排名獎勵領取期間]#n\r\n - 2025年7月30日維護後\r\n ~ 2025年8月12日下午11點59分為止#k");
                                                break;
                                        case 99:
                                                loop2 = false;
                                                break;
                                }
                        }
                        break;
                case 2:
                        npc.id(9270321).next().say("用各角色達成累積勝利次數就送你獎勵。\r\n\r\n#e#b[用卡伊琳角色獲勝20次]#k#n\r\n#i2639406:# #t2639406:#\r\n\r\n#e#b[用麥吉角色獲勝20次]#k#n\r\n#i2632434:# #t2632434:#\r\n\r\n#e#b[用麥克角色獲勝20次]#k#n\r\n#i2632435:# #t2632435:#\r\n\r\n#e#b[用達克魯角色獲勝20次]#k#n\r\n#i2632436:# #t2632436:#\r\n\r\n#e#b[用漢斯角色獲勝20次]#k#n\r\n#i2632437:# #t2632437:#\r\n\r\n#e#b[用武公角色獲勝20次]#k#n\r\n#i2632438:# #t2632438:#\r\n\r\n#e#b[用赫麗娜角色獲勝20次]#k#n\r\n#i2632439:# #t2632439:#\r\n\r\n#e#b[用小蘭角色獲勝20次]#k#n\r\n#i2632440:# #t2632440:#\r\n\r\n#e#b[用琉德角色獲勝20次]#k#n\r\n#i2632441:# #t2632441:#\r\n\r\n#e#b[用溫莉角色獲勝20次]#k#n\r\n#i2632442:# #t2632442:#\r\n\r\n#e#b[用波羅&普里托角色獲勝20次]#k#n\r\n#i2632443:# #i2632444:#波羅&普里托面具交換券");
                        let itemEx = npc.id(9270321).askMenu("\r\n用各角色達成#b累積勝利20次#k，就送#b角色面具交換券#k。\r\n#e#L1##b#i2632434:# #t2632434:#(0/20)#k#l\r\n#e#L2##b#i2632435:# #t2632435:#(0/20)#k#l\r\n#e#L3##b#i2632436:# #t2632436:#(0/20)#k#l\r\n#e#L4##b#i2632437:# #t2632437:#(0/20)#k#l\r\n#e#L5##b#i2632438:# #t2632438:#(0/20)#k#l\r\n#e#L6##b#i2632439:# #t2632439:#(0/20)#k#l\r\n#e#L7##b#i2632440:# #t2632440:#(0/20)#k#l\r\n#e#L8##b#i2632441:# #t2632441:#(0/20)#k#l\r\n#e#L9##b#i2632442:# #t2632442:#(0/20)#k#l\r\n#e#L10##b#i2632443:##i2632444:#波羅和普里托面具交換券(0/20)#k#l\r\n#e#L11##b#i2639406:# #t2639406:#(0/20)#k#l\r\n\r\n#n#k#L99#現在不想領取。#l");
                        if (itemEx == 1) {
                                npc.id(9270321).next().say("尚未用選擇的角色達成#e#b累積勝利20次#k#n。");
                        }
                        break;
                case 1:
                        if (npc.id(9270321).askYesNo("#b#e要參加<戰鬥吧！傳說的回歸>#k#n嗎？\r\n\r\n#e在<戰鬥吧！傳說的回歸>#n中，僅限使用和小遊戲有關的\r\n#r#e系統#n#k。\r\n\r\n套用中的#e加持效果#n \r\n可能會#e#r消失，#k#n請慎重選擇。")) {
                                loop = false;
                                stage.changeMap(921174007, 0);
                        } else {
                                /* Response is No */
                                npc.id(9270321).say("你會回來吧？");
                        }
                        break;
                case 99:
                        loop = false;
                        break;
        }
}