// Created by MetaMS
// [Unknown]  |  [64]
// MapName:霧氣森林修煉場

let flag = true;
while (flag) {
        let selection = npc.id(2091011).askMenu("\r\n迷霧森林修練場是武陵道場仙人的秘密修練場。\r\n#L0##b 告訴我關於<召喚怪物>的事。#k#l\r\n#L1##b 告訴我關於<戰地設定>的事。#k#l\r\n#L2##b 告訴我關於<便利功能>的事。#k#l\r\n#L3##b 沒有其他疑問了。#k#l\r\n");
        switch (selection) {
                case 0:
                        npc.id(2091011).next().say("告訴我關於\r\n#b#e<召喚怪物>的事。#k#n\r\n");
                        npc.id(2091011).next().say("\r\n #b#e<召喚怪物>#k#n是操控怪物的能力值，可召喚想要的\r\n能力值設定怪物的功能。\r\n\r\n點擊上端的#b詳細設定鍵#k，就能依照想要的方式輸入種類、等級、防禦率、大小、體力、屬性減半等輸入怪物的詳細能力值。\r\n\r\n\r\n 輸入想要的數值後，按下#b召喚鍵#k，就會召喚符合輸入\r\n能力值的怪物。");
                        npc.id(2091011).next().say("\r\n使用解除召喚功能後，戰場上的怪物就會消失不見。\r\n點擊#b解除召喚鍵#k後，目前在戰場上最新召喚的怪物會消失。\r\n\r\n 點擊#b統一解除召喚鍵#k後，戰場上的所有怪物會\r\n消失。");
                        npc.id(2091011).next().say("\r\n不過，只有#r#e隊長#k#n具備怪物相關之所有功能的操作權限。");
                        break;
                case 1:
                        npc.id(2091011).next().say("告訴我關於\r\n#b#e<戰地設定>#k#n的事。\r\n");
                        npc.id(2091011).next().say("\r\n#b#e<戰地設定>#k#n是能操控場地套用的力量種類與數值的功能。\r\n\r\n在#b力量種類目錄#k可選擇星力、神秘力量和真實之力其中一個。\r\n\r\n 在#b戰地之力領域#k可輸入想要的力量數值。\r\n\r\n輸入力量種類與戰地力量，按下#b設定鍵#k就會依照想要的數值套用戰地之力的資訊。");
                        npc.id(2091011).next().say("\r\n 點擊#b設定重置鍵#k，目前套用的戰地之力資訊全都會重置。\r\n\r\n套用的力量會變成什麼都沒有的狀態。\r\n\r\n不過，按下設定鍵或設定重置鍵後，目前戰場召喚的#r所有怪物都會消失不見#k，因此請多加注意。");
                        npc.id(2091011).next().say("\r\n不過，只有#r#e隊長#k#n具備戰地相關之所有功能的操作權限。");
                        break;
                case 2:
                        npc.id(2091011).next().say("\r\n我會講解#b#e<便利功能>#k#n。");
                        npc.id(2091011).next().say("\r\n在迷霧之森修練場使用#b#e<便利功能>#k#n對修練有幫助。\r\n\r\n只有在迷霧森林修練場能#r#e特別#k#n使用。");
                        npc.id(2091011).next().say("\r\n按下#bHP/MP恢復鍵#k，HP與MP可全部恢復為最大值\r\n1次。\r\n\r\n不過，此一功能#r#e不會套用在部分技能，#k#n一定要銘記在心。");
                        npc.id(2091011).next().say("\r\n便利功能#r#e全體隊員#k#n都能使用，請配合需要的情況\r\n妥善運用吧。");
                        break;
                case 3:
                        flag = false;
                        break;
        }
}