// Created by MetaMS
// [湯寶寶]  |  [1097000]
// MapName:休菲凱曼的招待所

let selection = npc.askMenu("#e<組隊任務 : 湯寶寶料理教室>#n\r\n要為鯨魚號的船員們準備好吃的食物嗎? 就讓湯寶寶直接告訴你怎麼做吧.#b\r\n#L0#進入湯寶寶的料理教室.#l \r\n#L1#領取湯寶寶的廚師制服.#l \r\n#L2#聽取關於湯寶寶料理教室相關的說明.#l \r\n#L3#詢問今日剩下的挑戰次數.#l");
switch (selection) {
        case 0:
                if (map.getId() == 912080000) {
                        npc.say("做菜真不簡單。想要進去的話要組成3人以下的組隊進去。其實自己1人的話也是可以組隊進去的。請透過所屬組隊的隊長來進場吧。");
                } else {
                        npc.next().say("料理這玩意可不簡單啊。如果還是想做的話，就跟我來吧。");
                        stage.startQuest(30108, "910002000");//Quest Name:Unknown
                        stage.changeMap(912080000, 0);
                }
                break;
        case 1:
                let sel = npc.askMenu("喔，有料理服的話，代表是做過不少料理的人囉？那應該要給我料理服呀。料理師證照帶來了吧？ \r\n#L0#請給我料理服(料理師證照2個以上)。#l \r\n#L1#請給我料理師帽子(料理師證照3個以上)。#l");
                if (sel == 0) {
                        npc.next().say("帶來了 2個料理師證照對嗎？還是背包裝備欄位已經滿了呢？確認好之後再跟我說吧。");
                } else if (sel == 1) {
                        npc.next().say("帶來了 3個料理師證照對嗎？還是背包裝備欄位已經滿了呢？確認好之後再跟我說吧。");
                }
                break;
        case 2:
                npc.next().say("歡迎。 要像湯寶寶說得那樣子，就是負責海盜們的船，鯨魚號，的廚房長啊。別人叫我好吃又充滿營養的料理大師。 哈哈哈哈哈！你問是誰說的？對啊是誰呢？那有什麼重要。哈哈哈哈！");
                npc.next().say("不過如此優秀的我，最近也遇到了困難。就算一直吃一直吃，還是跟無底洞一樣經常肚子餓的海盜們，就因為他們，使得我就算有三隻手也不夠用啊。也沒辦法叫他們集體減肥。");
                npc.next().say("所以我正在找能在廚房幫我準備料理的人。料理方法很簡單。就是找到配合指定料理的材料後用心地拍打就可以了。雖然火候跟調味也稍微留意，但這一切不會很難的。");
                npc.next().say("料理做得好的話，不管什麼樣的人都會跑來說要吃你的料理，但做不好的話，就會被丟到垃圾桶啊。這關乎於你的實力啊。 怎麼樣呢？你也是看起來有料理的才能，想要做做看嗎？ 一天可以進行5次。\r\n - #e等級#n：60以上#r( 推薦等級：60 ~ 90)#k \r\n - #e限制時間#n：20分鐘\r\n - #e參加人員#n：1~3位\r\n - #e獲得道具#n：\r\n#i1052578:# #t1052578#\r\n#i1003762:# #t1003762#\r\n");
                break;
        case 3:
                stage.startQuest(30106, "0");//Quest Name:Unknown
                stage.startQuest(30105, util.getStringDate("yy/MM/dd"));//Quest Name:Unknown
                npc.say("你今天還剩下5次的挑戰次數喔。");
                break;
}